MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t TPCFG5     : 1;            /* [8..8] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG5     : 1;            /* [9..9] Write Protect Configure                                            */
      __IOM uint32_t SPCFG5     : 1;            /* [10..10] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED1  : 13;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t TPCFG0     : 1;            /* [28..28] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG0     : 1;            /* [29..29] Write Protect Configure                                          */
      __IOM uint32_t SPCFG0     : 1;            /* [30..30] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED3  : 1;
    } bit;
  } PACCTRLB;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) Peripheral Access Control Register D                       */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TPCFG0     : 1;            /* [28..28] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG0     : 1;            /* [29..29] Write Protect Configure                                          */
      __IOM uint32_t SPCFG0     : 1;            /* [30..30] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 1;
    } bit;
  } PACCTRLD;
  __IM  uint32_t  RESERVED2[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Off-Platform Peripheral Access Control Register A          */

    struct {
      __IOM uint32_t TPCFG7     : 1;            /* [0..0] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG7     : 1;            /* [1..1] Write Protect Configure                                            */
      __IOM uint32_t SPCFG7     : 1;            /* [2..2] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t TPCFG6     : 1;            /* [4..4] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG6     : 1;            /* [5..5] Write Protect Configure                                            */
      __IOM uint32_t SPCFG6     : 1;            /* [6..6] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TPCFG5     : 1;            /* [8..8] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG5     : 1;            /* [9..9] Write Protect Configure                                            */
      __IOM uint32_t SPCFG5     : 1;            /* [10..10] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t TPCFG4     : 1;            /* [12..12] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG4     : 1;            /* [13..13] Write Protect Configure                                          */
      __IOM uint32_t SPCFG4     : 1;            /* [14..14] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED3  : 9;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED4  : 1;
      __IOM uint32_t TPCFG0     : 1;            /* [28..28] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG0     : 1;            /* [29..29] Write Protect Configure                                          */
      __IOM uint32_t SPCFG0     : 1;            /* [30..30] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED5  : 1;
    } bit;
  } OPACCTRLA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000044) Off-Platform Peripheral Access Control Register B          */

    struct {
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t TPCFG6     : 1;            /* [4..4] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG6     : 1;            /* [5..5] Write Protect Configure                                            */
      __IOM uint32_t SPCFG6     : 1;            /* [6..6] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TPCFG5     : 1;            /* [8..8] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG5     : 1;            /* [9..9] Write Protect Configure                                            */
      __IOM uint32_t SPCFG5     : 1;            /* [10..10] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t TPCFG4     : 1;            /* [12..12] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG4     : 1;            /* [13..13] Write Protect Configure                                          */
      __IOM uint32_t SPCFG4     : 1;            /* [14..14] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t TPCFG3     : 1;            /* [16..16] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG3     : 1;            /* [17..17] Write Protect Configure                                          */
      __IOM uint32_t SPCFG3     : 1;            /* [18..18] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED4  : 13;
    } bit;
  } OPACCTRLB;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000048) Off-Platform Peripheral Access Control Register C          */

