MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t TPCFG6     : 1;            /* [4..4] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG6     : 1;            /* [5..5] Write Protect Configure                                            */
      __IOM uint32_t SPCFG6     : 1;            /* [6..6] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED1  : 9;
      __IOM uint32_t TPCFG3     : 1;            /* [16..16] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG3     : 1;            /* [17..17] Write Protect Configure                                          */
      __IOM uint32_t SPCFG3     : 1;            /* [18..18] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t TPCFG0     : 1;            /* [28..28] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG0     : 1;            /* [29..29] Write Protect Configure                                          */
      __IOM uint32_t SPCFG0     : 1;            /* [30..30] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED4  : 1;
    } bit;
  } OPACCTRLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000006C) Off-Platform Peripheral Access Control Register L          */

    struct {
      __IOM uint32_t TPCFG7     : 1;            /* [0..0] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG7     : 1;            /* [1..1] Write Protect Configure                                            */
      __IOM uint32_t SPCFG7     : 1;            /* [2..2] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t TPCFG6     : 1;            /* [4..4] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG6     : 1;            /* [5..5] Write Protect Configure                                            */
      __IOM uint32_t SPCFG6     : 1;            /* [6..6] Supervisor Protect Configure                                       */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TPCFG5     : 1;            /* [8..8] Trusted Protect Configure                                          */
      __IOM uint32_t WPCFG5     : 1;            /* [9..9] Write Protect Configure                                            */
      __IOM uint32_t SPCFG5     : 1;            /* [10..10] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED2  : 13;
      __IOM uint32_t TPCFG1     : 1;            /* [24..24] Trusted Protect Configure                                        */
      __IOM uint32_t WPCFG1     : 1;            /* [25..25] Write Protect Configure                                          */
      __IOM uint32_t SPCFG1     : 1;            /* [26..26] Supervisor Protect Configure                                     */
      __IM  uint32_t RESERVED3  : 5;
    } bit;
  } OPACCTRLL;
} AC_T;                                      /* Size = 112 (0x70)                                                            */



/* =========================================================================================================================== */
/* ================                                            MSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Miscellaneous System Control (MSC)
  */

typedef struct {                                /* (@ 0x40001000) MSC Structure                                              */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Processor X Type Register                                  */

    struct {
      __IM  uint32_t CPUxREV    : 8;            /* [7..0] CPUx Processor Revision                                            */
      __IM  uint32_t CPUxSEQ    : 24;           /* [31..8] CPUx Processor Specific Sequence                                  */
    } bit;
  } PCxTYPE;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) CPUx Logical Processor Number Register                     */

    struct {
      __IM  uint32_t CPUxLPNUM  : 1;            /* [0..0] CPUx Logical Processor Number                                      */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } CPUxLPNUM;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000008) CPUx Physical Bus Master Number Register                   */

    struct {
      __IM  uint32_t CPUxPBMNUM : 6;            /* [5..0] CPUx Physical Bus Master Number                                    */
      __IM  uint32_t RESERVED0  : 26;
    } bit;
  } CPUxPBMNUM;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000000C) CPUx Count Register                                        */

    struct {
      __IM  uint32_t PCNT       : 2;            /* [1..0] Processor Count                                                    */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } CPUxCNT;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000010) Processor X Information Register 0                         */

    struct {
      __IM  uint32_t DCWNUML1   : 8;            /* [7..0] Number of Level 1 Data Cache Way                                   */
      __IM  uint32_t DCSIZEL1   : 8;            /* [15..8] Level 1 Data Cache Size                                           */
      __IM  uint32_t ICWNUML1   : 8;            /* [23..16] Number of Level 1 Instruction Cache Way                          */
      __IM  uint32_t ICSIZEL1   : 8;            /* [31..24] Level 1 Instruction Cache Size                                   */
    } bit;
  } PCxINF0;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000014) Processor X Information Register 1                         */

