MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 16;
      __IM  uint32_t ICWNUML2   : 8;            /* [23..16] Number of Level 2 Instruction Cache Way                          */
      __IM  uint32_t ICSIZEL2   : 8;            /* [31..24] Level 2 Instruction Cache Size                                   */
    } bit;
  } PCxINF1;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000018) Processor X Information Register 2                         */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IM  uint32_t TCMHSIZE   : 8;            /* [15..8] Tightly-Coupled Memory Higher Size                                */
      __IM  uint32_t RESERVED1  : 8;
      __IM  uint32_t TCMLSIZE   : 8;            /* [31..24] Tightly-Coupled Memory Lower Size                                */
    } bit;
  } PCxINF2;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000001C) Processor X Information Register 3                         */

    struct {
      __IM  uint32_t FPUFLG     : 1;            /* [0..0] Support Floating Point Unit Flag                                   */
      __IM  uint32_t ISEFLG     : 1;            /* [1..1] Support Instruction Set Extension                                  */
      __IM  uint32_t JHWFLG     : 1;            /* [2..2] Support Jazelle Hardware Flag                                      */
      __IM  uint32_t MMFLG      : 1;            /* [3..3] Support Memory Management Unit Flag                                */
      __IM  uint32_t TZFFLG     : 1;            /* [4..4] Support Trust Zone Function Flag                                   */
      __IM  uint32_t CMPHWFLG   : 1;            /* [5..5] Support Core Memory Protection Hardware Flag                       */
      __IM  uint32_t BBFLG      : 1;            /* [6..6] Support Bit Banding Flag                                           */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t SYSBPNUM   : 2;            /* [9..8] Number of System Bus Ports                                         */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } PCxINF3;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000020) Processor 0 Type Register                                  */

    struct {
      __IM  uint32_t CPU0REV    : 8;            /* [7..0] CPU0 Processor Revision                                            */
      __IM  uint32_t CPU0SEQ    : 24;           /* [31..8] CPU0 Processor Specific Sequence                                  */
    } bit;
  } PC0TYPE;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000024) CPU0 Logical Processor Number Register                     */

    struct {
      __IM  uint32_t CPU0LPNUM  : 1;            /* [0..0] Processor 0 Number                                                 */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } CPU0LPNUM;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000028) CPU0 Physical Bus Master Number Register                   */

    struct {
      __IM  uint32_t CPU0PBMNUM : 6;            /* [5..0] CPU0 Physical Bus Master Number                                    */
      __IM  uint32_t RESERVED0  : 26;
    } bit;
  } CPU0PBNUM;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000002C) CPU0 Count Register                                        */

    struct {
      __IM  uint32_t PCNT       : 2;            /* [1..0] Processor Count                                                    */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } CPU0CNT;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000030) Processor 0 Information Register 0                         */

    struct {
      __IM  uint32_t DCWNUML1   : 8;            /* [7..0] Number of Level 1 Data Cache Way                                   */
      __IM  uint32_t DCSIZEL1   : 8;            /* [15..8] Level 1 Data Cache Size                                           */
      __IM  uint32_t ICWNUML1   : 8;            /* [23..16] Number of Level 1 Instruction Cache Way                          */
      __IM  uint32_t ICSIZEL1   : 8;            /* [31..24] Level 1 Instruction Cache Size                                   */
    } bit;
  } PC0INF0;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000034) Processor 0 Information Register 1                         */

    struct {
      __IM  uint32_t RESERVED0  : 16;
      __IM  uint32_t ICWNUML2   : 8;            /* [23..16] Number of Level 2 Instruction Cache Way                          */
      __IM  uint32_t ICSIZEL2   : 8;            /* [31..24] Level 2 Instruction Cache Size                                   */
    } bit;
  } PC0INF1;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000038) Processor 0 Information Register 2                         */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IM  uint32_t TCMHSIZE   : 8;            /* [15..8] Tightly-Coupled Memory Higher Size                                */
      __IM  uint32_t RESERVED1  : 8;
      __IM  uint32_t TCMLSIZE   : 8;            /* [31..24] Tightly-Coupled Memory Lower Size                                */
    } bit;
  } PC0INF2;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000003C) Processor 0 Information Register 3                         */

    struct {
      __IM  uint32_t FPUFLG     : 1;            /* [0..0] Support Floating Point Unit Flag                                   */
      __IM  uint32_t ISEFLG     : 1;            /* [1..1] Support Instruction Set Extension                                  */
      __IM  uint32_t JHWFLG     : 1;            /* [2..2] Support Jazelle Hardware Flag                                      */
      __IM  uint32_t MMFLG      : 1;            /* [3..3] Support Memory Management Unit Flag                                */
      __IM  uint32_t TZFFLG     : 1;            /* [4..4] Support Trust Zone Function Flag                                   */
      __IM  uint32_t CMPHWFLG   : 1;            /* [5..5] Support Core Memory Protection Hardware Flag                       */
      __IM  uint32_t BBFLG      : 1;            /* [6..6] Support Bit Banding Flag                                           */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t SYSBPNUM   : 2;            /* [9..8] Number of System Bus Ports                                         */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } PC0INF3;
  __IM  uint32_t  RESERVED[240];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000400) On-Chip Memory Descriptor Register 0                       */

