MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t DBEFLG     : 1;            /* [0..0] Destination Bus Error Flag                                         */
      __IM  uint32_t SBEFLG     : 1;            /* [1..1] Source Bus Error Flag                                              */
      __IM  uint32_t SGCFGEFLG  : 1;            /* [2..2] Scatter/Gather Configure Error Flag                                */
      __IM  uint32_t MCCFGEFLG  : 1;            /* [3..3] MINBTCNT/CMAJICNT Configure Error Flag                             */
      __IM  uint32_t DOFCFGEFLG : 1;            /* [4..4] Destination Offset Configure Error Flag                            */
      __IM  uint32_t DADDRCFGEFLG : 1;          /* [5..5] Destination Address Configure Error Flag                           */
      __IM  uint32_t SOFCFGEFLG : 1;            /* [6..6] Source Offset Configure Error Flag                                 */
      __IM  uint32_t SADDRCFGEFLG : 1;          /* [7..7] Source Address Configure Error Flag                                */
      __IM  uint32_t ERRCHNUM   : 4;            /* [11..8] Error Channel Number                                              */
      __IM  uint32_t RESERVED0  : 2;
      __IM  uint32_t CPCFGEFLG  : 1;            /* [14..14] Channel Priority Configure Error Flag                            */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t TCFLG      : 1;            /* [16..16] Transfer Canceled Flag                                           */
      __IM  uint32_t RESERVED2  : 14;
      __IM  uint32_t EEFLG      : 1;            /* [31..31] Error Exist Flag                                                 */
    } bit;
  } ESTS;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Request Enable Register                                    */

    struct {
      __IOM uint32_t REQEN0     : 1;            /* [0..0] Channel 0 DMA Request Enable                                       */
      __IOM uint32_t REQEN1     : 1;            /* [1..1] Channel 1 DMA Request Enable                                       */
      __IOM uint32_t REQEN2     : 1;            /* [2..2] Channel 2 DMA Request Enable                                       */
      __IOM uint32_t REQEN3     : 1;            /* [3..3] Channel 3 DMA Request Enable                                       */
      __IOM uint32_t REQEN4     : 1;            /* [4..4] Channel 4 DMA Request Enable                                       */
      __IOM uint32_t REQEN5     : 1;            /* [5..5] Channel 5 DMA Request Enable                                       */
      __IOM uint32_t REQEN6     : 1;            /* [6..6] Channel 6 DMA Request Enable                                       */
      __IOM uint32_t REQEN7     : 1;            /* [7..7] Channel 7 DMA Request Enable                                       */
      __IOM uint32_t REQEN8     : 1;            /* [8..8] Channel 8 DMA Request Enable                                       */
      __IOM uint32_t REQEN9     : 1;            /* [9..9] Channel 9 DMA Request Enable                                       */
      __IOM uint32_t REQEN10    : 1;            /* [10..10] Channel 10 DMA Request Enable                                    */
      __IOM uint32_t REQEN11    : 1;            /* [11..11] Channel 11 DMA Request Enable                                    */
      __IOM uint32_t REQEN12    : 1;            /* [12..12] Channel 12 DMA Request Enable                                    */
      __IOM uint32_t REQEN13    : 1;            /* [13..13] Channel 13 DMA Request Enable                                    */
      __IOM uint32_t REQEN14    : 1;            /* [14..14] Channel 14 DMA Request Enable                                    */
      __IOM uint32_t REQEN15    : 1;            /* [15..15] Channel 15 DMA Request Enable                                    */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } REQEN;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Error Interrupt Enable Register                            */

    struct {
      __IOM uint32_t EIEN0      : 1;            /* [0..0] Error Interrupt Channel 0 Enable                                   */
      __IOM uint32_t EIEN1      : 1;            /* [1..1] Error Interrupt Channel 1 Enable                                   */
      __IOM uint32_t EIEN2      : 1;            /* [2..2] Channel 2 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN3      : 1;            /* [3..3] Channel 3 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN4      : 1;            /* [4..4] Channel 4 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN5      : 1;            /* [5..5] Channel 5 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN6      : 1;            /* [6..6] Channel 6 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN7      : 1;            /* [7..7] Channel 7 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN8      : 1;            /* [8..8] Channel 8 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN9      : 1;            /* [9..9] Channel 9 Error Interrupt Enable                                   */
      __IOM uint32_t EIEN10     : 1;            /* [10..10] Channel 10 Error Interrupt Enable                                */
      __IOM uint32_t EIEN11     : 1;            /* [11..11] Channel 11 Error Interrupt Enable                                */
      __IOM uint32_t EIEN12     : 1;            /* [12..12] Channel 12 Error Interrupt Enable                                */
      __IOM uint32_t EIEN13     : 1;            /* [13..13] Channel 13 Error Interrupt Enable                                */
      __IOM uint32_t EIEN14     : 1;            /* [14..14] Channel 14 Error Interrupt Enable                                */
      __IOM uint32_t EIEN15     : 1;            /* [15..15] Channel 15 Error Interrupt Enable                                */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } EIEN;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000018) Error Interrupt Enable Clear Register                      */

