MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __OM  uint8_t EIENCLR     : 4;            /* [3..0] Channel Error Interrupt Enable Bit Clear                           */
            uint8_t             : 2;
      __OM  uint8_t AEIENCLR    : 1;            /* [6..6] All Channel Error Interrupt Bits Clear                             */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } EIENCLR;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000019) Error Interrupt Enable Set Register                        */

    struct {
      __OM  uint8_t EIENSET     : 4;            /* [3..0] Channel Error Interrupt Enable Bit Set                             */
            uint8_t             : 2;
      __OM  uint8_t AEIENSET    : 1;            /* [6..6] All Channel Error Interrupt Bits Set                               */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } EIENSET;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001A) Request Enable Clear Register                              */

    struct {
      __OM  uint8_t REQENCLR    : 4;            /* [3..0] DMA Request Enable Clear                                           */
            uint8_t             : 2;
      __OM  uint8_t AREQENCLR   : 1;            /* [6..6] All DMA Requests Enable Clear                                      */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } REQENCLR;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001B) Request Enable Set Register                                */

    struct {
      __OM  uint8_t REQENSET    : 4;            /* [3..0] DMA Request Enable Setup                                           */
            uint8_t             : 2;
      __OM  uint8_t AREQENSET   : 1;            /* [6..6] ALL DMA Requests Enable Set                                        */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } REQENSET;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001C) DONE Status Clear Register                                 */

    struct {
      __OM  uint8_t DNECLR      : 4;            /* [3..0] DONE Field Clear                                                   */
            uint8_t             : 2;
      __OM  uint8_t ADNECLR     : 1;            /* [6..6] All DONE Field Clear                                               */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } DNESTSCLR;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001D) START Set Register                                         */

    struct {
      __OM  uint8_t STATSET     : 4;            /* [3..0] START Field Set                                                    */
            uint8_t             : 2;
      __OM  uint8_t ASTATSET    : 1;            /* [6..6] All START Field Setup                                              */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } STATSET;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001E) Error Status Clear Register                                */

    struct {
      __OM  uint8_t EFLGCLR     : 4;            /* [3..0] Error Flag Clear                                                   */
            uint8_t             : 2;
      __OM  uint8_t AEFLGCLR    : 1;            /* [6..6] All Error Flag Clear                                               */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } ESTSCLR;

  union {
    __OM  uint8_t reg;                          /* (@ 0x0000001F) Interrupt Request Clear Register                           */

    struct {
      __OM  uint8_t INTREQCLR   : 4;            /* [3..0] Interrupt Request Clear                                            */
            uint8_t             : 2;
      __OM  uint8_t AINTREQCLR  : 1;            /* [6..6] All Interrupt Request Clear                                        */
      __OM  uint8_t NOOP        : 1;            /* [7..7] No Operation                                                       */
    } bit;
  } INTREQCLR;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Interrupt Request Register                                 */

    struct {
      __IOM uint32_t INTREQSTS0 : 1;            /* [0..0] Interrupt Request 0 Status                                         */
      __IOM uint32_t INTREQSTS1 : 1;            /* [1..1] Interrupt Request 1 Status                                         */
      __IOM uint32_t INTREQSTS2 : 1;            /* [2..2] Interrupt Request 2 Status                                         */
      __IOM uint32_t INTREQSTS3 : 1;            /* [3..3] Interrupt Request 3 Status                                         */
      __IOM uint32_t INTREQSTS4 : 1;            /* [4..4] Interrupt Request 4 Status                                         */
      __IOM uint32_t INTREQSTS5 : 1;            /* [5..5] Interrupt Request 5 Status                                         */
      __IOM uint32_t INTREQSTS6 : 1;            /* [6..6] Interrupt Request 6 Status                                         */
      __IOM uint32_t INTREQSTS7 : 1;            /* [7..7] Interrupt Request 7 Status                                         */
      __IOM uint32_t INTREQSTS8 : 1;            /* [8..8] Interrupt Request 8 Status                                         */
      __IOM uint32_t INTREQSTS9 : 1;            /* [9..9] Interrupt Request 9 Status                                         */
      __IOM uint32_t INTREQSTS10 : 1;           /* [10..10] Interrupt Request 10 Status                                      */
      __IOM uint32_t INTREQSTS11 : 1;           /* [11..11] Interrupt Request 11 Status                                      */
      __IOM uint32_t INTREQSTS12 : 1;           /* [12..12] Interrupt Request 12 Status                                      */
      __IOM uint32_t INTREQSTS13 : 1;           /* [13..13] Interrupt Request 13 Status                                      */
      __IOM uint32_t INTREQSTS14 : 1;           /* [14..14] Interrupt Request 14 Status                                      */
      __IOM uint32_t INTREQSTS15 : 1;           /* [15..15] Interrupt Request 15 Status                                      */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } INTREQ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) Channel Error Status Register                              */

