MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t EFLG0      : 1;            /* [0..0] Error In Channel 0 Flag                                            */
      __IOM uint32_t EFLG1      : 1;            /* [1..1] Error In Channel 1 Flag                                            */
      __IOM uint32_t EFLG2      : 1;            /* [2..2] Error In Channel 2 Flag                                            */
      __IOM uint32_t EFLG3      : 1;            /* [3..3] Error In Channel 3 Flag                                            */
      __IOM uint32_t EFLG4      : 1;            /* [4..4] Error In Channel 4 Flag                                            */
      __IOM uint32_t EFLG5      : 1;            /* [5..5] Error In Channel 5 Flag                                            */
      __IOM uint32_t EFLG6      : 1;            /* [6..6] Error In Channel 6 Flag                                            */
      __IOM uint32_t EFLG7      : 1;            /* [7..7] Error In Channel 7 Flag                                            */
      __IOM uint32_t EFLG8      : 1;            /* [8..8] Error In Channel 8 Flag                                            */
      __IOM uint32_t EFLG9      : 1;            /* [9..9] Error In Channel 9 Flag                                            */
      __IOM uint32_t EFLG10     : 1;            /* [10..10] Error In Channel 10 Flag                                         */
      __IOM uint32_t EFLG11     : 1;            /* [11..11] Error In Channel 11 Flag                                         */
      __IOM uint32_t EFLG12     : 1;            /* [12..12] Error In Channel 12 Flag                                         */
      __IOM uint32_t EFLG13     : 1;            /* [13..13] Error In Channel 13 Flag                                         */
      __IOM uint32_t EFLG14     : 1;            /* [14..14] Error In Channel 14 Flag                                         */
      __IOM uint32_t EFLG15     : 1;            /* [15..15] Error In Channel 15 Flag                                         */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } CHESTS;
  __IM  uint32_t  RESERVED4;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000034) Hardware Request Status Register                           */

    struct {
      __IM  uint32_t HREQSTS0   : 1;            /* [0..0] Hardware Request Channel 0 Status                                  */
      __IM  uint32_t HREQSTS1   : 1;            /* [1..1] Hardware Request Channel 1 Status                                  */
      __IM  uint32_t HREQSTS2   : 1;            /* [2..2] Hardware Request Channel 2 Status                                  */
      __IM  uint32_t HREQSTS3   : 1;            /* [3..3] Hardware Request Channel 3 Status                                  */
      __IM  uint32_t HREQSTS4   : 1;            /* [4..4] Hardware Request Channel 4 Status                                  */
      __IM  uint32_t HREQSTS5   : 1;            /* [5..5] Hardware Request Channel 5 Status                                  */
      __IM  uint32_t HREQSTS6   : 1;            /* [6..6] Hardware Request Channel 6 Status                                  */
      __IM  uint32_t HREQSTS7   : 1;            /* [7..7] Hardware Request Channel 7 Status                                  */
      __IM  uint32_t HREQSTS8   : 1;            /* [8..8] Hardware Request Channel 8 Status                                  */
      __IM  uint32_t HREQSTS9   : 1;            /* [9..9] Hardware Request Channel 9 Status                                  */
      __IM  uint32_t HREQSTS10  : 1;            /* [10..10] Hardware Request Channel 10 Status                               */
      __IM  uint32_t HREQSTS11  : 1;            /* [11..11] Hardware Request Channel 11 Status                               */
      __IM  uint32_t HREQSTS12  : 1;            /* [12..12] Hardware Request Channel 12 Status                               */
      __IM  uint32_t HREQSTS13  : 1;            /* [13..13] Hardware Request Channel 13 Status                               */
      __IM  uint32_t HREQSTS14  : 1;            /* [14..14] Hardware Request Channel 14 Status                               */
      __IM  uint32_t HREQSTS15  : 1;            /* [15..15] Hardware Request Channel 15 Status                               */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } HWREQSTS;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000044) Asynchronous Request in Stop Enable Register               */

    struct {
      __IOM uint32_t AREQSEN0   : 1;            /* [0..0] Asynchronous DMA Request Channel 0 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN1   : 1;            /* [1..1] Asynchronous DMA Request Channel 1 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN2   : 1;            /* [2..2] Asynchronous DMA Request Channel 2 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN3   : 1;            /* [3..3] Asynchronous DMA Request Channel 3 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN4   : 1;            /* [4..4] Asynchronous DMA Request Channel 4 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN5   : 1;            /* [5..5] Asynchronous DMA Request Channel 5 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN6   : 1;            /* [6..6] Asynchronous DMA Request Channel 6 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN7   : 1;            /* [7..7] Asynchronous DMA Request Channel 7 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN8   : 1;            /* [8..8] Asynchronous DMA Request Channel 8 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN9   : 1;            /* [9..9] Asynchronous DMA Request Channel 9 in Stop Mode Enable             */
      __IOM uint32_t AREQSEN10  : 1;            /* [10..10] Asynchronous DMA Request Channel 10 in Stop Mode Enable          */
      __IOM uint32_t AREQSEN11  : 1;            /* [11..11] Asynchronous DMA Request Channel 11 in Stop Mode Enable          */
      __IOM uint32_t AREQSEN12  : 1;            /* [12..12] Asynchronous DMA Request Channel 12 in Stop Mode Enable          */
      __IOM uint32_t AREQSEN13  : 1;            /* [13..13] Asynchronous DMA Request Channel 13 in Stop Mode Enable          */
      __IOM uint32_t AREQSEN14  : 1;            /* [14..14] Asynchronous DMA Request Channel 14 in Stop Mode Enable          */
      __IOM uint32_t AREQSEN15 : 1;            /* [15..15] Asynchronous DMA Request Channel 15 in Stop Mode Enable          */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } AREQSEN;
  __IM  uint32_t  RESERVED6[46];

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000100) Channel 3 Priority Register                                */

