MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint8_t CHPRIA      : 4;            /* [3..0] Channel n Priority Arbitration                                     */
            uint8_t             : 2;
      __IOM uint8_t PLPRICHD    : 1;            /* [6..6] Preemption of Other Lower Priority Channel Disable                 */
      __IOM uint8_t BPHPRICHEN  : 1;            /* [7..7] being Preempted by Other Higher Channel Enable                     */
    } bit;
  } CHPRI[16];
  __IM  uint32_t  RESERVED7[956];

  struct {
    union {
      __IOM uint32_t reg;                         /* (@ 0x00001000) TCD Source Address                                       */

      struct {
        __IOM uint32_t SADDR      : 32;           /* [31..0] Source Data Address                                             */
      } bit;
    } SADDR;

    union {
      __IOM uint16_t reg;                         /* (@ 0x00001004) TCD Signed Source Address Offset                          */

      struct {
        __IOM uint16_t SADDROF    : 16;           /* [15..0] Source Address Signed Offset                                     */
      } bit;
    } SADDROF;

    union {
      __IOM uint16_t reg;                         /* (@ 0x00001006) TCD Transfer Attributes                                   */

      struct {
        __IOM uint16_t DTSIZE     : 3;            /* [2..0] Destination Data Transfer Size                                     */
        __IOM uint16_t DADDRMV    : 5;            /* [7..3] Destination Address Modulo Value                                   */
        __IOM uint16_t STSIZE     : 3;            /* [10..8] Source Data Transfer Size                                         */
        __IOM uint16_t SADDRMV    : 5;            /* [15..11] Source Address Modulo Value                                      */
      } bit;
    } TATT;

    union {
      union {
        __IOM uint32_t reg;                       /* (@ 0x00001008) TCD Minor Byte Transfer Count (Minor Loop Mapping
                                                                      Disabled) Register                                       */

        struct {
          __IOM uint32_t MINBTCNT : 32;           /* [31..0] Minor Byte Number Transfer Count                                  */
        } bit;
      } MINBCNT_MINLMD;

      union {
        __IOM uint32_t reg;                       /* (@ 0x00001008) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                      Enabled and Offset Disabled) Register                    */

        struct {
          __IOM uint32_t MINBTCNT : 30;           /* [29..0] Minor Byte Number Transfer Count                                  */
          __IOM uint32_t DMINLOFEN : 1;           /* [30..30] Destination Address Minor Loop Offset Enable                     */
          __IOM uint32_t SMINLOFEN : 1;           /* [31..31] Source Address Minor Loop Offset Enable                          */
        } bit;
      } SMLOF_MINLMENOFD;

      union {
        __IOM uint32_t reg;                       /* (@ 0x00001008) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                      and Offset Enabled) Register                             */

        struct {
          __IOM uint32_t MINBTCNT : 10;           /* [9..0] Minor Byte Number Transfer Count                                   */
          __IOM uint32_t MINSELOF : 20;           /* [29..10] Minor Loop Sign-extended Offset                                  */
          __IOM uint32_t DMINLOFEN : 1;           /* [30..30] Destination Address Minor Loop Offset Enable                     */
          __IOM uint32_t SMINLOFEN : 1;           /* [31..31] Source Address Minor Loop Offset Enable                          */
        } bit;
      } SMINLOF_MINLMOFEN;
    } MINBTCNT;

    union {
      __IOM uint32_t reg;                         /* (@ 0x0000100C) TCD Last Source Address Adjustment                        */

      struct {
        __IOM uint32_t SADDRAV    : 32;           /* [31..0] Source Address Adjustment Value                                   */
      } bit;
    } SADDRAV;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00001010) TCD Destination Address                                   */

      struct {
        __IOM uint32_t DADDR      : 32;           /* [31..0] Destination Address                                              */
      } bit;
    } DADDR;

    union {
      __IOM uint16_t reg;                         /* (@ 0x00001014) TCD Signed Destination Address Offset                     */

      struct {
        __IOM uint16_t DADDRSOF   : 16;           /* [15..0] Destination Address Signed Offset                                */
      } bit;
    } DADDRSOF;

    union {
      union {
        __IOM uint16_t reg;                       /* (@ 0x00001016) TCD Current Major Iteration Count (Channel Linking
                                                                      Disabled) Register                                       */

        struct {
          __IOM uint16_t CMAJICNT : 15;           /* [14..0] Current Major Iteration Count                                     */
          __IOM uint16_t LINKEN   : 1;            /* [15..15] Channel-to-channel Linking Enable                                */
        } bit;
      } LINKD;

      union {
        __IOM uint16_t reg;                       /* (@ 0x00001016) TCD Current Major Iteration Count (Channel Linking
                                                                      Enabled) Register                                        */

        struct {
          __IOM uint16_t CMAJICNT  : 9;            /* [8..0] Current Major Iteration Count                                      */
          __IOM uint16_t MINLINKCH : 4;            /* [12..9] Minor Loop Link Channel Number                                    */
                uint16_t           : 2;
          __IOM uint16_t LINKEN    : 1;            /* [15..15] Channel-to-channel Linking Enable                                */
        } bit;
      } LINKEN;
    } CMAJICNT;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00001018) TCD Destination Address Adjustment Value or
                                                                      SG next TCD Address Register                             */

