MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 26;
      __IOM uint32_t UINTNENM1  : 1;            /* [26..26] Memory 1 Uncorrectable Interrupt Notification Enable             */
      __IOM uint32_t SCINTNENM1 : 1;            /* [27..27] Memory 1 Single-Bit Correction Interrupt Notification
                                                     Enable                                                                  */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t UINTNENM0  : 1;            /* [30..30] Memory 0 Uncorrectable Interrupt Notification Enable             */
      __IOM uint32_t SCINTNENM0 : 1;            /* [31..31] Memory 0 Single-Bit Correction Interrupt Notification
                                                     Enable                                                                  */
    } bit;
  } CFG0;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Status Register 0                                          */

    struct {
      __IM  uint32_t RESERVED0  : 26;
      __IOM uint32_t UEFLGM1    : 1;            /* [26..26] Memory 1 Uncorrectable Error Event Flag                          */
      __IOM uint32_t SBCFLGM1   : 1;            /* [27..27] Memory 1 Single-Bit Correction Event Flag                        */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t UEFLGM0    : 1;            /* [30..30] Memory 0 Uncorrectable Error Event Flag                          */
      __IOM uint32_t SBCFLGM0   : 1;            /* [31..31] Memory 0 Single-Bit Correction Event Flag                        */
    } bit;
  } STS0;
  __IM  uint32_t  RESERVED1[59];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000100) Error Address Register 0                                   */

    struct {
      __IM  uint32_t EADDR      : 32;           /* [31..0] EADDR                                                             */
    } bit;
  } EADDR0;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000110) Error Address Register 1                                   */

    struct {
      __IM  uint32_t EADDR      : 32;           /* [31..0] EADDR                                                             */
    } bit;
  } EADDR1;
} EREP_T;                                    /* Size = 276 (0x114)                                                        */



/* =========================================================================================================================== */
/* ================                                           EINJ                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Error Injection (EINJ)
  */

typedef struct {                                /* (@ 0x40019000) EINJ Structure                                             */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Configure Register                                         */

    struct {
      __IOM uint32_t GEINJEN    : 1;            /* [0..0] Global Error Injection Function Enable                             */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } CFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Channel Enable Register                                    */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t EINJENCH1  : 1;            /* [30..30] Error Injection CH1 Enable                                       */
      __IOM uint32_t EINJENCH0  : 1;            /* [31..31] Error Injection CH0 Enable                                       */
    } bit;
  } CHEN;
  __IM  uint32_t  RESERVED[62];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) Channel Descriptor 0, Word0 Register                       */

    struct {
      __IM  uint32_t RESERVED0  : 25;
      __IOM uint32_t CBCBINV    : 7;            /* [31..25] Checkbit Bus Corresponding Bit Invert                            */
    } bit;
  } CHD0_WORD0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000104) Channel Descriptor 0, Word1 Register                       */

    struct {
      __IOM uint32_t DBCBINVB0_3 : 32;          /* [31..0] Data Bus 0-3 Bytes Corresponding Bit Invert                       */
    } bit;
  } CHD0_WORD1;
  __IM  uint32_t  RESERVED1[62];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000200) Channel Descriptor 1, Word0 Register                       */

    struct {
      __IM  uint32_t RESERVED0  : 25;
      __IOM uint32_t CBCBINV    : 7;            /* [31..25] Checkbit Bus Corresponding Bit Invert                            */
    } bit;
  } CHD1_WORD0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000204) Channel Descriptor 1, Word1 Register                       */

    struct {
      __IOM uint32_t DBCBINVB0_3 : 32;          /* [31..0] Data Bus 0-3 Bytes Corresponding Bit Invert                       */
    } bit;
  } CHD1_WORD1;
} EINJ_T;                                    /* Size = 520 (0x208)                                                        */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash Memory (FLASH)
  */

typedef struct {                                /* (@ 0x40020000) FLASH Structure                                            */

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000000) Status Register                                            */

