MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint8_t PCMDCODEP8  : 8;            /* [7..0] Provide Command Code and Parameter                                 */
    } bit;
  } CCMDDATA8;

  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000010) Program Flash Protect Register 3                           */

    struct {
      __IOM uint8_t PFPRO0      : 1;            /*!< [0..0] Program Flash Protect Area 0                                       */
      __IOM uint8_t PFPRO1      : 1;            /*!< [1..1] Program Flash Protect Area 1                                       */
      __IOM uint8_t PFPRO2      : 1;            /*!< [2..2] Program Flash Protect Area 2                                       */
      __IOM uint8_t PFPRO3      : 1;            /*!< [3..3] Program Flash Protect Area 3                                       */
      __IOM uint8_t PFPRO4      : 1;            /*!< [4..4] Program Flash Protect Area 4                                       */
      __IOM uint8_t PFPRO5      : 1;            /*!< [5..5] Program Flash Protect Area 5                                       */
      __IOM uint8_t PFPRO6      : 1;            /*!< [6..6] Program Flash Protect Area 6                                       */
      __IOM uint8_t PFPRO7      : 1;            /*!< [7..7] Program Flash Protect Area 7                                       */
    } bit;
  } PFPRO3;

  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000011) Program Flash Protect Register 2                           */

    struct {
      __IOM uint8_t PFPRO8      : 1;            /*!< [0..0] Program Flash Protect Area 8                                       */
      __IOM uint8_t PFPRO9      : 1;            /*!< [1..1] Program Flash Protect Area 9                                       */
      __IOM uint8_t PFPRO10     : 1;            /*!< [2..2] Program Flash Protect Area 10                                      */
      __IOM uint8_t PFPRO11     : 1;            /*!< [3..3] Program Flash Protect Area 11                                      */
      __IOM uint8_t PFPRO12     : 1;            /*!< [4..4] Program Flash Protect Area 12                                      */
      __IOM uint8_t PFPRO13     : 1;            /*!< [5..5] Program Flash Protect Area 13                                      */
      __IOM uint8_t PFPRO14     : 1;            /*!< [6..6] Program Flash Protect Area 14                                      */
      __IOM uint8_t PFPRO15     : 1;            /*!< [7..7] Program Flash Protect Area 15                                      */
    } bit;
  } PFPRO2;

  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000012) Program Flash Protect Register 1                           */

    struct {
      __IOM uint8_t PFPRO16     : 1;            /*!< [0..0] Program Flash Protect Area 16                                      */
      __IOM uint8_t PFPRO17     : 1;            /*!< [1..1] Program Flash Protect Area 17                                      */
      __IOM uint8_t PFPRO18     : 1;            /*!< [2..2] Program Flash Protect Area 18                                      */
      __IOM uint8_t PFPRO19     : 1;            /*!< [3..3] Program Flash Protect Area 19                                      */
      __IOM uint8_t PFPRO20     : 1;            /*!< [4..4] Program Flash Protect Area 20                                      */
      __IOM uint8_t PFPRO21     : 1;            /*!< [5..5] Program Flash Protect Area 21                                      */
      __IOM uint8_t PFPRO22     : 1;            /*!< [6..6] Program Flash Protect Area 22                                      */
      __IOM uint8_t PFPRO23     : 1;            /*!< [7..7] Program Flash Protect Area 23                                      */
    } bit;
  } PFPRO1;

  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000013) Program Flash Protect Register 0                           */

    struct {
      __IOM uint8_t PFPRO24     : 1;            /*!< [0..0] Program Flash Protect Area 24                                      */
      __IOM uint8_t PFPRO25     : 1;            /*!< [1..1] Program Flash Protect Area 25                                      */
      __IOM uint8_t PFPRO26     : 1;            /*!< [2..2] Program Flash Protect Area 26                                      */
      __IOM uint8_t PFPRO27     : 1;            /*!< [3..3] Program Flash Protect Area 27                                      */
      __IOM uint8_t PFPRO28     : 1;            /*!< [4..4] Program Flash Protect Area 28                                      */
      __IOM uint8_t PFPRO29     : 1;            /*!< [5..5] Program Flash Protect Area 29                                      */
      __IOM uint8_t PFPRO30     : 1;            /*!< [6..6] Program Flash Protect Area 30                                      */
      __IOM uint8_t PFPRO31     : 1;            /*!< [7..7] Program Flash Protect Area 31                                      */
    } bit;
  } PFPRO0;
  __IM  uint8_t   RESERVED[2];

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000016) EEPROM Protect Register                                    */

    struct {
      __IOM uint8_t EEPRO        : 8;            /* [7..0] EEPROM Protect                                                     */
    } bit;
  } EEPRO;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000017) Data Flash Protect Register                                */

    struct {
      __IOM uint8_t DFPRO   : 8;            /* [7..0] Data Flash Protect                                                 */
    } bit;
  } DFPRO;
  __IM  uint8_t   RESERVED1[20];

  union {
    __IM  uint8_t reg;                          /* (@ 0x0000002C) CSE Status Register                                        */

    struct {
      __IM  uint8_t BUSY        : 1;            /* [0..0] Busy                                                               */
      __IM  uint8_t SBACTSTS    : 1;            /* [1..1] Secure Boot Activated Status                                       */
      __IM  uint8_t SBINITFLG   : 1;            /* [2..2] Secure Boot Initialization Completed flag                          */
      __IM  uint8_t SBCMPFLG    : 1;            /* [3..3] Secure Boot Complete Flag                                          */
      __IM  uint8_t SBSUCFLG    : 1;            /* [4..4] Secure Boot Successful Flag                                        */
      __IM  uint8_t RNGINITFLG  : 1;            /* [5..5] Random Number Generator Initialized Flag                           */
      __IM  uint8_t EXTDBGAFLG  : 1;            /* [6..6] External Debug Attached Flag                                       */
      __IM  uint8_t IDBGENFLG   : 1;            /* [7..7] Internal Debug Enable Flag                                         */
    } bit;
  } CSECSTS;
  __IM  uint8_t   RESERVED2;

  union {
    __IOM uint8_t reg;                          /* (@ 0x0000002E) Error Status Register                                      */

