MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t MB0IEN     : 1;            /* [0..0] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB1IEN     : 1;            /* [1..1] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB2IEN     : 1;            /* [2..2] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB3IEN     : 1;            /* [3..3] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB4IEN     : 1;            /* [4..4] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB5IEN     : 1;            /* [5..5] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB6IEN     : 1;            /* [6..6] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB7IEN     : 1;            /* [7..7] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB8IEN     : 1;            /* [8..8] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB9IEN     : 1;            /* [9..9] Buffer MB 0-31 Mask                                                */
      __IOM uint32_t MB10IEN    : 1;            /* [10..10] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB11IEN    : 1;            /* [11..11] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB12IEN    : 1;            /* [12..12] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB13IEN    : 1;            /* [13..13] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB14IEN    : 1;            /* [14..14] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB15IEN    : 1;            /* [15..15] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB16IEN    : 1;            /* [16..16] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB17IEN    : 1;            /* [17..17] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB18IEN    : 1;            /* [18..18] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB19IEN    : 1;            /* [19..19] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB20IEN    : 1;            /* [20..20] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB21IEN    : 1;            /* [21..21] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB22IEN    : 1;            /* [22..22] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB23IEN    : 1;            /* [23..23] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB24IEN    : 1;            /* [24..24] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB25IEN    : 1;            /* [25..25] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB26IEN    : 1;            /* [26..26] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB27IEN    : 1;            /* [27..27] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB28IEN    : 1;            /* [28..28] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB29IEN    : 1;            /* [29..29] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB30IEN    : 1;            /* [30..30] Buffer MB 0-31 Mask                                              */
      __IOM uint32_t MB31IEN    : 1;            /* [31..31] Buffer MB 0-31 Mask                                              */
    } bit;
  } MBiIEN;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000030) Interrupt Flag register                                    */

    struct {
      __IOM uint32_t MB0INT     : 1;            /* [0..0] Buffer MB0 Interrupt or Clear FIFO Bit Flag                        */
      __IOM uint32_t MB1INT     : 1;            /* [1..1] Buffer MB1-4 Interrupt or Reserved Flag                            */
      __IOM uint32_t MB2INT     : 1;            /* [2..2] Buffer MB1-4 Interrupt or Reserved Flag                            */
      __IOM uint32_t MB3INT     : 1;            /* [3..3] Buffer MB1-4 Interrupt or Reserved Flag                            */
      __IOM uint32_t MB4INT     : 1;            /* [4..4] Buffer MB1-4 Interrupt or Reserved Flag                            */
      __IOM uint32_t MB5INT     : 1;            /* [5..5] Buffer MB5 Interrupt or Frames Available in Rx FIFO Flag           */
      __IOM uint32_t MB6INT     : 1;            /* [6..6] Buffer MB6 Interrupt or Rx FIFO Warning Flag                       */
      __IOM uint32_t MB7INT     : 1;            /* [7..7] Buffer MB7 Interrupt or Rx FIFO Overflow Flag                      */
      __IOM uint32_t MB8INT     : 1;            /* [8..8] MB8-31 Buffer Completed Transmission or Reception Flag             */
      __IOM uint32_t MB9INT     : 1;            /* [9..9] MB8-31 Buffer Completed Transmission or Reception Flag             */
      __IOM uint32_t MB10INT    : 1;            /* [10..10] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB11INT    : 1;            /* [11..11] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB12INT    : 1;            /* [12..12] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB13INT    : 1;            /* [13..13] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB14INT    : 1;            /* [14..14] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB15INT    : 1;            /* [15..15] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB16INT    : 1;            /* [16..16] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB17INT    : 1;            /* [17..17] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB18INT    : 1;            /* [18..18] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB19INT    : 1;            /* [19..19] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB20INT    : 1;            /* [20..20] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB21INT    : 1;            /* [21..21] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB22INT    : 1;            /* [22..22] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB23INT    : 1;            /* [23..23] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB24INT    : 1;            /* [24..24] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB25INT    : 1;            /* [25..25] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB26INT    : 1;            /* [26..26] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB27INT    : 1;            /* [27..27] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB28INT    : 1;            /* [28..28] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB29INT    : 1;            /* [29..29] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB30INT    : 1;            /* [30..30] MB8-31 Buffer Completed Transmission or Reception Flag           */
      __IOM uint32_t MB31INT    : 1;            /* [31..31] MB8-31 Buffer Completed Transmission or Reception Flag           */
    } bit;
  } IFLG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000034) Control register 2                                         */

