MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 11;
      __IOM uint32_t EFD        : 1;            /* [11..11] Edge Filter Disable                                              */
      __IOM uint32_t ISOFDEN    : 1;            /* [12..12] ISO CAN FD Protocol Enable                                       */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t PEEN       : 1;            /* [14..14] Protocol Exception Enable                                        */
      __IOM uint32_t TMRSRC     : 1;            /* [15..15] Time Source for the Free Running Timer                           */
      __IOM uint32_t CMPEN      : 1;            /* [16..16] IDE and RTR Bit Comparison Enable For Receive Mailboxes          */
      __IOM uint32_t RFS        : 1;            /* [17..17] Remote Request Frame Storing                                     */
      __IOM uint32_t MBPRI      : 1;            /* [18..18] Mailboxes Reception Priority Configure                           */
      __IOM uint32_t TXASD      : 5;            /* [23..19] Transmit Arbitration Start Delay                                 */
      __IOM uint32_t NUMFIFO    : 4;            /* [27..24] Number of Receive FIFO Filters                                   */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t BOCIEN     : 1;            /* [30..30] Bus Off Process Complete Interrupt Enable                        */
      __IOM uint32_t FDERRIEN   : 1;            /* [31..31] Error Interrupt Detected in Fast CAN FD Frame Data
                                                     Phase Enable                                                            */
    } bit;
  } CTRL2;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000038) Error Flag register 2                                      */

    struct {
      __IM  uint32_t RESERVED0  : 13;
      __IM  uint32_t IAMBFLG    : 1;            /* [13..13] Inactive Mailbox Flag                                            */
      __IM  uint32_t CVFLG      : 1;            /* [14..14] Contents Valid Flag                                              */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t LTXMB      : 7;            /* [22..16] Lowest Priority Transmission Mailbox Flag                        */
      __IM  uint32_t RESERVED2  : 9;
    } bit;
  } ERRFLG2;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000044) CRC register                                               */

    struct {
      __IM  uint32_t CRCV       : 15;           /* [14..0] Transmitted CRC Value                                             */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t CRCMB      : 7;            /* [22..16] Number of CRC Mailbox                                            */
      __IM  uint32_t RESERVED1  : 9;
    } bit;
  } CRC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000048) Rx FIFO Global Mask register                               */

    struct {
      __IOM uint32_t FIFOGMASK  : 32;           /* [31..0] Rx FIFO Global Mask                                               */
    } bit;
  } FIFOGMASK;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000004C) Rx FIFO Information register                               */

    struct {
      __IM  uint32_t IAF        : 9;            /* [8..0] ID Acceptance Filter Hit Indicator                                 */
      __IM  uint32_t RESERVED0  : 23;
    } bit;
  } FIFOINFO;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000050) Bit Timing register                                        */

    struct {
      __IOM uint32_t EPBS2      : 5;            /* [4..0] Extended Phase Buffer Segment 2                                    */
      __IOM uint32_t EPBS1      : 5;            /* [9..5] Extended Phase Buffer Segment 1                                    */
      __IOM uint32_t EPTS       : 6;            /* [15..10] Extended Propagation Time Segment                                */
      __IOM uint32_t ESJW       : 5;            /* [20..16] Extended Resynchronized Jump Width                               */
      __IOM uint32_t EPDF       : 10;           /* [30..21] Extended Prescaler Division Factor                               */
      __IOM uint32_t EBTEN      : 1;            /* [31..31] Extended Bit Time Enable                                         */
    } bit;
  } BTIM;
  __IM  uint32_t  RESERVED4[11];

  union {
    __IOM uint32_t reg;                    /* (@ 0x00000080) Embedded RAM                                                    */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /* [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /* [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /* [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /* [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } bit;
  } RAMn[128];
  __IM  uint32_t  RESERVED5[384];

  union {
    __IOM uint32_t reg;                     /* (@ 0x00000880) Rx Individual Mask registers                                   */

    struct {
      __IOM uint32_t IBMASK     : 32;           /* [31..0] Individual Bits Mask                                              */
    } bit;
  } RXIMASK[32];
  __IM  uint32_t  RESERVED6[128];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B00) Pretended Networking Control register 1                    */

    struct {
      __IOM uint32_t FCSEL      : 2;            /* [1..0] Filtering Criteria Select                                          */
      __IOM uint32_t IDFLSEL    : 2;            /* [3..2] ID Filtering Level Select                                          */
      __IOM uint32_t PFLSEL     : 2;            /* [5..4] Payload Filtering Level Select                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t NUMMSG     : 8;            /* [15..8] Number of Messages Matching the Same Filtering Criteria           */
      __IOM uint32_t WUMEN      : 1;            /* [16..16] Wakeup by Match Event Enable                                     */
      __IOM uint32_t WUTEN      : 1;            /* [17..17] Wakeup by Timeout Event Enable                                   */
      __IM  uint32_t RESERVED1  : 14;
    } bit;
  } PNCTRL1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B04) Pretended Networking Contro register 2                     */

