MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t TOV        : 16;           /* [15..0] Timeout Value for No Message Matching the Filtering
                                                     Criteria                                                                */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } PNCTRL2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B08) Pretended Networking Wake Up Match register                */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IM  uint32_t NUMM       : 8;            /* [15..8] Number of Matches when in Pretended Networking                    */
      __IOM uint32_t WUMFLG     : 1;            /* [16..16] Wakeup by Match Event Flag                                       */
      __IOM uint32_t WUTFLG     : 1;            /* [17..17] Wakeup by Timeout Event Flag                                     */
      __IM  uint32_t RESERVED1  : 14;
    } bit;
  } PNWM;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B0C) Pretended Networking ID Filter 1 register                  */

    struct {
      __IOM uint32_t IDF        : 29;           /* [28..0] ID Filter 1 for Pretended Networking                              */
      __IOM uint32_t RFF        : 1;            /* [29..29] Remote Frame Filter                                              */
      __IOM uint32_t EXFF       : 1;            /* [30..30] Extended Frame Format Filter                                     */
      __IM  uint32_t RESERVED0  : 1;
    } bit;
  } PNIDF1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B10) Pretended Networking Length Code Filter register          */

    struct {
      __IOM uint32_t DLCHI      : 4;            /* [3..0] Payload Data Length Code Higher Limit                             */
      __IM  uint32_t RESERVED0  : 12;
      __IOM uint32_t DLCLO      : 4;            /* [19..16] Payload Data Length Code Lower Limit                            */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } PNDLCF;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B14) Pretended Networking Payload Low Filter 1 register         */

    struct {
      __IOM uint32_t BYTE3      : 8;            /* [7..0] Byte3                                                              */
      __IOM uint32_t BYTE2      : 8;            /* [15..8] Byte2                                                             */
      __IOM uint32_t BYTE1      : 8;            /* [23..16] Byte1                                                            */
      __IOM uint32_t BYTE0      : 8;            /* [31..24] Byte0                                                            */
    } bit;
  } PNPLF1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B18) Pretended Networking Payload High Filter 1 register        */

    struct {
      __IOM uint32_t BYTE7      : 8;            /* [7..0] Byte7                                                              */
      __IOM uint32_t BYTE6      : 8;            /* [15..8] Byte6                                                             */
      __IOM uint32_t BYTE5      : 8;            /* [23..16] Byte5                                                            */
      __IOM uint32_t BYTE4      : 8;            /* [31..24] Byte4                                                            */
    } bit;
  } PNPHF1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B1C) Pretended Networking ID Filter 2 Register                  */

    struct {
      __IOM uint32_t IDMASK     : 29;           /* [28..0] ID Mask Bits for Pretended Networking ID Filtering                */
      __IOM uint32_t RFMASK     : 1;            /* [29..29] Remote Frame Filter Mask                                         */
      __IOM uint32_t EXFMASK    : 1;            /* [30..30] Extended Frame Format Filter Mask                                */
      __IM  uint32_t RESERVED0  : 1;
    } bit;
  } PNIDF2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B20) Pretended Networking Payload Low Filter 2 Register         */

    struct {
      __IOM uint32_t BYTE3      : 8;            /* [7..0] Byte3                                                              */
      __IOM uint32_t BYTE2      : 8;            /* [15..8] Byte2                                                             */
      __IOM uint32_t BYTE1      : 8;            /* [23..16] Byte1                                                            */
      __IOM uint32_t BYTE0      : 8;            /* [31..24] Byte0                                                            */
    } bit;
  } PNPLF2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000B24) Pretended Networking Payload High Filter 2 register        */

    struct {
      __IOM uint32_t BYTE7      : 8;            /* [7..0] Byte7                                                              */
      __IOM uint32_t BYTE6      : 8;            /* [15..8] Byte6                                                             */
      __IOM uint32_t BYTE5      : 8;            /* [23..16] Byte5                                                            */
      __IOM uint32_t BYTE4      : 8;            /* [31..24] Byte4                                                            */
    } bit;
  } PNPHF2;
  __IM  uint32_t  RESERVED7[6];

  struct {
    union {
      __IM  uint32_t reg;                         /* (@ 0x00000B40) Wake Up Message Buffer register a for C/S                */


        struct {
          __IM  uint32_t RESERVED0  : 16;
          __IM  uint32_t DLC        : 4;            /* [19..16] Data Length Code                                             */
          __IM  uint32_t RTR        : 1;            /* [20..20] Remote Transmission Request Bit                              */
          __IM  uint32_t IDE        : 1;            /* [21..21] Identifier Extension Bit                                     */
          __IM  uint32_t SRR        : 1;            /* [22..22] Substitute Remote Request                                    */
          __IM  uint32_t RESERVED1  : 9;
        } bit;
      } WMBn_CS;

      union {
        __IM  uint32_t reg;                         /* (@ 0x00000B44) Wake Up Message Buffer Register a for ID               */

