MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t CHOISEL0   : 1;            /* [0..0] Channel 0 Output Initialization Value                            */
      __IOM uint32_t CHOISEL1   : 1;            /* [1..1] Channel 1 Output Initialization Value                            */
      __IOM uint32_t CHOISEL2   : 1;            /* [2..2] Channel 2 Output Initialization Value                            */
      __IOM uint32_t CHOISEL3   : 1;            /* [3..3] Channel 3 Output Initialization Value                            */
      __IOM uint32_t CHOISEL4   : 1;            /* [4..4] Channel 4 Output Initialization Value                            */
      __IOM uint32_t CHOISEL5   : 1;            /* [5..5] Channel 5 Output Initialization Value                            */
      __IOM uint32_t CHOISEL6   : 1;            /* [6..6] Channel 6 Output Initialization Value                            */
      __IOM uint32_t CHOISEL7   : 1;            /* [7..7] Channel 7 Output Initialization Value                            */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } CHOI;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000060) Output Mask Register                                     */

    struct {
      __IOM uint32_t CHOMASK0   : 1;            /* [0..0] Channel 0 Output Mask                                            */
      __IOM uint32_t CHOMASK1   : 1;            /* [1..1] Channel 1 Output Mask                                            */
      __IOM uint32_t CHOMASK2   : 1;            /* [2..2] Channel 2 Output Mask                                            */
      __IOM uint32_t CHOMASK3   : 1;            /* [3..3] Channel 3 Output Mask                                            */
      __IOM uint32_t CHOMASK4   : 1;            /* [4..4] Channel 4 Output Mask                                            */
      __IOM uint32_t CHOMASK5   : 1;            /* [5..5] Channel 5 Output Mask                                            */
      __IOM uint32_t CHOMASK6   : 1;            /* [6..6] Channel 6 Output Mask                                            */
      __IOM uint32_t CHOMASK7   : 1;            /* [7..7] Channel 7 Output Mask                                            */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } OMASK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000064) Function For Linked Channels Register                      */

    struct {
      __IOM uint32_t CHCM0      : 1;            /* [0..0] Channels Combine Mode For n=0                                      */
      __IOM uint32_t CCHO0      : 1;            /* [1..1] Complement Channel (n) Output for n=0                              */
      __IOM uint32_t DECMEN0    : 1;            /* [2..2] Dual Edge Capture Mode Enable For n=0                              */
      __IOM uint32_t DECSTS0    : 1;            /* [3..3] Dual Edge Capture Status For n=0                                   */
      __IOM uint32_t DTIEN0     : 1;            /* [4..4] Deadtime Insertion Enable For n=0                                  */
      __IOM uint32_t PWMSYNEN0  : 1;            /* [5..5] PWM Synchronization Enable For n=0                                 */
      __IOM uint32_t FCTRLEN0   : 1;            /* [6..6] Fault Control Enable For n=0                                       */
      __IOM uint32_t MCM0       : 1;            /* [7..7] Modified Combine Mode For n=0                                      */
      __IOM uint32_t CHCM1      : 1;            /* [8..8] Channels Combine Mode For n=2                                      */
      __IOM uint32_t CCHO1      : 1;            /* [9..9] Dual Edge Capture Mode Enable For n=2                              */
      __IOM uint32_t DECMEN1    : 1;            /* [10..10] Dual Edge Capture Status For n=2                                 */
      __IOM uint32_t DECSTS1    : 1;            /* [11..11] Dual Edge Capture Status For n=2                                 */
      __IOM uint32_t DTIEN1     : 1;            /* [12..12] Deadtime Insertion Enable For n=2                                */
      __IOM uint32_t PWMSYNEN1  : 1;            /* [13..13] PWM Synchronization Enable For n=2                               */
      __IOM uint32_t FCTRLEN1   : 1;            /* [14..14] Fault Control Enable For n=2                                     */
      __IOM uint32_t MCM1       : 1;            /* [15..15] Modified Combine Mode For n=2                                    */
      __IOM uint32_t CHCM2      : 1;            /* [16..16] Channels Combine Mode For n=4                                    */
      __IOM uint32_t CCHO2      : 1;            /* [17..17] Complement Channel (n) Output for n=4                            */
      __IOM uint32_t DECMEN2    : 1;            /* [18..18] Dual Edge Capture Mode Enable For n=4                            */
      __IOM uint32_t DECSTS2    : 1;            /* [19..19] Dual Edge Capture Status For n=4                                 */
      __IOM uint32_t DTIEN2     : 1;            /* [20..20] Deadtime Insertion Enable For n=4                                */
      __IOM uint32_t PWMSYNEN2  : 1;            /* [21..21] PWM Synchronization Enable For n=4                               */
      __IOM uint32_t FCTRLEN2   : 1;            /* [22..22] Fault Control Enable For n=4                                     */
      __IOM uint32_t MCM2       : 1;            /* [23..23] Modified Combine Mode For n=4                                    */
      __IOM uint32_t CHCM3      : 1;            /* [24..24] Channels Combine Mode For n=6                                    */
      __IOM uint32_t CCHO3      : 1;            /* [25..25] Complement Channel (n) Output for n=6                            */
      __IOM uint32_t DECMEN3    : 1;            /* [26..26] Dual Edge Capture Mode Enable For n=6                            */
      __IOM uint32_t DECSTS3    : 1;            /* [27..27] Dual Edge Capture Status For n=6                                 */
      __IOM uint32_t DTIEN3     : 1;            /* [28..28] Deadtime Insertion Enable For n=6                                */
      __IOM uint32_t PWMSYNEN3  : 1;            /* [29..29] PWM Synchronization Enable For n=6                               */
      __IOM uint32_t FCTRLEN3   : 1;            /* [30..30] Fault Control Enable For n=6                                     */
      __IOM uint32_t MCM3       : 1;            /* [31..31] Modified Combine Mode For n=6                                    */
    } bit;
  } FLCH;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000068) Deadtime Configure Register                                */

