MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t CHSWOCTRLEN0 : 1;          /* [0..0] Channel 0 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN1 : 1;          /* [1..1] Channel 1 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN2 : 1;          /* [2..2] Channel 2 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN3 : 1;          /* [3..3] Channel 3 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN4 : 1;          /* [4..4] Channel 4 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN5 : 1;          /* [5..5] Channel 5 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN6 : 1;          /* [6..6] Channel 6 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLEN7 : 1;          /* [7..7] Channel 7 Software Output Control Enable                         */
      __IOM uint32_t CHSWOCTRLVSEL0 : 1;        /* [8..8] Channel 0 Software Output Control Value                          */
      __IOM uint32_t CHSWOCTRLVSEL1 : 1;        /* [9..9] Channel 1 Software Output Control Value                          */
      __IOM uint32_t CHSWOCTRLVSEL2 : 1;        /* [10..10] Channel 2 Software Output Control Value                        */
      __IOM uint32_t CHSWOCTRLVSEL3 : 1;        /* [11..11] Channel 3 Software Output Control Value                        */
      __IOM uint32_t CHSWOCTRLVSEL4 : 1;        /* [12..12] Channel 4 Software Output Control Value                        */
      __IOM uint32_t CHSWOCTRLVSEL5 : 1;        /* [13..13] Channel 5 Software Output Control Value                        */
      __IOM uint32_t CHSWOCTRLVSEL6 : 1;        /* [14..14] Channel 6 Software Output Control Value                        */
      __IOM uint32_t CHSWOCTRLVSEL7 : 1;        /* [15..15] Channel 7 Software Output Control Value                        */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } SWOCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000098) PWM Load Register                                        */

    struct {
      __IOM uint32_t CHMSEL0    : 1;            /* [0..0] Channel 0 Match Select                                           */
      __IOM uint32_t CHMSEL1    : 1;            /* [1..1] Channel 1 Match Select                                           */
      __IOM uint32_t CHMSEL2    : 1;            /* [2..2] Channel 2 Match Select                                           */
      __IOM uint32_t CHMSEL3    : 1;            /* [3..3] Channel 3 Match Select                                           */
      __IOM uint32_t CHMSEL4    : 1;            /* [4..4] Channel 4 Match Select                                           */
      __IOM uint32_t CHMSEL5    : 1;            /* [5..5] Channel 5 Match Select                                           */
      __IOM uint32_t CHMSEL6    : 1;            /* [6..6] Channel 6 Match Select                                           */
      __IOM uint32_t CHMSEL7    : 1;            /* [7..7] Channel 7 Match Select                                           */
      __IOM uint32_t HCREN      : 1;            /* [8..8] Half Cycle Reload Enable                                         */
      __IOM uint32_t LUVEN      : 1;            /* [9..9] Load Updated Values Enable                                       */
      __IOM uint32_t GLOKEN     : 1;            /* [10..10] Global Load OK Enable                                          */
      __OM  uint32_t GLOP       : 1;            /* [11..11] Global Load OK Present                                         */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } PWMLD;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000009C) Half Cycle Register                                      */

    struct {
      __IOM uint32_t HCV        : 16;           /* [15..0] Half Cycle Value                                                */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } HC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A0) Pair x Deadtime Configure Register                       */

    struct {
      __IOM uint32_t DVSEL      : 6;            /* [5..0] Deadtime Value Select                                            */
      __IOM uint32_t PSCCFG     : 2;            /* [7..6] Deadtime Prescaler Factor Configure                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t EDTV       : 4;            /* [19..16] Extended Deadtime Value                                        */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } P0DCFG;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A8) Pair x Deadtime Configure Register                       */

    struct {
      __IOM uint32_t DVSEL      : 6;            /* [5..0] Deadtime Value Select                                            */
      __IOM uint32_t PSCCFG     : 2;            /* [7..6] Deadtime Prescaler Factor Configure                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t EDTV       : 4;            /* [19..16] Extended Deadtime Value                                        */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } P1DCFG;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B0) Pair x Deadtime Configure Register                       */

    struct {
      __IOM uint32_t DVSEL      : 6;            /* [5..0] Deadtime Value Select                                            */
      __IOM uint32_t PSCCFG     : 2;            /* [7..6] Deadtime Prescaler Factor Configure                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t EDTV       : 4;            /* [19..16] Extended Deadtime Value                                        */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } P2DCFG;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B8) Pair x Deadtime Configure Register                       */

