MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t HAVGCFG    : 2;            /* [1..0] Hardware Averaged Samples Configure                                */
      __IOM uint32_t HAVGEN     : 1;            /* [2..2] Hardware Average Function Enable                                   */
      __IOM uint32_t CONTCEN    : 1;            /* [3..3] Continuous Conversion Mode Enable                                  */
      __IM  uint32_t RESERVED0  : 3;
      __IOM uint32_t CAL        : 1;            /* [7..7] Calibration                                                        */
      __IM  uint32_t RESERVED1  : 24;
    } bit;
  } CSTS3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000098) Base Offset Error Correction Register                      */

    struct {
      __IOM uint32_t BOECVAL    : 8;            /* [7..0] Base Offset Error Correction Value                                 */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } BOEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000009C) Offset Error Correction Register                           */

    struct {
      __IOM uint32_t OECVAL     : 16;           /* [15..0] Offset Error Correction Value                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } OEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A0) User defined Offset Error Correction Value Register        */

    struct {
      __IOM uint32_t UOECVAL    : 8;            /* [7..0] User Defined Offset Error Correction Value                         */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } UOEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A4) X Offset Error Correction Register                         */

    struct {
      __IOM uint32_t XOECVAL    : 6;            /* [5..0] X Offset Error Correction Value                                    */
      __IM  uint32_t RESERVED0  : 26;
    } bit;
  } XOEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A8) Y Offset Error Correction Register                         */

    struct {
      __IOM uint32_t YOECVAL    : 8;            /* [7..0] Y Offset Error Correction Value                                    */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } YOEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000AC) ADC Gain Error Adjustment Factor Register                  */

    struct {
      __IOM uint32_t GEAF       : 11;           /* [10..0] Gain Error Adjustment Factor                                      */
      __IM  uint32_t RESERVED0  : 21;
    } bit;
  } GEAF;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B0) User defined Gain Error Correction Register                */

    struct {
      __IOM uint32_t UGECVAL    : 10;           /* [9..0] User defined Gain Error Correction Value                           */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } UGEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B4) General Calibration Register S                             */

    struct {
      __IOM uint32_t CALVAL     : 7;            /* [6..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 25;
    } bit;
  } GCALS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000B8) Plus-Side General Calibration Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t CALVAL     : 10;           /* [9..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } PSGCAL3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000BC) Plus-Side General Calibration Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t CALVAL     : 10;           /* [9..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } PSGCAL2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C0) Plus-Side General Calibration Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t CALVAL     : 10;           /* [9..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } PSGCAL1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C4) Plus-Side General Calibration Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t CALVAL     : 10;           /* [9..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 22;
    } bit;
  } PSGCAL0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C8) Plus-Side General Calibration Value Register
                                                                    X                                                          */

    struct {
      __IOM uint32_t CALVAL     : 7;            /* [6..0] Calibration Value                                                  */
      __IM  uint32_t RESERVED0  : 25;
    } bit;
  } PSGCALX;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000CC) Plus-Side General Calibration Value Register
                                                                    9                                                          */

    struct {
      __IOM uint32_t CALVAL     : 7;            /* [6..0] CAL9                                                               */
      __IM  uint32_t RESERVED0  : 25;
    } bit;
  } PSGCAL9;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000D0) General Calibration Offset Value Register S                */

