MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } GCALOS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000D4) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000D8) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000DC) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E0) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 4;            /* [3..0] Capacitor Offset Correction Value                                  */
      __IM  uint32_t RESERVED0  : 28;
    } bit;
  } PSGCALOV0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E4) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 12;           /* [11..0] Capacitor Offset Correction Value                                 */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } PSGCALOVX;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000E8) Plus-Side General Calibration Offset Value Register
                                                                    x                                                          */

    struct {
      __IOM uint32_t COCVAL     : 12;           /* [11..0] Capacitor Offset Correction Value                                 */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } PSGCALOV9;

  __IM  uint32_t  RESERVED0[7];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000108) Control and Status Register 1x                             */

    struct {
      __IOM uint32_t ICHSEL     : 6;            /* [5..0] Input Channel Select                                               */
      __IOM uint32_t CCIEN      : 1;            /* [6..6] Conversion Complete Interrupt Enable                               */
      __IM  uint32_t CCFLG      : 1;            /* [7..7] Input Clock Source Select                                          */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } ACSTS1[ADC_ACSTS1_COUNT];
  __IM  uint32_t  RESERVED1[8];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000188) Plus-Side General Calibration Offset Value Register x      */

    struct {
      __IOM uint32_t DATA       : 12;           /* [11..0] Data result                                 */
      __IM  uint32_t RESERVED0  : 20;
    } bit;
  } ADATA[ADC_ADATA_COUNT];

} ADC_T;                                    /*                                                          */


/* =========================================================================================================================== */
/* ================                                          LPSPI                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPSPI Memory Map/Register Definition can be found here. (LPSPI)
  */

typedef struct {                                /*  LPSPI Structure
                                                   (@ 0x4002C000)LPSPI0 (@ 0x4002D000)LPSPI1 (@ 0x4002E000)LPSPI2            */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFSSET    : 8;            /* [7..0] Transmit FIFO Size Set                                             */
      __IM  uint32_t RXFSSET    : 8;            /* [15..8] Receive FIFO Size Set                                             */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } PARA;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Control Register                                           */

    struct {
      __IOM uint32_t MEN        : 1;            /* [0..0] Module Enable                                                      */
      __IOM uint32_t SWRST      : 1;            /* [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEDIS    : 1;            /* [2..2] Disable LPSPI in Doze Mode                                         */
      __IOM uint32_t DBGEN      : 1;            /* [3..3] Enable LPSPI in Debug Mode                                         */
      __IM  uint32_t RESERVED0  : 4;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } CTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Status Register                                            */

