MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t TXDATAFLG  : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXDATAFLG  : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t RXWCFLG    : 1;            /* [8..8] Received Word Complete Flag                                        */
      __IOM uint32_t FTXCFLG    : 1;            /* [9..9] Frame Complete Flag                                                */
      __IOM uint32_t TXCFLG     : 1;            /* [10..10] Transfer Complete Flag                                           */
      __IOM uint32_t TXEFLG     : 1;            /* [11..11] Transmit Error Flag                                              */
      __IOM uint32_t RXEFLG     : 1;            /* [12..12] Receive Error Flag                                               */
      __IOM uint32_t RXMFLG     : 1;            /* [13..13] Receive Data Match Flag                                          */
      __IM  uint32_t RESERVED1  : 10;
      __IM  uint32_t BSYFLG     : 1;            /* [24..24] LPSPI Busy Flag                                                  */
      __IM  uint32_t RESERVED2  : 7;
    } bit;
  } STS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Interrupt Enable Register                                  */

    struct {
      __IOM uint32_t TXIEN      : 1;            /* [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RXIEN      : 1;            /* [1..1] Receive Data Interrupt Enable                                      */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t RXWCIEN    : 1;            /* [8..8] Receive Word Complete Interrupt Enable                             */
      __IOM uint32_t FTCIEN     : 1;            /* [9..9] Frame Transfer Complete Interrupt Enable                           */
      __IOM uint32_t TXCIEN     : 1;            /* [10..10] Transfer Complete Interrupt Enable                               */
      __IOM uint32_t TXEIEN     : 1;            /* [11..11] Transmit Error Interrupt Enable                                  */
      __IOM uint32_t RXEIEN     : 1;            /* [12..12] Receive Error Interrupt Enable                                   */
      __IOM uint32_t RXMIEN     : 1;            /* [13..13] Receive Data Match Interrupt Enable                              */
      __IM  uint32_t RESERVED1  : 18;
    } bit;
  } IEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) DMA Enable Register                                        */

    struct {
      __IOM uint32_t TXDMAEN    : 1;            /* [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RXDMAEN    : 1;            /* [1..1] Receive Data DMA Enable                                            */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } DMAEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Configure Register 0                                       */

    struct {
      __IOM uint32_t HREQEN     : 1;            /* [0..0] Host Request Enable                                                */
      __IOM uint32_t HREQPCFG   : 1;            /* [1..1] Host Request Polarity Configure                                    */
      __IOM uint32_t HREQISEL   : 1;            /* [2..2] Host Request Input Select                                          */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t CIRFEN     : 1;            /* [8..8] Circular FIFO Enable                                               */
      __IOM uint32_t RXMOEN     : 1;            /* [9..9] Receive Data Match Only Enable                                     */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } CFG0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Configure Register 1                                       */

    struct {
      __IOM uint32_t MSCFG      : 1;            /* [0..0] Master/Slave Mode Configure                                        */
      __IOM uint32_t IDSPCFG    : 1;            /* [1..1] Input Data Sample Point Configure                                  */
      __IOM uint32_t APCSEN     : 1;            /* [2..2] Automatic PCS Enable                                               */
      __IOM uint32_t DISTXS     : 1;            /* [3..3] Disable Transmit Stop                                              */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t PCSPPCFG   : 4;            /* [11..8] Peripheral Chip Select Pin Polarity Configure                     */
      __IM  uint32_t RESERVED1  : 4;
      __IOM uint32_t MCFG       : 3;            /* [18..16] Match Configure                                                  */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t IOPCFG     : 2;            /* [25..24] Input/Output Pin Configure                                       */
      __IOM uint32_t ODCFG      : 1;            /* [26..26] Output Data Configure                                            */
      __IOM uint32_t PCSELCFG   : 1;            /* [27..27] Peripheral Chip Select Configure                                 */
      __IM  uint32_t RESERVED3  : 4;
    } bit;
  } CFG1;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000030) Data Match Register 0                                      */

    struct {
      __IOM uint32_t COMPVAL0   : 32;           /* [31..0] Match 0 Value                                                     */
    } bit;
  } DATAM0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000034) Data Match Register 1                                      */

    struct {
      __IOM uint32_t COMPVAL1   : 32;           /* [31..0] Compare Match 1 Value                                             */
    } bit;
  } DATAM1;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Clock Configure Register                                   */

