MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t CNTPRD     : 16;           /* [15..0] Counter Period                                                    */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CNTPRD;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000008) Counter Contains Current Value register                    */

    struct {
      __IM  uint32_t CNTCUR     : 16;           /* [15..0] Counter Contains Current Value                                    */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CNTCUR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Scheduling Interrupt Delay Value register                  */

    struct {
      __IOM uint32_t SINTDLY    : 16;           /* [15..0] Scheduling Interrupt Delay Value                                  */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } SINTDLY;

  struct {
    union {
      __IOM uint32_t reg;                         /* (@ 0x00000010) Channel n Control register 1                             */

      struct {
        __IOM uint32_t CHPTOEN    : 8;            /* [7..0] Channel Pre-Trigger Output Enable                                */
        __IOM uint32_t CHPTOSEL   : 8;            /* [15..8] Channel Pre-Trigger Output Select                               */
        __IOM uint32_t PTBBEN     : 8;            /* [23..16] Pre-Trigger Back-to-Back Operation Enable                      */
        __IM  uint32_t RESERVED0  : 8;
      } bit;
    } CTRL1;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00000014) Channel n Status register                                */

      struct {
        __IOM uint32_t CHPTEFLG   : 8;            /* [7..0] Channel Pre-trigger Sequence Error Flags                         */
        __IM  uint32_t RESERVED0  : 8;
        __IOM uint32_t CHFLG      : 8;            /* [23..16] Channel Flags                                                  */
        __IM  uint32_t RESERVED1  : 8;
      } bit;
    } STS;

    union {
      __IOM uint32_t reg;                         /* (@ 0x00000018) Channel n Delay 0 register                               */

      struct {
        __IOM uint32_t CHPTDLY    : 16;           /* [15..0] Channel Pre-trigger Delay Value                                 */
        __IM  uint32_t RESERVED0  : 16;
      } bit;
    } D[PDU_CH_DELAY_COUNT];
  } CH[PDU_CH_COUNT];

  __IM  uint32_t  RESERVED[66];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000190) Pulse-Out Enable register                                  */

    struct {
      __IOM uint32_t POEN       : 8;            /* [7..0] Pulse Output Enble                                                 */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } POEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000194) Pulse-Out Delay register                                   */

    struct {
      __IOM uint32_t PODLY2     : 16;           /* [15..0] Pulse Output Delay 2 Value                                        */
      __IOM uint32_t PODLY1     : 16;           /* [31..16] Pulse Output Delay 1 Value                                       */
    } bit;
  } PODLY[PDU_PODLY_COUNT];
} PDU_T;                                    /* Size = 408 (0x198)                                                            */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic Redundancy Check (CRC)
  */

typedef struct {                                /* (@ 0x40032000) CRC Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Data register                                              */

    struct {
      __IOM uint32_t LBLB       : 8;            /* [7..0] CRC Low 16Bit Lower Byte                                           */
      __IOM uint32_t LBHB       : 8;            /* [15..8] Low 16 Bit Higher Byte                                            */
      __IOM uint32_t HBLB       : 8;            /* [23..16] High 16Bit Lower Byte                                            */
      __IOM uint32_t HBUB       : 8;            /* [31..24] High 16 Bit Higher Byte                                          */
    } bit;
  } DATA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Polynomial register                                        */

    struct {
      __IOM uint32_t LOWPOL     : 16;           /* [15..0] Low 16 Bit Polynominal                                            */
      __IOM uint32_t HIGHPOL    : 16;           /* [31..16] High 16 Bit Polynominal                                          */
    } bit;
  } POLY;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Control register                                           */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t WIDCRCP    : 1;            /* [24..24] Width of CRC Protocol                                            */
      __IOM uint32_t WASVAL     : 1;            /* [25..25] Write CRC Data Register As Seed Value                            */
      __IOM uint32_t XOR_RDATA  : 1;            /* [26..26] Invert/Complement Read of CRC Data Register                      */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t TTRSEL     : 2;            /* [29..28] Type of Transpose For Read Select                                */
      __IOM uint32_t TTWSEL     : 2;            /* [31..30] Type of Transpose For Writes Select                              */
    } bit;
  } CTRL;
} CRC_T;                                     /* Size = 12 (0xc)                                                              */



/* =========================================================================================================================== */
/* ================                                          LPITMR                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Power Periodic Interrupt Timer (LPITMR)
  */

/** LPITMR - Size of Registers Arrays */
#define LPITMR_TMR_COUNT                           4U

