MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
typedef struct {                                /* (@ 0x4003D000) RTC Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) RTC Time Seconds Register                                  */

    struct {
      __IOM uint32_t TIMSEC     : 32;           /* [31..0] Time Seconds bit                                                  */
    } bit;
  } TIMSEC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) RTC Time Prescaler Register                                */

    struct {
      __IOM uint32_t TIMPSC     : 16;           /* [15..0] Time Prescaler                                                    */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } TIMPSC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) RTC Time Alarm Register                                    */

    struct {
      __IOM uint32_t TIMALR     : 32;           /* [31..0] Time Alarm bit                                                    */
    } bit;
  } TIMALR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) RTC Time Compensation Register                             */

    struct {
      __IOM uint32_t TIMCCFG    : 8;            /* [7..0] Time Compensation Configure                                        */
      __IOM uint32_t CICFG      : 8;            /* [15..8] Compensation Interval Configure                                   */
      __IM  uint32_t TIMCVSET   : 8;            /* [23..16] Time Compensation Value set                                      */
      __IM  uint32_t CICNT      : 8;            /* [31..24] Compensation Interval Counter                                    */
    } bit;
  } TIMC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) RTC Control Register                                       */

    struct {
      __IOM uint32_t SWREN      : 1;            /* [0..0] Software Reset Enable                                              */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t SACCCTRL   : 1;            /* [2..2] Supervisor Access Control                                          */
      __IOM uint32_t UMEN       : 1;            /* [3..3] Update Mode Enable                                                 */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t CLKPOSEL   : 1;            /* [5..5] Clock Pin Output Select                                            */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t LPOCSEL    : 1;            /* [7..7] LPO Clock Sclect                                                   */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t CLKOOUTEN  : 1;            /* [9..9] Clock Output Enable                                                */
      __IM  uint32_t RESERVED4  : 14;
      __IOM uint32_t CLKPEN     : 1;            /* [24..24] Clock Pin Enable                                                 */
      __IM  uint32_t RESERVED5  : 7;
    } bit;
  } CTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) RTC Status Register                                        */

    struct {
      __IM  uint32_t TIMINVFLG  : 1;            /* [0..0] Time Invalid Flag                                                  */
      __IM  uint32_t TIMOVRFLG  : 1;            /* [1..1] Time Overflow Flag                                                 */
      __IM  uint32_t TIMALRFLG  : 1;            /* [2..2] Time Alarm Flag                                                    */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t TIMCNTEN   : 1;            /* [4..4] Time Counter Enable                                                */
      __IM  uint32_t RESERVED1  : 27;
    } bit;
  } STS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) RTC Lock Register                                          */

    struct {
      __IM  uint32_t RESERVED0  : 3;
      __IOM uint32_t TIMCPRO    : 1;            /* [3..3] Time Compensation Protect                                          */
      __IOM uint32_t CTRLPRO    : 1;            /* [4..4] Control Register Protect                                           */
      __IOM uint32_t STSPRO     : 1;            /* [5..5] Status Register Protect                                            */
      __IOM uint32_t LOCKPRO    : 1;            /* [6..6] Lock Register Protect                                              */
      __IM  uint32_t RESERVED1  : 25;
    } bit;
  } LOCK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) RTC Interrupt Enable Register                              */

    struct {
      __IOM uint32_t INVIEN     : 1;            /* [0..0] Invalid Interrupt Enable                                           */
      __IOM uint32_t OVRIEN     : 1;            /* [1..1] Overflow Interrupt Enable                                          */
      __IOM uint32_t ALRIEN     : 1;            /* [2..2] Alarm Interrupt Enable                                             */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t SECIEN     : 1;            /* [4..4] Second Interrupt Enable                                            */
      __IM  uint32_t RESERVED1  : 11;
      __IOM uint32_t TSECICFG   : 3;            /* [18..16] Timer Seconds Interrupt Frequency Configure                      */
      __IM  uint32_t RESERVED2  : 13;
    } bit;
  } IEN;
} RTC_T;                                     /* Size = 32 (0x20)                                                             */



/* =========================================================================================================================== */
/* ================                                           LPTMR                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Power Timer (LPTMR)
  */

