MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
typedef struct {                                /* (@ 0x40040000) LPTMR Structure                                            */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control Status Register                                    */

    struct {
      __IOM uint32_t LPTMREN    : 1;            /* [0..0] LPTMR Enable                                                       */
      __IOM uint32_t TMRMCFG    : 1;            /* [1..1] Timer Mode Configure                                               */
      __IOM uint32_t FRCNT      : 1;            /* [2..2] Free-Running Counter                                               */
      __IOM uint32_t TPIMSEL    : 1;            /* [3..3] Timer Pin Input Mode Select                                        */
      __IOM uint32_t TPISEL     : 2;            /* [5..4] Timer Pin Input Select                                             */
      __IOM uint32_t IEN        : 1;            /* [6..6] Interrupt Enable                                                   */
      __IOM uint32_t COMFLG     : 1;            /* [7..7] Compare Flag                                                       */
      __IOM uint32_t DMAREN     : 1;            /* [8..8] DMA Request Enable                                                 */
      __IM  uint32_t RESERVED0  : 23;
    } bit;
  } CSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Prescaler/Glitch Filter Register                          */

    struct {
      __IOM uint32_t PCLKSEL    : 2;            /* [1..0] Prescaler/Glitch Filter Clock Select                               */
      __IOM uint32_t PBYPEN     : 1;            /* [2..2] Prescaler/Glitch Filter Bypass Enable                              */
      __IOM uint32_t PVCFG      : 4;            /* [6..3] Prescaler/Glitch Filter Value Configure                            */
      __IM  uint32_t RESERVED0  : 25;
    } bit;
  } PSC;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Compare Register                                           */

    struct {
      __IOM uint32_t COMVAL     : 16;           /* [15..0] Compare Value                                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } COM;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Counter Register                                           */

    struct {
      __IOM uint32_t CNTVAL     : 16;           /* [15..0] Counter Value                                                     */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CNT;
} LPTMR_T;                                   /* Size = 16 (0x10)                                                             */



/* =========================================================================================================================== */
/* ================                                            SIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System Integration Management (SIM)
  */

typedef struct {                                /* (@ 0x40048000) SIM Structure                                              */
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Chip Control register                                      */

    struct {
      __IOM uint32_t ADCIPSEL   : 4;            /* [3..0] ADC Interleave Pins Select                                         */
      __IOM uint32_t CLKOUTSEL  : 4;            /* [7..4] Clock Output Select                                                */
      __IOM uint32_t CLKOUTDIVCFG : 3;          /* [10..8] Clock Output Divide Ratio Configure                               */
      __IOM uint32_t CLKOUTEN   : 1;            /* [11..11] Clock Output Enable                                              */
      __IOM uint32_t TRACECLKSEL : 1;           /* [12..12] Trace Clock Source Select                                        */
      __IOM uint32_t PDUBBMSEL  : 1;            /* [13..13] PDU Back-to-Back Mode Select                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t ADCSSEL    : 3;            /* [18..16] ADC Supply Select                                                */
      __IOM uint32_t ADCISMEN   : 1;            /* [19..19] ADC Internal Supply Monitoring Enable                            */
      __IOM uint32_t SRAMHREN   : 1;            /* [20..20] SRAMU Retention Enable                                           */
      __IOM uint32_t SRAMLREN   : 1;            /* [21..21] SRAML Retention Enable                                           */
      __IM  uint32_t RESERVED1  : 10;
    } bit;
  } CHIPCTRL;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) CFGTMR Option Register 0                                     */
    struct {
      __IOM uint32_t CFGTMR0FSxSEL : 3;            /* [2..0] CFGTMR0 Fault Source x Select                                       */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t CFGTMR1FSxSEL : 3;            /* [6..4] CFGTMR1 Fault Source x Select                                       */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t CFGTMR2FSxSEL : 3;            /* [10..8] CFGTMR2 Fault Source x Select                                      */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t CFGTMR3FSxSEL : 3;            /* [14..12] CFGTMR3 Fault Source x Select                                     */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t CFGTMR4EXCLKPINSEL : 2;       /* [17..16] CFGTMR4 External Clock Pin Select                               */
      __IOM uint32_t CFGTMR5EXCLKPINSEL : 2;       /* [19..18] CFGTMR5 External Clock Pin Select                               */
      __IM  uint32_t RESERVED4  : 4;
      __IOM uint32_t CFGTMR0EXCLKPINSEL : 2;      /* [25..24] CFGTMR0 External Clock Pin Select                                  */
      __IOM uint32_t CFGTMR1EXCLKPINSEL : 2;      /* [27..26] CFGTMR1 External Clock Pin Select                                  */
      __IOM uint32_t CFGTMR2EXCLKPINSEL : 2;      /* [29..28] CFGTMR2 External Clock Pin Select                                  */
      __IOM uint32_t CFGTMR3EXCLKPINSEL : 2;      /* [31..30] CFGTMR3 External Clock Pin Select                                  */
    } bit;
  } CFGTMROPT0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) LPO Clock Select Register                                  */

