MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __OM  uint32_t PINW       : 16;           /* [15..0] Global Pin Value Write                                            */
      __OM  uint32_t PINEN      : 16;           /* [31..16] Global Interrupt Enable                                          */
    } bit;
  } GPINCTRLH;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000088) Global Interrupt Control Low Register                      */

    struct {
      __OM  uint32_t INTEN     : 16;           /* [15..0] Global Interrupt Enable                                           */
      __OM  uint32_t INTW      : 16;           /* [31..16] Global Interrupt Value Write                                     */
    } bit;
  } GINTCTRLL;

  union {
    __OM  uint32_t reg;                         /* (@ 0x0000008C) Global Interrupt Control High Register                     */

    struct {
      __OM  uint32_t INTEN      : 16;           /* [15..0] Global Interrupt Enable                                           */
      __OM  uint32_t INTW       : 16;           /* [31..16] Global Interrupt Value Write                                     */
    } bit;
  } GINTCTRLH;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000A0) Interrupt Status Register                                  */

    struct {
      __IOM uint32_t INTFLG    : 32;           /* [31..0] Interrupt Flag                                                    */
    } bit;
  } INTSTS;
  __IM  uint32_t  RESERVED2[7];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C0) Digital Filter Enable Register                             */

    struct {
      __IOM uint32_t DOFEN      : 32;           /* [31..0] Digital Output Filter Enable                                      */
    } bit;
  } DFEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C4) Digital Filter Clock Source Register                       */

    struct {
      __IOM uint32_t DFCLKS     : 1;            /* [0..0] Digital Filter Clock Source                                        */
      __IM  uint32_t RESERVED0  : 31;
    } bit;
  } DFCLKS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000C8) Digital Filter Length Register                             */

    struct {
      __IOM uint32_t DFWID      : 5;            /* [4..0] Digital Filter Width                                               */
      __IM  uint32_t RESERVED0  : 27;
    } bit;
  } DFWID;
} PM_T;                                     /* Size = 204 (0xcc)                                                            */



/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Software Watchdog Timer (WDT)
  */

typedef struct {                                /* (@ 0x40052000) WDT Structure                                              */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) Control and Status Register                                */

    struct {
      __IOM uint32_t STOPEN     : 1;            /* [0..0] Watchdog in Stop Mode Enable                                       */
      __IOM uint32_t WEN        : 1;            /* [1..1] Watchdog in Wait Mode Enable                                       */
      __IOM uint32_t DBGEN      : 1;            /* [2..2] Watchdog in Debug Mode Enable                                      */
      __IOM uint32_t FTEN       : 2;            /* [4..3] Fast Test Enable                                                   */
      __IOM uint32_t RECFGEN    : 1;            /* [5..5] Watchdog Reconfigure Enable                                        */
      __IOM uint32_t WDTIEN     : 1;            /* [6..6] Watchdog Interrupt Enable                                          */
      __IOM uint32_t CNTEN      : 1;            /* [7..7] Watchdog Count Enable                                              */
      __IOM uint32_t CLKSRCSEL  : 2;            /* [9..8] Watchdog Clock Source Select                                       */
      __IM  uint32_t RCSUSFLG   : 1;            /* [10..10] Reconfigure Success Flag                                         */
      __IM  uint32_t ULFLG      : 1;            /* [11..11] Unlock Flag                                                      */
      __IOM uint32_t PSCEN      : 1;            /* [12..12] Prescaler Enable                                                 */
      __IOM uint32_t CMDEN32    : 1;            /* [13..13] 32-bit Refresh / UnlockCommand Write Word Enable                 */
      __IOM uint32_t WDTIFLG    : 1;            /* [14..14] Watchdog Interrupt Flag                                          */
      __IOM uint32_t WINMEN     : 1;            /* [15..15] Window Mode Enable                                               */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) Counter Register                                           */

    struct {
      __IOM uint32_t LOWCNT     : 8;            /* [7..0] Low Byte of Counter                                                */
      __IOM uint32_t HIGHCNT    : 8;            /* [15..8] High Byte of Counter                                              */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } CNT;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Timeout Value Register                                     */

    struct {
      __IOM uint32_t LOWTOVAL   : 8;            /* [7..0] Low Byte of Timeout Value                                          */
      __IOM uint32_t HIGHTOVAL  : 8;            /* [15..8] High Byte of Timeout Value                                        */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } TOVAL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Window Register                                            */

