MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t SMCFG      : 3;            /* [2..0] Shifter Mode Configure                                             */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t SPPOLCFG   : 1;            /* [7..7] Shifter Pin Polarity Configure                                     */
      __IOM uint32_t SUPSEL     : 3;            /* [10..8] Shifter Use Pin Select                                            */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t SOPCFG     : 2;            /* [17..16] Shifter Output Pin Configure                                     */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t SCLKLCFG   : 1;            /* [23..23] Shift clock location Configure                                   */
      __IOM uint32_t TMRSEL     : 2;            /* [25..24] (Timer Select)                                                   */
      __IM  uint32_t RESERVED3  : 6;
    } bit;
  } SCTRL[4];

  __IM  uint32_t  RESERVED3[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) Shifter Configure Register 0                               */

    struct {
      __IOM uint32_t SSTAFSEL   : 2;            /* [1..0] Shifter Start Bit Function Select                                  */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SSTOPFSEL  : 2;            /* [5..4] Shifter Stop Bit Function Select                                   */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t ISRCSEL    : 1;            /* [8..8] Input Source Select                                                */
      __IM  uint32_t RESERVED2  : 23;
    } bit;
  } SCFG[4];

  __IM  uint32_t  RESERVED4[60];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000200) Shifter Buffer Register 0                                  */

    struct {
      __IOM uint32_t SBUFDATA   : 32;           /* [31..0] Shift Buffer Data                                                 */
    } bit;
  } SBUF[4];

  __IM  uint32_t  RESERVED5[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000280) Shifter Buffer 0 Bit Swapped Register                      */

    struct {
      __IOM uint32_t BITSWA     : 32;           /* [31..0] Bit Swap                                                          */
    } bit;
  } SBUFBITSWA[4];

  __IM  uint32_t  RESERVED6[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000300) Shifter Buffer0 Byte Swapped Register                      */

    struct {
      __IOM uint32_t BYTSWA     : 32;           /* [31..0] Byte Swap                                                         */
    } bit;
  } SBUFBYTSWA[4];

  __IM  uint32_t  RESERVED7[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000380) Shifter Buffer0 Bit Byte Swapped Register                  */

    struct {
      __IOM uint32_t BSWAWEB    : 32;           /* [31..0] Bit Swapped Within Each Byte                                      */
    } bit;
  } SBUFBSWA[4];

  __IM  uint32_t  RESERVED8[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000400) Timer Control Register 0                                   */

    struct {
      __IOM uint32_t TMRMCFG    : 2;            /* [1..0] Timer Mode Configure                                               */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t TMRPPOLCFG : 1;            /* [7..7] Timer Pin Polarity Configure                                       */
      __IOM uint32_t TMRUPSEL   : 3;            /* [10..8] Timer Use Pin Select                                              */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t TMROPCFG   : 2;            /* [17..16] Timer output Pin Configure                                       */
      __IM  uint32_t RESERVED2  : 4;
      __IOM uint32_t TRGSSEL    : 1;            /* [22..22] Trigger Source Select                                            */
      __IOM uint32_t TRGPOLCFG  : 1;            /* [23..23] Trigger Polarity Configure                                       */
      __IOM uint32_t TRGVSEL    : 4;            /* [27..24] Trigger Valid Value Select                                       */
      __IM  uint32_t RESERVED3  : 4;
    } bit;
  } TMRCTRL[4];

  __IM  uint32_t  RESERVED9[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000480) Timer Configure Register 0                                 */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t TMRSTAEN   : 1;            /* [1..1] Timer Start Bit Enable                                             */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t TMRSTOPFSEL : 2;           /* [5..4] Timer Stop Bit function select                                     */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t TMRENCFG   : 3;            /* [10..8] Timer Enable Condition Configure                                  */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t TMRDISCFG  : 3;            /* [14..12] Timer Disable Condition Configure                                */
      __IM  uint32_t RESERVED4  : 1;
      __IOM uint32_t TMRRSTCFG  : 3;            /* [18..16] Timer Reset Condition Configure                                  */
      __IM  uint32_t RESERVED5  : 1;
      __IOM uint32_t TMRDCFG    : 2;            /* [21..20] Timer Decrement Configure                                        */
      __IM  uint32_t RESERVED6  : 2;
      __IOM uint32_t TMROCFG    : 2;            /* [25..24] Timer Output Configure                                           */
      __IM  uint32_t RESERVED7  : 6;
    } bit;
  } TMRCFG[4];

  __IM  uint32_t  RESERVED10[28];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000500) Timer Compare Register 0                                   */

    struct {
      __IOM uint32_t TMRCOMPV   : 16;           /* [15..0] Timer Compare Value                                               */
      __IM  uint32_t RESERVED0  : 16;
    } bit;
  } TMRCOMP[4];
} CFGIO_T;                                      /* Size = 1296 (0x510)                                                       */



/* =========================================================================================================================== */
/* ================                                           EWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External Watchdog (EWDT)
  */

typedef struct {                                /* (@ 0x40061000) EWDT Structure                                             */

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000000) Control Register                                           */

