MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __OM  uint8_t EWDTEN      : 1;            /* [0..0] EWDT Module Enable                                                 */
      __OM  uint8_t INSIGSEL    : 1;            /* [1..1] EWDT_in Signal Assertion State Select                              */
      __OM  uint8_t INPEN       : 1;            /* [2..2] Input Port Enable                                                  */
      __IOM uint8_t INTREQEN    : 1;            /* [3..3] Interrupt Request Enable                                           */
            uint8_t             : 4;
    } bit;
  } CTRL;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000001) Service Register                                           */

    struct {
      __OM  uint8_t SEQDATA     : 8;            /* [7..0] Sequence Data Area                                                 */
    } bit;
  } SEQ;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000002) Compare Low Register                                       */

    struct {
      __OM  uint8_t COMPL       : 8;            /* [7..0] Compare Low                                                        */
    } bit;
  } COMPL;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000003) Compare High Register                                      */

    struct {
      __OM  uint8_t COMPH       : 8;            /* [7..0] Compare High                                                       */
    } bit;
  } COMPH;
  __IM  uint8_t   RESERVED;

  union {
    __OM  uint8_t reg;                          /* (@ 0x00000005) Clock Prescaler Register                                   */

    struct {
      __OM  uint8_t CLKPSC      : 8;            /* [7..0] Clock Prescaler                                                    */
    } bit;
  } CLKPSC;
} EWDT_T;                                    /* Size = 6 (0x6)                                                               */



/* =========================================================================================================================== */
/* ================                                            TMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Trigger MUX Control (TMC)
  */

/** TMC - Size of Registers Arrays */
#define TMC_TMCn_COUNT                     30U

typedef struct {                                /* (@ 0x40063000) TMC Structure                                                */
  __IO uint32_t TMCn[TMC_TMCn_COUNT];     /* Array offset: 0x0, array step: 0x4                                                */
} TMC_T;


/* =========================================================================================================================== */
/* ================                                            SCG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System Clock Generator (SCG)
  */

typedef struct {                                /* (@ 0x40064000) SCG Structure                                              */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t VERID      : 32;           /* [31..0] Version Number                                                    */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t CLKS       : 8;            /* [7..0] Clock Sources                                                      */
      __IM  uint32_t RESERVED0  : 19;
      __IM  uint32_t SYSCLKDIVCFG : 5;          /* [31..27] System Clock Divider Configure                                   */
    } bit;
  } PARA;
  __IM  uint32_t  RESERVED[2];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000010) Clock Configure Register                                   */

    struct {
      __IM  uint32_t SCLKDIVRCFG : 4;           /* [3..0] Slow Clock Division Ratio Configure                                */
      __IM  uint32_t BCLKDIVRCFG : 4;           /* [7..4] Bus Clock Divide Ratio Configure                                   */
      __IM  uint32_t RESERVED1  : 8;
      __IM  uint32_t CCLKDIVRCFG : 4;           /* [19..16] Core Clock Divide Ratio Configure                                */
      __IM  uint32_t RESERVED2  : 4;
      __IM  uint32_t SYSCLKSSEL : 4;            /* [27..24] System Clock Source Select                                       */
      __IM  uint32_t RESERVED3  : 4;
    } bit;
  } CLKCFG;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Run Clock Control Register                                 */

    struct {
      __IOM uint32_t SCLKDIVRCFG : 4;           /* [3..0] Slow Clock Division Ratio Configure                                */
      __IOM uint32_t BCLKDIVRCFG : 4;           /* [7..4] Bus Clock Divide Ratio Configure                                   */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t CCLKDIVRCFG : 4;           /* [19..16] Core Clock Divide Ratio Configure                                */
      __IM  uint32_t RESERVED1  : 4;
      __IOM uint32_t SYSCLKSSEL : 4;            /* [27..24] System Clock Source Select                                       */
      __IM  uint32_t RESERVED2  : 4;
    } bit;
  } RUNCLKCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) VLPR Clock Control Register                                */

    struct {
      __IOM uint32_t SCLKDIVRCFG : 4;           /* [3..0] Slow Clock Division Ratio Configure                                */
      __IOM uint32_t BCLKDIVRCFG : 4;           /* [7..4] Bus Clock Divide Ratio Configure                                   */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t CCLKDIVRCFG : 4;           /* [19..16] Core Clock Divide Ratio Configure                                */
      __IM  uint32_t RESERVED1  : 4;
      __IOM uint32_t SYSCLKSSEL : 4;            /* [27..24] System Clock Source Select                                       */
      __IM  uint32_t RESERVED2  : 4;
    } bit;
  } VLPRCLKCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) HSRUN Clock Control Register                               */

