MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR2CSSEL : 3;            /* [26..24] CFGTMR2 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR2EN    : 1;            /* [30..30] CFGTMR2 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR2CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000EC) ADC0 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t ADC0CSSEL  : 3;            /* [26..24] ADC0 Clock Source Select                                         */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t ADC0EN     : 1;            /* [30..30] ADC0 Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } ADC0CLK;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000000F4) RTC Clock Register                                      */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t RTCEN      : 1;            /* [30..30] RTC Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } RTCCLK;
  __IM  uint32_t  RESERVED6[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000100) LPTMR Clock Register                                  */

    struct {
      __IOM uint32_t LPTMRDIVDCFG : 3;         /* [2..0] LPTMR Clock Divide Denominator Factor Configure                   */
      __IOM uint32_t LPTMRDIVNCFG : 1;         /* [3..3] LPTMR Clock Divide Numerator Factor Configure                     */
      __IM  uint32_t RESERVED0  : 20;
      __IOM uint32_t LPTMRCSSEL : 3;           /* [26..24] LPTMR Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPTMREN   : 1;            /* [30..30] LPTMR Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPTMRCLK;
  __IM  uint32_t  RESERVED7[8];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000124) PMA Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PMAEN      : 1;            /* [30..30] PMA Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PMACLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000128) PMB Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PMBEN      : 1;            /* [30..30] PMB Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PMBCLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000012C) PMC Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PMCEN      : 1;            /* [30..30] PMC Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PMCCLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000130) PMD Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PMDEN      : 1;            /* [30..30] PMD Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PMDCLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000134) PME Clock Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t PMEEN      : 1;            /* [30..30] PME Clock Enable                                                 */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } PMECLK;
  __IM  uint32_t  RESERVED8[12];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000168) CFGIO Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0       : 24;
      __IOM uint32_t CFGIOCSSEL    : 3;            /* [26..24] CFGIO Clock Source Select                                 */
      __IM  uint32_t RESERVED1       : 3;
      __IOM uint32_t CFGIOEN       : 1;            /* [30..30] CFGIO Clock Enable                                        */
      __IM  uint32_t PSTFLG          : 1;            /* [31..31] Peripheral Present Flag                                     */
    } bit;
  } CFGIOCLK;
  __IM  uint32_t  RESERVED9[6];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000184) EWDT Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t EWDTEN     : 1;            /* [30..30] EWDT Clock Enable                                                */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } EWDTCLK;
  __IM  uint32_t  RESERVED10[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000198) LPI2C0 Clock Register                                      */

