MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPI2CCSSEL : 3;           /* [26..24] LPI2C0 Clock Source Select                                       */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPI2CEN   : 1;            /* [30..30] LPI2C0 Clock Enable                                              */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPI2CCLK;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001A8) LPUART0 Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART0CSSEL : 3;          /* [26..24] LPUART0 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART0EN  : 1;            /* [30..30] LPUART0 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART0CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001AC) LPUART1 Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART1CSSEL : 3;          /* [26..24] LPUART1 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART1EN  : 1;            /* [30..30] LPUART1 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART1CLK;

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001B0) LPUART2 Clock Register                                     */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t LPUART2CSSEL : 3;          /* [26..24] LPUART2 Clock Source Select                                      */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t LPUART2EN  : 1;            /* [30..30] LPUART2 Clock Enable                                             */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } LPUART2CLK;

  __IM  uint32_t  RESERVED12[1];
    union {
    __IOM uint32_t reg;                         /* (@ 0x000001B8) CFGTMR4 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR4CSSEL : 3;            /* [26..24] CFGTMR4 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR4EN    : 1;            /* [30..30] CFGTMR4 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR4CLK;

    union {
    __IOM uint32_t reg;                         /* (@ 0x000001BC) CFGTMR5 Clock Register                                        */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t CFGTMR5CSSEL : 3;            /* [26..24] CFGTMR5 Clock Source Select                                        */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t CFGTMR5EN    : 1;            /* [30..30] CFGTMR5 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } CFGTMR5CLK;
  __IM  uint32_t  RESERVED13[3];

  union {
    __IOM uint32_t reg;                         /* (@ 0x000001CC) COMP0 Clock Register                                       */

    struct {
      __IM  uint32_t RESERVED0  : 30;
      __IOM uint32_t COMP0EN    : 1;            /* [30..30] COMP0 Clock Enable                                               */
      __IM  uint32_t PSTFLG     : 1;            /* [31..31] Peripheral Present Flag                                          */
    } bit;
  } COMP0CLK;
} PCM_T;                                     /* Size = 464 (0x1d0)                                                           */



/* =========================================================================================================================== */
/* ================                                           LPI2C                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPI2C Memory Map/Register Definition can be found here. (LPI2C)
  */

typedef struct {                                /* (@ 0x40066000) LPI2C Structure                                            */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t MTXFS      : 4;            /* [3..0] Master Transmit FIFO Size                                          */
      __IM  uint32_t RESERVED0  : 4;
      __IM  uint32_t MRXFS      : 4;            /* [11..8] Master Receive FIFO Size                                          */
      __IM  uint32_t RESERVED1  : 20;
    } bit;
  } PARA;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Master Control Register                                    */

