MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t MMEN       : 1;            /* [0..0] Master Mode Enable                                                 */
      __IOM uint32_t MRST       : 1;            /* [1..1] Master Logic Software Reset                                        */
      __IOM uint32_t DOZEDIS    : 1;            /* [2..2] Master Disabled in Doze Mode                                       */
      __IOM uint32_t DBGEN      : 1;            /* [3..3] Master Enabled in Debug Mode                                       */
      __IM  uint32_t RESERVED0  : 4;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } MCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Master Status Register                                     */

    struct {
      __IM  uint32_t TXFLG      : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXFLG      : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t ENDFLG     : 1;            /* [8..8] End Flag                                                           */
      __IOM uint32_t STOPFLG    : 1;            /* [9..9] STOP Flag                                                          */
      __IOM uint32_t NACKFLG    : 1;            /* [10..10] Unexpected NACK Detect Flag                                      */
      __IOM uint32_t MALFLG     : 1;            /* [11..11] Master Arbitration Lost Flag                                     */
      __IOM uint32_t FEFLG      : 1;            /* [12..12] FIFO Error Flag                                                  */
      __IOM uint32_t PLTFLG     : 1;            /* [13..13] Pin Low Timeout Flag                                             */
      __IOM uint32_t RXMFLG     : 1;            /* [14..14] Received Data Match Flag                                         */
      __IM  uint32_t RESERVED1  : 9;
      __IM  uint32_t MBSYFLG    : 1;            /* [24..24] LPI2C Master Busy Flag                                             */
      __IM  uint32_t BBSYFLG    : 1;            /* [25..25] LPI2C Bus Busy Flag                                                */
      __IM  uint32_t RESERVED2  : 6;
    } bit;
  } MSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Master Interrupt Enable Register                           */

    struct {
      __IOM uint32_t TXDIEN     : 1;            /* [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RXDIEN     : 1;            /* [1..1] Receive Data Interrupt Enable                                      */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t ENDIEN     : 1;            /* [8..8] End Packet Interrupt Enable                                        */
      __IOM uint32_t STOPIEN    : 1;            /* [9..9] STOP Detect Interrupt Enable                                       */
      __IOM uint32_t NACKIEN    : 1;            /* [10..10] Unexpected NACK Detect Interrupt Enable                          */
      __IOM uint32_t MALIEN     : 1;            /* [11..11] Master Arbitration Lost Interrupt Enable                         */
      __IOM uint32_t FEIEN      : 1;            /* [12..12] FIFO Error Interrupt Enable                                      */
      __IOM uint32_t PLTIEN     : 1;            /* [13..13] Pin Low Timeout Interrupt Enable                                 */
      __IOM uint32_t RXMIEN     : 1;            /* [14..14] Received Data Match Interrupt Enable                             */
      __IM  uint32_t RESERVED1  : 17;
    } bit;
  } MINTEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) Master DMA Enable Register                                 */

    struct {
      __IOM uint32_t TXDMAEN    : 1;            /* [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RXDMAEN    : 1;            /* [1..1] Receive Data DMA Enable                                            */
      __IM  uint32_t RESERVED0  : 30;
    } bit;
  } MDMAEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) Master Configure Register 0                                */

    struct {
      __IOM uint32_t HRIEN      : 1;            /* [0..0] Host Request Input Enable                                          */
      __IOM uint32_t HRPCFG     : 1;            /* [1..1] Host Request Polarity Configure                                    */
      __IOM uint32_t HRISRC     : 1;            /* [2..2] Host Request Input Source Select                                   */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t CFEN       : 1;            /* [8..8] Circular FIFO Enable                                               */
      __IOM uint32_t RXMEN      : 1;            /* [9..9] Receive Data Match Enable                                          */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } MCFG0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) Master Configure Register 1                                */

    struct {
      __IOM uint32_t CLKPS      : 3;            /* [2..0] Clock Prescaler Configure                                          */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t ASGEN      : 1;            /* [8..8] Automatic STOP Condition Generation                                */
      __IOM uint32_t INACK      : 1;            /* [9..9] Ignore NACK                                                        */
      __IOM uint32_t PINLTOCFG  : 1;            /* [10..10] Pin Low Timeout Configure                                        */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t MCCFG      : 3;            /* [18..16] Match Condition Configure                                        */
      __IM  uint32_t RESERVED2  : 5;
      __IOM uint32_t PINMCFG    : 3;            /* [26..24] Pin Mode Configure                                               */
      __IM  uint32_t RESERVED3  : 5;
    } bit;
  } MCFG1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) Master Configure Register 2                                */

