MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t BITO       : 12;           /* [11..0] Bus Idle Timeout Value                                            */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t FILSCLCFG  : 4;            /* [19..16] Filter SCL Configure                                             */
      __IM  uint32_t RESERVED1  : 4;
      __IOM uint32_t FILSDACFG  : 4;            /* [27..24] Filter SDA Configure                                             */
      __IM  uint32_t RESERVED2  : 4;
    } bit;
  } MCFG2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) Master Configure Register 3                                */

    struct {
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t PLTO       : 12;           /* [19..8] Pin Low Timeout Flag Configure                                    */
      __IM  uint32_t RESERVED1  : 12;
    } bit;
  } MCFG3;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000040) Master Data Match Register                                 */

    struct {
      __IOM uint32_t VAL0       : 8;            /* [7..0] Compare Match 0 Value                                              */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t VAL1       : 8;            /* [23..16] Compare Match 1 Value                                            */
      __IM  uint32_t RESERVED1  : 8;
    } bit;
  } MDATAM;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000048) Master Clock Configure Register 0                          */

    struct {
      __IOM uint32_t SCLLC      : 6;            /* [5..0] SCL Low Cycles                                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SCLHC      : 6;            /* [13..8] SCL High Cycles                                                   */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t SETUPT     : 6;            /* [21..16] Minimum Number of Cycles of Setup Time                           */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t SDAHT      : 6;            /* [29..24] Minimum Cycle of SDA Hold Time                                   */
      __IM  uint32_t RESERVED3  : 2;
    } bit;
  } MCLKCFG0;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000050) Master Clock Configure Register 1                          */

    struct {
      __IOM uint32_t SCLLC      : 6;            /* [5..0] SCL Low Cycles                                                     */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SCLHC      : 6;            /* [13..8] SCL High Cycles                                                   */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t SETUPT     : 6;            /* [21..16] Minimum Number of Cycles of Setup Time                           */
      __IM  uint32_t RESERVED2  : 2;
      __IOM uint32_t SDAHT      : 6;            /* [29..24] Minimum Cycle of SDA Hold Time                                   */
      __IM  uint32_t RESERVED3  : 2;
    } bit;
  } MCLKCFG1;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000058) Master FIFO Control Register                               */

    struct {
      __IOM uint32_t TXFW       : 2;            /* [1..0] Transmit FIFO Watermark                                            */
      __IM  uint32_t RESERVED0  : 14;
      __IOM uint32_t RXFW       : 2;            /* [17..16] Receive FIFO Watermark                                           */
      __IM  uint32_t RESERVED1  : 14;
    } bit;
  } MFCTRL;

  union {
    __IM  uint32_t reg;                         /* (@ 0x0000005C) Master FIFO Status Register                                */

    struct {
      __IM  uint32_t TXCNT      : 3;            /* [2..0] Transmit FIFO Count                                                */
      __IM  uint32_t RESERVED0  : 13;
      __IM  uint32_t RXCNT      : 3;            /* [18..16] Receive FIFO Count                                               */
      __IM  uint32_t RESERVED1  : 13;
    } bit;
  } MFSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000060) Master Transmit Data Register                              */

    struct {
      __OM  uint32_t TXDATA     : 8;            /* [7..0] Transmit Data                                                      */
      __OM  uint32_t CMD        : 3;            /* [10..8] Command                                                           */
      __IM  uint32_t RESERVED0  : 21;
    } bit;
  } MTXDATA;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000070) Master Receive Data Register                               */

    struct {
      __IM  uint32_t RXDATA     : 8;            /* [7..0] Read Undiscarded Received Data                                     */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t RXFE       : 1;            /* [14..14] Receive FIFO Empty                                               */
      __IM  uint32_t RESERVED1  : 17;
    } bit;
  } MRXDATA;
  __IM  uint32_t  RESERVED6[39];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000110) Slave Control Register                                     */

    struct {
      __IOM uint32_t SMEN       : 1;            /* [0..0] Slave Mode Enable                                                  */
      __IOM uint32_t SRST       : 1;            /* [1..1] Slave Logic Software Reset                                         */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t SMFEN      : 1;            /* [4..4] Slave Mode Filter Enable                                           */
      __IOM uint32_t FDDM       : 1;            /* [5..5] Filter Disabled in Doze Mode                                       */
      __IM  uint32_t RESERVED1  : 2;
      __OM  uint32_t TXFRST     : 1;            /* [8..8] Transmit FIFO Reset                                                */
      __OM  uint32_t RXFRST     : 1;            /* [9..9] Receive FIFO Reset                                                 */
      __IM  uint32_t RESERVED2  : 22;
    } bit;
  } SCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000114) Slave Status Register                                      */

