MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t TXFLG      : 1;            /* [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RXFLG      : 1;            /* [1..1] Receive Data Flag                                                  */
      __IM  uint32_t AVFLG      : 1;            /* [2..2] Address Status Register Valid Flag                                 */
      __IM  uint32_t TAFLG      : 1;            /* [3..3] Transmit ACK/NACK Flag                                             */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t RSFLG      : 1;            /* [8..8] Repeated Start Flag                                                */
      __IOM uint32_t STOPFLG    : 1;            /* [9..9] STOP Detect Flag                                                   */
      __IOM uint32_t BEFLG      : 1;            /* [10..10] Bit Error Flag                                                   */
      __IOM uint32_t FEFLG      : 1;            /* [11..11] FIFO Error Flag                                                  */
      __IM  uint32_t A0MFLG     : 1;            /* [12..12] Address 0 Match Address Flag                                     */
      __IM  uint32_t A1MFLG     : 1;            /* [13..13] Address 1 Match Address Flag                                     */
      __IM  uint32_t GCAFLG     : 1;            /* [14..14] General Call Address Flag                                        */
      __IM  uint32_t SARFLG     : 1;            /* [15..15] SMBus Alert Response Flag                                        */
      __IM  uint32_t RESERVED1  : 8;
      __IM  uint32_t SBSYFLG    : 1;            /* [24..24] LPI2C Slave Busy Flag                                              */
      __IM  uint32_t BBSYFLG    : 1;            /* [25..25] LPI2C Bus Busy Flag                                                */
      __IM  uint32_t RESERVED2  : 6;
    } bit;
  } SSTS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000118) Slave Interrupt Enable Register                            */

    struct {
      __IOM uint32_t TXIEN      : 1;            /* [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RXIEN      : 1;            /* [1..1] Receive Data Interrupt Enable                                      */
      __IOM uint32_t AVIEN      : 1;            /* [2..2] Address Valid Interrupt Enable                                     */
      __IOM uint32_t TAIEN      : 1;            /* [3..3] Transmit ACK/NACK Interrupt Enable                                 */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t RSIEN      : 1;            /* [8..8] Slave Repeated Start Interrupt Enable                              */
      __IOM uint32_t STOPIEN    : 1;            /* [9..9] Slave STOP Detect Interrupt Enable                                 */
      __IOM uint32_t BEIEN      : 1;            /* [10..10] Slave Bit Error Interrupt En                                     */
      __IOM uint32_t FEIEN      : 1;            /* [11..11] FIFO Error Enable                                                */
      __IOM uint32_t A0MIEN     : 1;            /* [12..12] Address 0 Match Address Interrupt Enable                         */
      __IOM uint32_t A1MIEN     : 1;            /* [13..13] Address 1 Match Address Interrupt Enable                         */
      __IOM uint32_t GCAIEN     : 1;            /* [14..14] General Call Interrupt Enable                                    */
      __IOM uint32_t SARIEN     : 1;            /* [15..15] SMBus Alert Interrupt Enable                                     */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } SINTEN;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000011C) Slave DMA Enable Register                                  */

    struct {
      __IOM uint32_t TXDMAEN    : 1;            /* [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RXDMAEN    : 1;            /* [1..1] Receive Data DMA Enable                                            */
      __IOM uint32_t AVDMAEN    : 1;            /* [2..2] Address Valid DMA Enable                                           */
      __IM  uint32_t RESERVED0  : 29;
    } bit;
  } SDMAEN;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000124) Slave Configure Register 1                                 */

    struct {
      __IOM uint32_t ADDRSEN    : 1;            /* [0..0] Address SCL Stall Enable                                           */
      __IOM uint32_t RXDSEN     : 1;            /* [1..1] Receive Data SCL Stall Enable                                      */
      __IOM uint32_t TXDSEN     : 1;            /* [2..2] Transmit Data SCL Stall Enable                                     */
      __IOM uint32_t ACKSEN     : 1;            /* [3..3] ACK SCL Stall Enable                                               */
      __IM  uint32_t RESERVED0  : 4;
      __IOM uint32_t GCAEN      : 1;            /* [8..8] General Call Address Enable                                        */
      __IOM uint32_t SAMEN      : 1;            /* [9..9] SMBus Alert Match Enable                                           */
      __IOM uint32_t TXFCFG     : 1;            /* [10..10] Transmit Data Flag Configure                                     */
      __IOM uint32_t RXFCFG     : 1;            /* [11..11] Receive Data Flag Configure                                      */
      __IOM uint32_t INACK      : 1;            /* [12..12] Ignore NACK                                                      */
      __IOM uint32_t HSMDEN     : 1;            /* [13..13] High Speed Mode Detection Enable                                 */
      __IM  uint32_t RESERVED1  : 2;
      __IOM uint32_t ADDRMCFG   : 3;            /* [18..16] Address Match Configure                                          */
      __IM  uint32_t RESERVED2  : 13;
    } bit;
  } SCFG1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000128) Slave Configure Register 2                                 */

