MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 14;
      __IOM uint32_t RXDMFLG2   : 1;            /* [14..14] Received Data Match 2 Flag                                       */
      __IOM uint32_t RXDMFLG1   : 1;            /* [15..15] Received Data Match 1 Flag                                       */
      __IOM uint32_t PEFLG      : 1;            /* [16..16] Parity Error Flag                                                */
      __IOM uint32_t FEFLG      : 1;            /* [17..17] Fram Error Flag                                                  */
      __IOM uint32_t NEFLG      : 1;            /* [18..18] Noise Flag                                                       */
      __IOM uint32_t OVREFLG    : 1;            /* [19..19] Overrun Error Flag                                               */
      __IOM uint32_t IDLEFLG    : 1;            /* [20..20] Idle Line Detected Flag                                          */
      __IM  uint32_t RXBFFLG    : 1;            /* [21..21] Receive Data Buffer full Flag                                    */
      __IM  uint32_t TXCFLG     : 1;            /* [22..22] Transmission data Complete Flag                                  */
      __IM  uint32_t TXBEFLG    : 1;            /* [23..23] Transmit Data Buffer Empty Flag                                  */
      __IM  uint32_t RXDINIFLG  : 1;            /* [24..24] RXD Input Not Idle Flag                                          */
      __IOM uint32_t LBDEN      : 1;            /* [25..25] LIN Break Detection Enable                                       */
      __IOM uint32_t BCTXLEN    : 1;            /* [26..26] Break Character Transmission Length                              */
      __IOM uint32_t RXWUPID    : 1;            /* [27..27] Receive Wake Up Idle Detect                                      */
      __IOM uint32_t RXDIPINV   : 1;            /* [28..28] Received Data Input Polarity Inversion                           */
      __IOM uint32_t MSBFSET    : 1;            /* [29..29] MSB First Set                                                    */
      __IOM uint32_t AERXPFLG   : 1;            /* [30..30] Active Edge on Receive Pin Flag                                  */
      __IOM uint32_t LBDFLG     : 1;            /* [31..31] LIN Break Detected Flag                                          */
    } bit;
  } STS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) LPUART Control Register                                    */

    struct {
      __IOM uint32_t PTCFG      : 1;            /* [0..0] Parity Type Configure                                              */
      __IOM uint32_t PENCFG      : 1;            /* [1..1] Parity Enable Configure                                            */
      __IOM uint32_t ITSEL      : 1;            /* [2..2] Idle Type Select                                                   */
      __IOM uint32_t RXWAKESEL  : 1;            /* [3..3] Receiver Wakeup Method Select                                      */
      __IOM uint32_t RXTXCSEL   : 1;            /* [4..4] Receiver and Transmit Character Select                             */
      __IOM uint32_t RXISRCSEL  : 1;            /* [5..5] Receiver Input Source Select                                       */
      __IOM uint32_t DOZEMODEEN : 1;            /* [6..6] Doze Mode Enable                                                   */
      __IOM uint32_t LSWSEL     : 1;            /* [7..7] Loop Mode or Single-wire Mode Select                               */
      __IOM uint32_t IDLECCFG   : 3;            /* [10..8] Idle Character Configure                                          */
      __IOM uint32_t RXTXSELM7  : 1;            /* [11..11] Receiver and Transmit Select 7-bit Mode                          */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t FIENM2     : 1;            /* [14..14] Match 2 Flag Interrupt Enable                                    */
      __IOM uint32_t FIENM1     : 1;            /* [15..15] Match 1 Flag Interrupt Enable                                    */
      __IOM uint32_t TXBK       : 1;            /* [16..16] Transmit Break                                                   */
      __IOM uint32_t RXWUPCTRL  : 1;            /* [17..17] Receiver Wakeup Control                                          */
      __IOM uint32_t RXEN       : 1;            /* [18..18] LPUART Receiver Enable                                           */
      __IOM uint32_t TXEN       : 1;            /* [19..19] LPUART Transmitter Enable                                        */
      __IOM uint32_t IDLEIEN    : 1;            /* [20..20] Idle Line Interrupt Enable                                       */
      __IOM uint32_t RXIEN      : 1;            /* [21..21] Receiver Interrupt Enable                                        */
      __IOM uint32_t TXCIEN     : 1;            /* [22..22] Transmission Complete Interrupt Enable                           */
      __IOM uint32_t TXIEN      : 1;            /* [23..23] Transmit Interrupt Enable                                        */
      __IOM uint32_t PEIEN      : 1;            /* [24..24] Parity Error Interrupt Enable                                    */
      __IOM uint32_t FEIEN      : 1;            /* [25..25] Framing Error Interrupt Enable                                   */
      __IOM uint32_t NEIEN      : 1;            /* [26..26] Noise Error Interrupt Enable                                     */
      __IOM uint32_t OVRIEN     : 1;            /* [27..27] Overrun Interrupt Enable                                         */
      __IOM uint32_t TXDOPINV   : 1;            /* [28..28] Transmit Data Output Polarity Inversion                          */
      __IOM uint32_t TXDPDIRSEL : 1;            /* [29..29] TXD Pin Direction in Single-Wire Mode Select                     */
      __IOM uint32_t RX9TX8     : 1;            /* [30..30] Receive Data Bit 9 / Transmit Data Bit 8                         */
      __IOM uint32_t RX8TX9     : 1;            /* [31..31] Receive Data Bit 8 / Transmit Data Bit 9                         */
    } bit;
  } CTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000001C) LPUART Data Register                                       */

