MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t RX0TX0     : 1;            /* [0..0] Rx Buffer 0 or Tx Buffer 0                                         */
      __IOM uint32_t RX1TX1     : 1;            /* [1..1] Rx Buffer 1 or Tx Buffer 1                                         */
      __IOM uint32_t RX2TX2     : 1;            /* [2..2] Rx Buffer 2 or Tx Buffer 2                                         */
      __IOM uint32_t RX3TX3     : 1;            /* [3..3] Rx Buffer 3 or Tx Buffer 3                                         */
      __IOM uint32_t RX4TX4     : 1;            /* [4..4] Rx Buffer 4 or Tx Buffer 4                                         */
      __IOM uint32_t RX5TX5     : 1;            /* [5..5] Rx Buffer 5 or Tx Buffer 5                                         */
      __IOM uint32_t RX6TX6     : 1;            /* [6..6] Rx Buffer 6 or Tx Buffer 6                                         */
      __IOM uint32_t RX7TX7     : 1;            /* [7..7] Rx Buffer 7 or Tx Buffer 7                                         */
      __IOM uint32_t RX8TX8     : 1;            /* [8..8] Rx Buffer 8 or Tx Buffer 8                                         */
      __IOM uint32_t RX9TX9     : 1;            /* [9..9] Rx Buffer 9 or Tx Buffer 9                                         */
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t RXIDLE     : 1;            /* [11..11] Receiver Idle Line                                               */
      __IM  uint32_t RXBE       : 1;            /* [12..12] Receive Buffer Empty                                             */
      __IOM uint32_t FETXSC     : 1;            /* [13..13] Frame Error or Transmit Special Character                        */
      __IM  uint32_t PE         : 1;            /* [14..14] Parity Error                                                     */
      __IM  uint32_t NE         : 1;            /* [15..15] Noise Error                                                      */
      __IM  uint32_t RESERVED1  : 16;
    } bit;
  } DATA;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000020) LPUART Match Address Register                              */

    struct {
      __IOM uint32_t MADDR1     : 10;           /* [9..0] Match Address 1                                                    */
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t MADDR2     : 10;           /* [25..16] Match Address 2                                                  */
      __IM  uint32_t RESERVED1  : 6;
    } bit;
  } MADDR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000024) LPUART Modem IrDA Register                                 */

    struct {
      __IOM uint32_t TXCSEN     : 1;            /* [0..0] Transmitter Clear-to-Send Enable                                   */
      __IOM uint32_t TXRSEN     : 1;            /* [1..1] Transmitter Request-to-Send Enable                                 */
      __IOM uint32_t TXRSPCFG   : 1;            /* [2..2] Transmitter Request-to-Send Polarity Configure                     */
      __IOM uint32_t RXRSEN     : 1;            /* [3..3] Receiver Request-to-Send Enable                                    */
      __IOM uint32_t TXCSCFG    : 1;            /* [4..4] Transmit CTS Sample Configure                                      */
      __IOM uint32_t TXCSRCSEL  : 1;            /* [5..5] Transmit CTS Source Select                                         */
      __IM  uint32_t RESERVED0  : 2;
      __IOM uint32_t RXROCFG    : 2;            /* [9..8] Receive RTS Output Configure                                       */
      __IM  uint32_t RESERVED1  : 6;
      __IOM uint32_t TXNPCFG    : 2;            /* [17..16] Transmitter Narrow Pulse Configure                               */
      __IOM uint32_t IRMODEEN   : 1;            /* [18..18] Infrared Modulation/Demodulation Enable                          */
      __IM  uint32_t RESERVED2  : 13;
    } bit;
  } MIR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000028) LPUART FIFO Register                                       */

    struct {
      __IM  uint32_t RXFBDCFG   : 3;            /* [2..0] Receive FIFO Buffer Depth Configure                                */
      __IOM uint32_t RXBFEN     : 1;            /* [3..3] Receive Buffer FIFO Enable                                         */
      __IM  uint32_t TXFBDCFG   : 3;            /* [6..4] Transmit FIFO Buffer Depth Configure                               */
      __IOM uint32_t TXBFEN     : 1;            /* [7..7] Transmit Buffer FIFO Enable                                        */
      __IOM uint32_t RXUFGINT   : 1;            /* [8..8] RX Buffer Underflow Flag Generate Interrupt                        */
      __IOM uint32_t TXOFGINT   : 1;            /* [9..9] TX Buffer Overflow Flag Generate Interrupt                         */
      __IOM uint32_t CFGRXIEEN  : 3;            /* [12..10] Configures when the Receiver is Idle Empty Enable                */
      __IM  uint32_t RESERVED0  : 1;
      __OM  uint32_t RXFBDFLU   : 1;            /* [14..14] Receive FIFO/Buffer Data Flush                                   */
      __OM  uint32_t TXFBDFLU   : 1;            /* [15..15] Transmit FIFO/Buffer Data Flush                                  */
      __IOM uint32_t RXBUFLG    : 1;            /* [16..16] Receiver Buffer Underflow Occured Flag                           */
      __IOM uint32_t TXBOFLG    : 1;            /* [17..17] Transmitter Buffer Overflow Occured Flag                         */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t RXBE       : 1;            /* [22..22] Receive Buffer Empty                                             */
      __IM  uint32_t TXBE       : 1;            /* [23..23] Transmit Buffer Empty                                            */
      __IM  uint32_t RESERVED2  : 8;
    } bit;
  } FIFO;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000002C) LPUART Watermark Register                                  */

