MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t TXWAT      : 2;            /* [1..0] Transmit Watermark                                                 */
      __IM  uint32_t RESERVED0  : 6;
      __IM  uint32_t TXFBUFCNT  : 3;            /* [10..8] Transmit FIFO/Buffer Counter                                      */
      __IM  uint32_t RESERVED1  : 5;
      __IOM uint32_t RXWAT      : 2;            /* [17..16] Receive Watermark                                                */
      __IM  uint32_t RESERVED2  : 6;
      __IM  uint32_t RXFBUFCNT  : 3;            /* [26..24] Receive FIFO/Buffer Counter                                      */
      __IM  uint32_t RESERVED3  : 5;
    } bit;
  } WMKR;
} LPUART_T;                                 /* Size = 48 (0x30)                                                              */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog Comparators (COMP)
  */

typedef struct {                                /* (@ 0x40073000) COMP Structure                                             */

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000000) COMP Control Register 0                                    */

    struct {
      __IOM uint32_t HBHLSEL    : 2;            /* [1..0] Hard Block Hysteresis Level Select                                 */
      __IOM uint32_t HBOLSEL    : 1;            /* [2..2] Hard Block Offset Level Select                                     */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t FOSMPCNT   : 3;            /* [6..4] Filter Output Sample Count                                         */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t ACEN       : 1;            /* [8..8] Analog Comparator Enable                                           */
      __IOM uint32_t COPCFG     : 1;            /* [9..9] Comparator Output Pin Configure                                    */
      __IOM uint32_t COCFG      : 1;            /* [10..10] Comparator Output Configure                                      */
      __IOM uint32_t INVEN      : 1;            /* [11..11] Invert Enable                                                    */
      __IOM uint32_t PMSEL      : 1;            /* [12..12] Power Mode Select                                                */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t WINMEN     : 1;            /* [14..14] Windowing Mode Enable                                            */
      __IOM uint32_t SMPMEN     : 1;            /* [15..15] Sample Mode Enable                                               */
      __IOM uint32_t FSMPPCFG   : 8;            /* [23..16] Filter Sample Period Configure                                   */
      __IM  uint32_t ACO        : 1;            /* [24..24] Analog Comparator Output                                         */
      __IOM uint32_t ACFFLG     : 1;            /* [25..25] Analog Comparator Falling Flag                                   */
      __IOM uint32_t ACRFLG     : 1;            /* [26..26] Analog Comparator Rising Flag                                    */
      __IOM uint32_t ACFIEN     : 1;            /* [27..27] Analog Comparator Falling Interrupt Enable                       */
      __IOM uint32_t ACRIEN     : 1;            /* [28..28] Analog Comparator Rising Interrupt Enable                        */
      __IM  uint32_t RESERVED3  : 1;
      __IOM uint32_t DMAEN      : 1;            /* [30..30] DMA Enable                                                       */
      __IM  uint32_t RESERVED4  : 1;
    } bit;
  } CTRL0;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000004) COMP Control Register 1                                    */

    struct {
      __IOM uint32_t DACOVCFG   : 8;            /* [7..0] DAC Output Voltage Configure                                       */
      __IOM uint32_t MUXMICSEL  : 3;            /* [10..8] Minus Input MUX Select                                            */
      __IOM uint32_t MUXPICSEL  : 3;            /* [13..11] Plus Input MUX Select                                            */
      __IOM uint32_t SVRSSEL    : 1;            /* [14..14] Supply Voltage Reference Source Select                           */
      __IOM uint32_t DACEN      : 1;            /* [15..15] DAC Enable                                                       */
      __IOM uint32_t INENCH0    : 1;            /* [16..16] Channel 0 input enable                                           */
      __IOM uint32_t INENCH1    : 1;            /* [17..17] Channel 1 input enable                                           */
      __IOM uint32_t INENCH2    : 1;            /* [18..18] Channel 2 input enable                                           */
      __IOM uint32_t INENCH3    : 1;            /* [19..19] Channel 3 input enable                                           */
      __IOM uint32_t INENCH4    : 1;            /* [20..20] Channel 4 input enable                                           */
      __IOM uint32_t INENCH5    : 1;            /* [21..21] Channel 5 input enable                                           */
      __IOM uint32_t INENCH6    : 1;            /* [22..22] Channel 6 input enable                                           */
      __IOM uint32_t INENCH7    : 1;            /* [23..23] Channel 7 input enable                                           */
      __IOM uint32_t CNISEL     : 2;            /* [25..24] Comparator Negative Input Select                                 */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t CPISEL     : 2;            /* [28..27] Comparator Positive Input Select                                 */
      __IM  uint32_t RESERVED1  : 3;
    } bit;
  } CTRL1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) COMP Control Register 2                                    */

