MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t CRETCHn    : 8;            /* [7..0] Input Comparison Result of Channel n                               */
      __IOM uint32_t IDCLKCFG   : 6;            /* [13..8] Initialization Delay Clock Configure                              */
      __IOM uint32_t NSCFG      : 2;            /* [15..14] Number of Sample Clocks Configure                                */
      __IOM uint32_t ICFLGCH0   : 1;            /* [16..16] Channel 0 input changed flag                                     */
      __IOM uint32_t ICFLGCH1   : 1;            /* [17..17] Channel 1 input changed flag                                     */
      __IOM uint32_t ICFLGCH2   : 1;            /* [18..18] Channel 2 input changed flag                                     */
      __IOM uint32_t ICFLGCH3   : 1;            /* [19..19] Channel 3 input changed flag                                     */
      __IOM uint32_t ICFLGCH4   : 1;            /* [20..20] Channel 4 input changed flag                                     */
      __IOM uint32_t ICFLGCH5   : 1;            /* [21..21] Channel 5 input changed flag                                     */
      __IOM uint32_t ICFLGCH6   : 1;            /* [22..22] Channel 6 input changed flag                                     */
      __IOM uint32_t ICFLGCH7   : 1;            /* [23..23] Channel 7 input changed flag                                     */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t MUXFCHSEL  : 3;            /* [27..25] Fixed MUX Channel Select                                         */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t MUXFPSEL   : 1;            /* [29..29] Fixed MUX Port Select                                            */
      __IOM uint32_t RRIEN      : 1;            /* [30..30] Round-Robin Interrupt Enable                                     */
      __IOM uint32_t RRSEL      : 1;            /* [31..31] Round-Robin Select                                               */
    } bit;
  } CTRL2;
} COMP_T;                                    /* Size = 12 (0xc)                                                              */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power management unit (PMU)
  */

typedef struct {                                /* (@ 0x4007D000) PMU Structure                                              */

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000000) Low Voltage Detect Control and Status1 Register            */

    struct {
            uint8_t             : 4;
      __IOM uint8_t LVDEGSYSREN : 1;            /* [4..4] Low-Voltage Detect Event Generation System Reset Enable            */
      __OM  uint8_t LVDHWINTREN : 1;            /* [5..5] Low-Voltage Warning Error Acknowledge                              */
      __OM  uint8_t LVDERRACK   : 1;            /* [6..6] Low-Voltage Warning Error Acknowledge                              */
      __IM  uint8_t LVDEFLG     : 1;            /* [7..7] Low-Voltage Warning Event Flag                                     */
    } bit;
  } LVDCSTS1;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000001) Low Voltage Detect Control and Status2 Register            */

    struct {
            uint8_t             : 5;
      __IOM uint8_t LVWHWINTREN : 1;            /* [5..5] Low-Voltage Warning Hardware Interrupt Enable                      */
      __OM  uint8_t LVWERRACK   : 1;            /* [6..6] Low-Voltage Warning Error Acknowledge                              */
      __IM  uint8_t LVWEFLG     : 1;            /* [7..7] Low-Voltage Warning Event Flag                                     */
    } bit;
  } LVDCSTS2;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000002) Regulator Control and Status Register                      */

    struct {
      __IOM uint8_t BEN         : 1;            /* [0..0] Bias Enable                                                        */
      __IOM uint8_t CLKBDIS     : 1;            /* [1..1] Clock Bias Disable                                                 */
      __IM  uint8_t RFPMSTS     : 1;            /* [2..2] Regulator in Full Performance Mode Status                          */
            uint8_t             : 3;
      __IM  uint8_t LPOCLKSTS   : 1;            /* [6..6] LPO Clock Status                                                   */
      __IOM uint8_t LPODIS      : 1;            /* [7..7] LPO Disable                                                        */
    } bit;
  } REGCSTS;
  __IM  uint8_t   RESERVED;

  union {
    __IOM uint8_t reg;                          /* (@ 0x00000004) Low Power Oscillator Trim Register                         */

    struct {
      __IOM uint8_t TLPOF     : 5;            /* [4..0] Trimming Low Power Oscillator Frequency                            */
            uint8_t             : 3;
    } bit;
  } LPOSCTRIM;
} PMU_T;                                     /* Size = 5 (0x5)                                                               */



/* =========================================================================================================================== */
/* ================                                           SYSMC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System Mode Controller (SYSMC)
  */

typedef struct {                                /* (@ 0x4007E000) SYSMC Structure                                            */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

