MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version Number                                             */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Feature Register                                           */

    struct {
      __IM  uint32_t HSRUNAVA   : 1;            /* [0..0] HSRUN Feature Available                                            */
      __IM  uint32_t RESERVED0  : 2;
      __IM  uint32_t LLSAVA     : 1;            /* [3..3] LLS Feature Available                                              */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t LLS2AVA    : 1;            /* [5..5] LLS2 Feature Available                                             */
      __IM  uint32_t VLLS0AVA   : 1;            /* [6..6] VLLS0 Feature Available                                            */
      __IM  uint32_t RESERVED2  : 25;
    } bit;
  } FEATURE;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Power Mode Protection register                             */

    struct {
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t ALLOWLP    : 1;            /* [5..5] Allow MCU Enter Very Low Power Mode                                */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t ALLOWHS    : 1;            /* [7..7] Allow MCU Enter High-Speed Run Mode                                */
      __IM  uint32_t RESERVED2  : 24;
    } bit;
  } PMPRO;

  union {
    __IOM uint32_t reg;                         /* (@ 0x0000000C) Power Mode Control register                                */

    struct {
      __IOM uint32_t STOPCTRL   : 3;            /* [2..0] Stop Mode Control                                                  */
      __IM  uint32_t VLPSEA     : 1;            /* [3..3] Very Low Power Stop Mode Entry Aborted                             */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t RUNCTRL    : 2;            /* [6..5] Run Mode Control                                                   */
      __IM  uint32_t RESERVED1  : 25;
    } bit;
  } PMCTRL;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000010) Stop Operation Select Register                             */

    struct {
      __IM  uint32_t RESERVED0  : 6;
      __IOM uint32_t STOPOSEL   : 2;            /* [7..6] Stop Operation Select                                              */
      __IM  uint32_t RESERVED1  : 24;
    } bit;
  } STOPOSEL;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000014) Power Mode Status register                                 */

    struct {
      __IM  uint32_t PMSTS      : 8;            /* [7..0] Power Mode Status                                                  */
      __IM  uint32_t RESERVED0  : 24;
    } bit;
  } PMSTS;
} SYSMC_T;                                   /* Size = 24 (0x18)                                                             */



/* =========================================================================================================================== */
/* ================                                            RMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset Management unit (RMU)
  */

typedef struct {                                /* (@ 0x4007F000) RMU Structure                                              */

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /* [15..0] Feature ID                                                        */
      __IM  uint32_t MINOR      : 8;            /* [23..16] Minor Version ID                                                 */
      __IM  uint32_t MAJOR      : 8;            /* [31..24] Major Version ID                                                 */
    } bit;
  } VERID;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IM  uint32_t LVDRSTSTS  : 1;            /* [1..1] Low Voltage Detection Reset Function Status                        */
      __IM  uint32_t CLKLRSTSTS : 1;            /* [2..2] Clock Loss Reset Function Status                                   */
      __IM  uint32_t LOCKLRSTSTS : 1;           /* [3..3] Lock Loss Reset Function Status                                    */
      __IM  uint32_t RESERVED1  : 1;
      __IM  uint32_t WDTRSTSTS  : 1;            /* [5..5] Watchdog Timer Reset Function Status                               */
      __IM  uint32_t ERSTSTS    : 1;            /* [6..6] External Pin Reset Function Status                                 */
      __IM  uint32_t PORRSTSTS  : 1;            /* [7..7] POR Reset Function Status                                          */
      __IM  uint32_t JTAGRSTSTS : 1;            /* [8..8] JTAG Reset Function Status                                         */
      __IM  uint32_t CLOCKRSTSTS : 1;           /* [9..9] Core Lockup Reset Function Status                                  */
      __IM  uint32_t SWRSTSTS   : 1;            /* [10..10] Software Reset Function Status                                   */
      __IM  uint32_t SRSTSTS    : 1;            /* [11..11] System Reset Function Status                                     */
      __IM  uint32_t RESERVED2  : 1;
      __IM  uint32_t STOPACKERSTSTS : 1;        /* [13..13] Stop Acknowledge Error Reset Function Status                     */
      __IM  uint32_t RESERVED3  : 18;
    } bit;
  } PARA;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000008) Reset Status Register                                      */

