MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IOM uint32_t PLLO       : 32;           /* [31..0] Port Logic Level Output                                           */
    } bit;
  } PLLO;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000004) Port Logic Level Output Set Register                       */

    struct {
      __OM  uint32_t PLLOS      : 32;           /* [31..0] Port Logic Level Output Set                                       */
    } bit;
  } PLLOS;

  union {
    __OM  uint32_t reg;                         /* (@ 0x00000008) Port Logic Level Output Clear Register                     */

    struct {
      __OM  uint32_t PLLOC      : 32;           /* [31..0] Port Logic Level Output Clear                                     */
    } bit;
  } PLLOC;

  union {
    __OM  uint32_t reg;                         /* (@ 0x0000000C) Port Logic Level Output Toggle Register                    */

    struct {
      __OM  uint32_t PLLOT      : 32;           /* [31..0] Port Logic Level Output Toggle                                    */
    } bit;
  } PLLOT;

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000010) Port Logic Level Input Register                            */

    struct {
      __IM  uint32_t PLLI       : 32;           /* [31..0] Port Logic Level Input                                            */
    } bit;
  } PLLI;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000014) Port Logic Level Transfer Direction Select Register        */

    struct {
      __IOM uint32_t PLLTDS     : 32;           /* [31..0] Port Logic Level Transfer Direction Select                        */
    } bit;
  } PLLTDS;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000018) Port Logic Level Input Disable Register                    */

    struct {
      __IOM uint32_t PLLID      : 32;           /* [31..0] Port Logic Level Input Disable                                    */
    } bit;
  } PLLID;
} GPIO_T;                                   /* Size = 28 (0x1c)                                                              */



/* =========================================================================================================================== */
/* ================                                          APM32_SCB                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief System Control Registers (APM32_SCB)
  */

typedef struct {                                /* (@ 0xE000E000) APM32_SCB Structure                                          */
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000008) Auxiliary Control Register,                                */

    struct {
      __IOM uint32_t DISMCYCINT : 1;            /* [0..0] Disables interruption of multi-cycle instructions.                 */
      __IOM uint32_t DISDEFWBUF : 1;            /* [1..1] Disables write buffer use during default memory map accesses.      */
      __IOM uint32_t DISFOLD    : 1;            /* [2..2] Disables folding of IT instructions.                               */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t DISFPCA    : 1;            /* [8..8] SBZP / Disables automatic update of CONTROL.FPCA.                  */
      __IOM uint32_t DISOOFP    : 1;            /* [9..9] Disables floating point instructions completing out of
                                                     order with respect to integer instructions.                             */
      __IM  uint32_t RESERVED1  : 22;
    } bit;
  } ACTLR;
  __IM  uint32_t  RESERVED1[829];

  union {
    __IM  uint32_t reg;                         /* (@ 0x00000D00) CPUID Base Register                                        */

    struct {
      __IM  uint32_t REVISION   : 4;            /* [3..0] Indicates patch release: 0x0 = Patch 0                             */
      __IM  uint32_t PARTNO     : 12;           /* [15..4] Indicates part number                                             */
      __IM  uint32_t RESERVED2  : 4;
      __IM  uint32_t VARIANT    : 4;            /* [23..20] Indicates processor revision: 0x2 = Revision 2                   */
      __IM  uint32_t IMPLEMENTER : 8;           /* [31..24] Implementer code                                                 */
    } bit;
  } CPUID;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D04) Interrupt Control and State Register                       */

    struct {
      __IM  uint32_t VECTACTIVE : 9;            /* [8..0] Active exception number                                            */
      __IM  uint32_t RESERVED0  : 2;
      __IM  uint32_t RETTOBASE  : 1;            /* [11..11] Indicates whether there are preempted active exceptions          */
      __IM  uint32_t VECTPENDING : 6;           /* [17..12] Exception number of the highest priority pending enabled
                                                     exception                                                               */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t ISRPENDING : 1;            /* [22..22] Interrupt pending flag, excluding NMI and Faults                 */
      __IM  uint32_t ISRPREEMPT : 1;            /* [23..23] You must only use this at debug time. It indicates
                                                     that a pending interrupt becomes active in the next running
                                                     cycle. If C_MASKINTS is clear in the Debug Halting Control
                                                     and Status Register, the interrupt is serviced                          */
      __IM  uint32_t RESERVED2  : 1;
      __OM  uint32_t PENDSTCLR  : 1;            /* [25..25] SysTick exception clear-pending bit                              */
      __IOM uint32_t PENDSTSET  : 1;            /* [26..26] SysTick exception set-pending bit                                */
      __OM  uint32_t PENDSVCLR  : 1;            /* [27..27] PendSV clear-pending bit                                         */
      __IOM uint32_t PENDSVSET  : 1;            /* [28..28] PendSV set-pending bit                                           */
      __IM  uint32_t RESERVED3  : 2;
      __IOM uint32_t NMIPENDSET : 1;            /* [31..31] NMI set-pending bit                                              */
    } bit;
  } ICSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D08) Vector Table Offset Register                               */

