MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
    struct {
      __IM  uint32_t RESERVED0  : 7;
      __IOM uint32_t TBLOFF     : 25;           /* [31..7] Vector table base offset                                          */
    } bit;
  } VTOR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D0C) Application Interrupt and Reset Control Register           */

    struct {
      __OM  uint32_t VECTRESET  : 1;            /* [0..0] Reserved for Debug use. This bit reads as 0. When writing
                                                     to the register you must write 0 to this bit, otherwise
                                                     behavior is Unpredictable.                                              */
      __OM  uint32_t VECTCLRACTIVE : 1;         /* [1..1] Reserved for Debug use. This bit reads as 0. When writing
                                                     to the register you must write 0 to this bit, otherwise
                                                     behavior is Unpredictable.                                              */
      __OM  uint32_t SYSRESETREQ : 1;           /* [2..2] System reset request bit is implementation defined                 */
      __IM  uint32_t RESERVED0  : 5;
      __IOM uint32_t PRIGROUP   : 3;            /* [10..8] Interrupt priority grouping field. This field determines
                                                     the split of group priority from subpriority.                           */
      __IM  uint32_t RESERVED1  : 4;
      __IM  uint32_t ENDIANNESS : 1;            /* [15..15] Data endianness bit is implementation defined                    */
      __IOM uint32_t VECTKEY    : 16;           /* [31..16] Register key                                                     */
    } bit;
  } AIRCR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D10) System Control Register                                    */

    struct {
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t SLEEPONEXIT : 1;           /* [1..1] Indicates sleep-on-exit when returning from Handler mode
                                                     to Thread mode                                                          */
      __IOM uint32_t SLEEPDEEP  : 1;            /* [2..2] Controls whether the processor uses sleep or deep sleep
                                                     as its low power mode                                                   */
      __IM  uint32_t RESERVED1  : 1;
      __IOM uint32_t SEVONPEND  : 1;            /* [4..4] Send Event on Pending bit                                          */
      __IM  uint32_t RESERVED2  : 27;
    } bit;
  } SCR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D14) Configuration and Control Register                         */

    struct {
      __IOM uint32_t NONBASETHRDENA : 1;        /* [0..0] Indicates how the processor enters Thread mode                     */
      __IOM uint32_t USERSETMPEND : 1;          /* [1..1] Enables unprivileged software access to the STIR                   */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t UNALIGN_TRP : 1;           /* [3..3] Enables unaligned access traps                                     */
      __IOM uint32_t DIV_0_TRP  : 1;            /* [4..4] Enables faulting or halting when the processor executes
                                                     an SDIV or UDIV instruction with a divisor of 0                         */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t BFHFNMIGN  : 1;            /* [8..8] Enables handlers with priority -1 or -2 to ignore data
                                                     BusFaults caused by load and store instructions.                        */
      __IOM uint32_t STKALIGN   : 1;            /* [9..9] Indicates stack alignment on exception entry                       */
      __IM  uint32_t RESERVED2  : 22;
    } bit;
  } CCR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D18) System Handler Priority Register 1                         */

    struct {
      __IOM uint32_t PRI_4      : 8;            /* [7..0] Priority of system handler 4, MemManage                            */
      __IOM uint32_t PRI_5      : 8;            /* [15..8] Priority of system handler 5, BusFault                            */
      __IOM uint32_t PRI_6      : 8;            /* [23..16] Priority of system handler 6, UsageFault                         */
      __IM  uint32_t RESERVED0  : 8;
    } bit;
  } SHPR1;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D1C) System Handler Priority Register 2                         */

    struct {
      __IM  uint32_t RESERVED0  : 24;
      __IOM uint32_t PRI_11     : 8;            /* [31..24] Priority of system handler 11, SVCall                            */
    } bit;
  } SHPR2;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D20) System Handler Priority Register 3                         */

    struct {
      __IOM uint32_t PRI_12     : 8;            /* [7..0] Priority of system handler 12, DebugMonitor                        */
      __IM  uint32_t RESERVED0  : 8;
      __IOM uint32_t PRI_14     : 8;            /* [23..16] Priority of system handler 14, PendSV                            */
      __IOM uint32_t PRI_15     : 8;            /* [31..24] Priority of system handler 15, SysTick exception                 */
    } bit;
  } SHPR3;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D24) System Handler Control and State Register                  */

    struct {
      __IOM uint32_t MEMFAULTACT : 1;           /* [0..0] MemManage exception active bit, reads as 1 if exception
                                                     is active                                                               */
      __IOM uint32_t BUSFAULTACT : 1;           /* [1..1] BusFault exception active bit, reads as 1 if exception
                                                     is active                                                               */
      __IM  uint32_t RESERVED0  : 1;
      __IOM uint32_t USGFAULTACT : 1;           /* [3..3] UsageFault exception active bit, reads as 1 if exception
                                                     is active                                                               */
      __IM  uint32_t RESERVED1  : 3;
      __IOM uint32_t SVCALLACT  : 1;            /* [7..7] SVCall active bit, reads as 1 if SVC call is active                */
      __IOM uint32_t MONITORACT : 1;            /* [8..8] Debug monitor active bit, reads as 1 if Debug monitor
                                                     is active                                                               */
      __IM  uint32_t RESERVED2  : 1;
      __IOM uint32_t PENDSVACT  : 1;            /* [10..10] PendSV exception active bit, reads as 1 if exception
                                                     is active                                                               */
      __IOM uint32_t SYSTICKACT : 1;            /* [11..11] SysTick exception active bit, reads as 1 if exception
                                                     is active                                                               */
      __IOM uint32_t USGFAULTPENDED : 1;        /* [12..12] UsageFault exception pending bit, reads as 1 if exception
                                                     is pending                                                              */
      __IOM uint32_t MEMFAULTPENDED : 1;        /* [13..13] MemManage exception pending bit, reads as 1 if exception
                                                     is pending                                                              */
      __IOM uint32_t BUSFAULTPENDED : 1;        /* [14..14] BusFault exception pending bit, reads as 1 if exception
                                                     is pending                                                              */
      __IOM uint32_t SVCALLPENDED : 1;          /* [15..15] SVCall pending bit, reads as 1 if exception is pending           */
      __IOM uint32_t MEMFAULTENA : 1;           /* [16..16] MemManage enable bit, set to 1 to enable                         */
      __IOM uint32_t BUSFAULTENA : 1;           /* [17..17] BusFault enable bit, set to 1 to enable                          */
      __IOM uint32_t USGFAULTENA : 1;           /* [18..18] UsageFault enable bit, set to 1 to enable                        */
      __IM  uint32_t RESERVED3  : 13;
    } bit;
  } SHCSR;

  union {
    __IOM uint32_t reg;                         /* (@ 0x00000D28) Configurable Fault Status Registers                        */

