MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
#define CSE_PRAM                    ((CSE_PRAM_T*)          CSE_PRAM_BASE)
#define AC                          ((AC_T*)                AC_BASE)
#define MSC                         ((MSC_T*)               MSC_BASE)
#define DMA                         ((DMA_T*)               DMA_BASE)
#define MPU                         ((MPU_T*)               MPU_BASE)
#define EREP                        ((EREP_T*)              EREP_BASE)
#define EINJ                        ((EINJ_T*)              EINJ_BASE)
#define FLASH                       ((FLASH_T*)             FLASH_BASE)
#define DMACHM                      ((DMACHM_T*)            DMACHM_BASE)
#define CAN0                    ((CAN_T*)           CAN0_BASE)
#define CAN1                    ((CAN_T*)           CAN1_BASE)
#define CAN2                    ((CAN_T*)           CAN2_BASE)
#define CFGTMR0                       ((CFGTMR_T*)              CFGTMR0_BASE)
#define CFGTMR1                       ((CFGTMR_T*)              CFGTMR1_BASE)
#define CFGTMR2                       ((CFGTMR_T*)              CFGTMR2_BASE)
#define CFGTMR3                       ((CFGTMR_T*)              CFGTMR3_BASE)
#define CFGTMR4                       ((CFGTMR_T*)              CFGTMR4_BASE)
#define CFGTMR5                       ((CFGTMR_T*)              CFGTMR5_BASE)
#define ADC0                        ((ADC_T*)               ADC0_BASE)
#define ADC1                        ((ADC_T*)               ADC1_BASE)
#define LPSPI0                      ((LPSPI_T*)             LPSPI0_BASE)
#define LPSPI1                      ((LPSPI_T*)             LPSPI1_BASE)
#define LPSPI2                      ((LPSPI_T*)             LPSPI2_BASE)
#define PDU0                        ((PDU_T*)               PDU0_BASE)
#define PDU1                        ((PDU_T*)               PDU1_BASE)
#define CRC                         ((CRC_T*)               CRC_BASE)
#define LPITMR                      ((LPITMR_T*)            LPITMR_BASE)
#define RTC                         ((RTC_T*)               RTC_BASE)
#define LPTMR                       ((LPTMR_T*)             LPTMR_BASE)
#define SIM                         ((SIM_T*)               SIM_BASE)
#define PMA                         ((PM_T*)                PMA_BASE)
#define PMB                         ((PM_T*)                PMB_BASE)
#define PMC                         ((PM_T*)                PMC_BASE)
#define PMD                         ((PM_T*)                PMD_BASE)
#define PME                         ((PM_T*)                PME_BASE)
#define WDT                         ((WDT_T*)               WDT_BASE)
#define CFGIO                       ((CFGIO_T*)             CFGIO_BASE)
#define EWDT                        ((EWDT_T*)              EWDT_BASE)
#define TMC                         ((TMC_T*)               TMC_BASE)
#define SCG                         ((SCG_T*)               SCG_BASE)
#define PCM                         ((PCM_T*)               PCM_BASE)
#define LPI2C                       ((LPI2C_T*)             LPI2C_BASE)
#define LPUART0                     ((LPUART_T*)            LPUART0_BASE)
#define LPUART1                     ((LPUART_T*)            LPUART1_BASE)
#define LPUART2                     ((LPUART_T*)            LPUART2_BASE)
#define COMP                        ((COMP_T*)              COMP_BASE)
#define PMU                         ((PMU_T*)               PMU_BASE)
#define SYSMC                       ((SYSMC_T*)             SYSMC_BASE)
#define RMU                         ((RMU_T*)               RMU_BASE)
#define GPIOA                       ((GPIO_T*)              GPIOA_BASE)
#define GPIOB                       ((GPIO_T*)              GPIOB_BASE)
#define GPIOC                       ((GPIO_T*)              GPIOC_BASE)
#define GPIOD                       ((GPIO_T*)              GPIOD_BASE)
#define GPIOE                       ((GPIO_T*)              GPIOE_BASE)
#define APM32_SCB                     ((APM32_SCB_T*)           APM32_SCB_BASE)
#define APM32_SysTick                 ((APM32_SysTick_T*)       APM32_SysTick_BASE)
#define APM32_NVIC                    ((APM32_NVIC_T*)          APM32_NVIC_BASE)
#define MC                          ((MC_T*)                MC_BASE)
#define LMC                         ((LMC_T*)               LMC_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                           defined Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup Macros_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         CSE_PRAM                                          ================ */
/* =========================================================================================================================== */



/* =========================================================================================================================== */
/* ================                                            AC                                             ================ */
/* =========================================================================================================================== */

