MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =========================================================  MPRIA  ========================================================= */
/* ===============================================  AC MPRIA MPLCFG3 [16..16]  =============================================== */
/* AC_MPRIA_MPLCFG2 */
  #define    AC_MPRIA_MPLCFG3_0                     0U      /* 0 : Accesses from this master are forced to user-mode.          */
  #define    AC_MPRIA_MPLCFG3_1                     1U      /* 1 : Accesses from this master are not forced to user-mode.      */


/* ================================================  AC MPRIA MTWA3 [17..17]  ================================================ */
/* AC_MPRIA_MTWA2 */
 #define    AC_MPRIA_MTWA3_0                       0U    /* 0 : This master is not trusted for write accesses.                 */
 #define    AC_MPRIA_MTWA3_1                       1U     /* 1 : This master is trusted for write accesses.                    */


/* ================================================  AC MPRIA MTRA3 [18..18]  ================================================ */
/* AC_MPRIA_MTRA2 */
#define  AC_MPRIA_MTRA3_0                            0U      /* 0 : This master is not trusted for read accesses.              */
#define  AC_MPRIA_MTRA3_1                            1U      /* 1 : This master is trusted for read accesses.                  */


/* ===============================================  AC MPRIA MPLCFG2 [20..20]  =============================================== */
/* AC_MPRIA_MPLCFG2 */
  #define    AC_MPRIA_MPLCFG2_0                     0U      /* 0 : Accesses from this master are forced to user-mode.          */
  #define    AC_MPRIA_MPLCFG2_1                     1U      /* 1 : Accesses from this master are not forced to user-mode.      */


/* ================================================  AC MPRIA MTWA2 [21..21]  ================================================ */
/* AC_MPRIA_MTWA2 */
 #define    AC_MPRIA_MTWA2_0                       0U    /* 0 : This master is not trusted for write accesses.                 */
 #define    AC_MPRIA_MTWA2_1                       1U     /* 1 : This master is trusted for write accesses.                    */


/* ================================================  AC MPRIA MTRA2 [22..22]  ================================================ */
/* AC_MPRIA_MTRA2 */
#define  AC_MPRIA_MTRA2_0                            0U      /* 0 : This master is not trusted for read accesses.              */
#define  AC_MPRIA_MTRA2_1                            1U      /* 1 : This master is trusted for read accesses.                  */


/* ===============================================  AC MPRIA MPLCFG1 [24..24]  =============================================== */
/* AC_MPRIA_MPLCFG1 */
#define  AC_MPRIA_MPLCFG1_0                            0U     /* 0 : Accesses from this master are forced to user-mode.        */
#define  AC_MPRIA_MPLCFG1_1                            1U     /* 1 : Accesses from this master are not forced to user-mode.    */


/* ================================================  AC MPRIA MTWA1 [25..25]  ================================================ */
/* AC_MPRIA_MTWA1 */
#define  AC_MPRIA_MTWA1_0                            0U      /* 0 : This master is not trusted for write accesses.             */
#define  AC_MPRIA_MTWA1_1                            1U      /* 1 : This master is trusted for write accesses.                 */


/* ================================================  AC MPRIA MTRA1 [26..26]  ================================================ */
/* AC_MPRIA_MTRA1 */
#define  AC_MPRIA_MTRA1_0                            0U     /* 0 : This master is not trusted for read accesses.                */
#define  AC_MPRIA_MTRA1_1                            1U     /* 1 : This master is trusted for read accesses.                    */


/*                                                  AC MPRIA MPLCFG0 [28..28]                                                  */
/* AC_MPRIA_MPLCFG0 */
#define  AC_MPRIA_MPLCFG0_0                            0U     /* 0 : Accesses from this master are forced to user-mode.         */
#define  AC_MPRIA_MPLCFG0_1                            1U     /* 1 : Accesses from this master are not forced to user-mode.     */


/*                                                   AC MPRIA MTWA0 [29..29]                                                   */
                                /* AC_MPRIA_MTWA0                                                            */
#define  AC_MPRIA_MTWA0_0                            0U     /* 0 : This master is not trusted for write accesses.             */
#define  AC_MPRIA_MTWA0_1                            1U     /* 1 : This master is trusted for write accesses.                 */


/*                                                   AC MPRIA MTRA0 [30..30]                                                   */
/* AC_MPRIA_MTRA0  */
#define  AC_MPRIA_MTRA0_0                            0U     /* 0 : This master is not trusted for read accesses.               */
#define  AC_MPRIA_MTRA0_1                            1U     /* 1 : This master is trusted for read accesses.                   */


/*                                                          PACCTRLA                                                           */
/*                                                 AC PACCTRLA TPCFG1 [24..24]                                                 */
/* AC_PACCTRLA_TPCFG1 */
#define  AC_PACCTRLA_TPCFG1_0                        0U     /* 0 : Accesses from an untrusted master are allowed.             */
#define  AC_PACCTRLA_TPCFG1_1                        1U     /* 1 : Accesses from an untrusted master are not allowed.         */


/*                                                 AC PACCTRLA WPCFG1 [25..25]                                                 */
/* AC_PACCTRLA_WPCFG1 */
 #define AC_PACCTRLA_WPCFG1_0                        0U     /* 0 : This peripheral allows write accesses.                     */
 #define AC_PACCTRLA_WPCFG1_1                        1U     /* 1 : This peripheral is write protected.                        */


/*                                                 AC PACCTRLA SPCFG1 [26..26]                                                 */
/* AC_PACCTRLA_SPCFG1 */
 #define AC_PACCTRLA_SPCFG1_0                        0U     /* 0 : This peripheral does not require supervisor privilege level
                                                                 for accesses.                                              */
 #define AC_PACCTRLA_SPCFG1_1                        1U     /* 1 : This peripheral requires supervisor privilege level for
                                                                 accesses.                                                   */


