MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 AC OPACCTRLE SPCFG6 [6..6]                                                  */
 /* AC_OPACCTRLE_SPCFG6 */
#define  AC_OPACCTRLE_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLE_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLE TPCFG0 [28..28]                                                 */
  /* AC_OPACCTRLE_TPCFG0 */
#define  AC_OPACCTRLE_TPCFG0_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLE_TPCFG0_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLE WPCFG0 [29..29]                                                 */
  /* AC_OPACCTRLE_WPCFG0 */
#define  AC_OPACCTRLE_WPCFG0_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLE_WPCFG0_1                  1U     /* 1 : This peripheral is write protected.                               */


/*                                                AC OPACCTRLE SPCFG0 [30..30]                                                 */
 /* AC_OPACCTRLE_SPCFG0 */
 #define AC_OPACCTRLE_SPCFG0_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
 #define AC_OPACCTRLE_SPCFG0_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                          OPACCTRLF    */
/*                                                 AC OPACCTRLF TPCFG5 [8..8]                                                  */
  /* AC_OPACCTRLF_TPCFG5 */
#define  AC_OPACCTRLF_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLF_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                 AC OPACCTRLF WPCFG5 [9..9]                                                  */
  /* AC_OPACCTRLF_WPCFG5 */
#define  AC_OPACCTRLF_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLF_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                             */


/*                                                AC OPACCTRLF SPCFG5 [10..10]                                                 */
/* AC_OPACCTRLF_SPCFG5 */
#define  AC_OPACCTRLF_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define AC_OPACCTRLF_SPCFG5_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLF TPCFG4 [12..12]                                                 */
   /* AC_OPACCTRLF_TPCFG4 */
#define  AC_OPACCTRLF_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                    */
#define  AC_OPACCTRLF_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                */


/*                                                AC OPACCTRLF WPCFG4 [13..13]                                                 */
/* AC_OPACCTRLF_WPCFG4 */
#define  AC_OPACCTRLF_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLF_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLF SPCFG4 [14..14]                                                 */
  /* AC_OPACCTRLF_SPCFG4 */
#define  AC_OPACCTRLF_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define  AC_OPACCTRLF_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLF TPCFG3 [16..16]                                                 */
 /* AC_OPACCTRLF_TPCFG3 */
#define  AC_OPACCTRLF_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLF_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLF WPCFG3 [17..17]                                                 */
  /* AC_OPACCTRLF_WPCFG3 */
#define  AC_OPACCTRLF_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLF_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLF SPCFG3 [18..18]                                                 */
 /* AC_OPACCTRLF_SPCFG3 */
#define  AC_OPACCTRLF_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
#define  AC_OPACCTRLF_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLF TPCFG2 [20..20]                                                 */
 /* AC_OPACCTRLF_TPCFG2 */
#define  AC_OPACCTRLF_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLF_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLF WPCFG2 [21..21]                                                 */
 /* AC_OPACCTRLF_WPCFG2 */
#define  AC_OPACCTRLF_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLF_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLF SPCFG2 [22..22]                                                 */
  /* AC_OPACCTRLF_SPCFG2 */
#define  AC_OPACCTRLF_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                               for accesses.       */
#define AC_OPACCTRLF_SPCFG2_1                   1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLF TPCFG1 [24..24]                                                 */
/* AC_OPACCTRLF_TPCFG1 */
#define  AC_OPACCTRLF_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                    */
#define  AC_OPACCTRLF_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.                */


/*                                                AC OPACCTRLF WPCFG1 [25..25]                                                 */
 /* AC_OPACCTRLF_WPCFG1 */
 #define AC_OPACCTRLF_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                             */
 #define AC_OPACCTRLF_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                                */


/*                                                AC OPACCTRLF SPCFG1 [26..26]                                                 */
 /* AC_OPACCTRLF_SPCFG1 */
#define  AC_OPACCTRLF_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLF_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                     accesses.           */


/*                                                AC OPACCTRLF TPCFG0 [28..28]                                                 */
/* AC_OPACCTRLF_TPCFG0 */
#define  AC_OPACCTRLF_TPCFG0_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                  */
#define  AC_OPACCTRLF_TPCFG0_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.              */


/*                                                AC OPACCTRLF WPCFG0 [29..29]                                                 */
 /* AC_OPACCTRLF_WPCFG0 */
#define  AC_OPACCTRLF_WPCFG0_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLF_WPCFG0_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLF SPCFG0 [30..30]                                                 */
  /* AC_OPACCTRLF_SPCFG0 */
#define AC_OPACCTRLF_SPCFG0_0                   0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define AC_OPACCTRLF_SPCFG0_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                          OPACCTRLG    */
/*                                                AC OPACCTRLG TPCFG5 [8..8]                                                 */
  /* AC_OPACCTRLG_TPCFG5 */
#define  AC_OPACCTRLG_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                  */
#define  AC_OPACCTRLG_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.              */


/*                                                AAC OPACCTRLG TPCFG5 [9..9]                                                 */
   /* AC_OPACCTRLG_WPCFG5 */
#define  AC_OPACCTRLG_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                          */
#define  AC_OPACCTRLG_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                             */


