MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 AC OPACCTRLI WPCFG6 [5..5]                                                  */
/* AC_OPACCTRLI_WPCFG6 */
#define  AC_OPACCTRLI_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLI_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                               */


/*                                                 AC OPACCTRLI SPCFG6 [6..6]                                                  */
/* AC_OPACCTRLI_SPCFG6 */
#define  AC_OPACCTRLI_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.       */
#define  AC_OPACCTRLI_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.           */


/*                                                 AC OPACCTRLI TPCFG5 [8..8]                                                  */
/* AC_OPACCTRLI_TPCFG5 */
#define  AC_OPACCTRLI_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLI_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                 AC OPACCTRLI WPCFG5 [9..9]                                                  */
 /* AC_OPACCTRLI_WPCFG5 */
#define  AC_OPACCTRLI_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                          */
#define  AC_OPACCTRLI_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLI SPCFG5 [10..10]                                                 */
/* AC_OPACCTRLI_SPCFG5 */
#define  AC_OPACCTRLI_SPCFG5_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
#define  AC_OPACCTRLI_SPCFG5_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLI TPCFG4 [12..12]                                                 */
 /* AC_OPACCTRLI_TPCFG4 */
#define  AC_OPACCTRLI_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLI_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLI WPCFG4 [13..13]                                                 */
 /* AC_OPACCTRLI_WPCFG4 */
#define  AC_OPACCTRLI_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLI_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLI SPCFG4 [14..14]                                                 */
   /* AC_OPACCTRLI_SPCFG4 */
#define  AC_OPACCTRLI_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.       */
#define  AC_OPACCTRLI_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                AC OPACCTRLI TPCFG3 [16..16]                                                 */
   /* AC_OPACCTRLI_TPCFG3 */
#define  AC_OPACCTRLI_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLI_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLI WPCFG3 [17..17]                                                 */
  /* AC_OPACCTRLI_WPCFG3 */
#define  AC_OPACCTRLI_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLI_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLI SPCFG3 [18..18]                                                 */
  /* AC_OPACCTRLI_SPCFG3 */
#define  AC_OPACCTRLI_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.       */
#define  AC_OPACCTRLI_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */


/*                                                AC OPACCTRLI TPCFG1 [24..24]                                                 */
 /* AC_OPACCTRLI_TPCFG1 */
#define  AC_OPACCTRLI_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                  */
#define  AC_OPACCTRLI_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.              */


/*                                                AC OPACCTRLI WPCFG1 [25..25]                                                 */
  /* AC_OPACCTRLI_WPCFG1 */
#define  AC_OPACCTRLI_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLI_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLI SPCFG1 [26..26]                                                 */
   /* AC_OPACCTRLI_SPCFG1 */
#define  AC_OPACCTRLI_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_OPACCTRLI_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.           */


/*                                                          OPACCTRLJ    */
/*                                                AC OPACCTRLJ TPCFG7 [0..0]                                                 */
 /* AC_OPACCTRLJ_TPCFG7 */
#define  AC_OPACCTRLJ_TPCFG7_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                 */
#define  AC_OPACCTRLJ_TPCFG7_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.             */


/*                                                AC OPACCTRLJ WPCFG7 [1..1]                                                 */
 /* AC_OPACCTRLJ_WPCFG7 */
#define  AC_OPACCTRLJ_WPCFG7_0                  0U     /* 0 : This peripheral allows write accesses.                         */
#define  AC_OPACCTRLJ_WPCFG7_1                  1U     /* 1 : This peripheral is write protected.                            */


/*                                                AC OPACCTRLJ SPCFG7 [2..2]                                                 */
/* AC_OPACCTRLJ_SPCFG7 */
#define  AC_OPACCTRLJ_SPCFG7_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_OPACCTRLJ_SPCFG7_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */

/*                                                AC OPACCTRLJ TPCFG6 [4..4]                                                 */
 /* AC_OPACCTRLJ_TPCFG6 */
#define  AC_OPACCTRLJ_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                 */
#define  AC_OPACCTRLJ_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.             */


/*                                                AC OPACCTRLJ WPCFG6 [5..5]                                                 */
 /* AC_OPACCTRLJ_WPCFG6 */
#define  AC_OPACCTRLJ_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                         */
#define  AC_OPACCTRLJ_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                            */


/*                                                AC OPACCTRLJ SPCFG6 [6..6]                                                 */
/* AC_OPACCTRLJ_SPCFG6 */
#define  AC_OPACCTRLJ_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_OPACCTRLJ_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */

