MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                AC OPACCTRLJ TPCFG4 [12..12]                                                 */
 /* AC_OPACCTRLJ_TPCFG4 */
#define  AC_OPACCTRLJ_TPCFG4_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLJ_TPCFG4_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLJ WPCFG4 [13..13]                                                 */
 /* AC_OPACCTRLJ_WPCFG4 */
#define  AC_OPACCTRLJ_WPCFG4_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLJ_WPCFG4_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLJ SPCFG4 [14..14]                                                 */
/* AC_OPACCTRLJ_SPCFG4 */
#define  AC_OPACCTRLJ_SPCFG4_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                    for accesses.       */
#define  AC_OPACCTRLJ_SPCFG4_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                       accesses.           */

/*                                                AC OPACCTRLJ TPCFG3 [16..16]                                                 */
/* AC_OPACCTRLJ_TPCFG3 */
#define  AC_OPACCTRLJ_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLJ_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLJ WPCFG3 [17..17]                                                 */
  /* AC_OPACCTRLJ_WPCFG3 */
#define  AC_OPACCTRLJ_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                            */
#define  AC_OPACCTRLJ_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                               */


/*                                                AC OPACCTRLJ SPCFG3 [18..18]                                                 */
/* AC_OPACCTRLJ_SPCFG3 */
 #define AC_OPACCTRLJ_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.     */
 #define AC_OPACCTRLJ_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.          */


/*                                                AC OPACCTRLJ TPCFG2 [20..20]                                                 */
  /* AC_OPACCTRLJ_TPCFG2 */
#define  AC_OPACCTRLJ_TPCFG2_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLJ_TPCFG2_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLJ WPCFG2 [21..21]                                                 */
  /* AC_OPACCTRLJ_WPCFG2 */
#define  AC_OPACCTRLJ_WPCFG2_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLJ_WPCFG2_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLJ SPCFG2 [22..22]                                                 */
  /* AC_OPACCTRLJ_SPCFG2 */
#define  AC_OPACCTRLJ_SPCFG2_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.    */
#define  AC_OPACCTRLJ_SPCFG2_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.        */


/*                                                AC OPACCTRLK TPCFG6 [4..4]                                                 */
/* AC_OPACCTRLK_TPCFG3 */
#define  AC_OPACCTRLK_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                 */
#define  AC_OPACCTRLK_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.             */

/*                                                AC OPACCTRLK WPCFG6 [5..5]                                                 */
/* AC_OPACCTRLK_WPCFG3 */
 #define AC_OPACCTRLK_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                         */
 #define AC_OPACCTRLK_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                            */

/*                                                AC OPACCTRLK SPCFG6 [6..6]                                                 */
/* AC_OPACCTRLK_SPCFG6 */
 #define AC_OPACCTRLK_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.     */
 #define AC_OPACCTRLK_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.         */


/*                                                AC OPACCTRLK TPCFG3 [16..16]                                                 */
/* AC_OPACCTRLK_TPCFG3  */
#define  AC_OPACCTRLK_TPCFG3_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLK_TPCFG3_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLK WPCFG3 [17..17]                                                 */
/* AC_OPACCTRLK_WPCFG3 */
 #define AC_OPACCTRLK_WPCFG3_0                  0U     /* 0 : This peripheral allows write accesses.                           */
 #define AC_OPACCTRLK_WPCFG3_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLK SPCFG3 [18..18]                                                 */
 /* AC_OPACCTRLK_SPCFG3 */
 #define AC_OPACCTRLK_SPCFG3_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.      */
 #define AC_OPACCTRLK_SPCFG3_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.          */


