MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                AC OPACCTRLK TPCFG1 [24..24]                                                 */
/* AC_OPACCTRLK_TPCFG1 */
#define  AC_OPACCTRLK_TPCFG1_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLK_TPCFG1_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                AC OPACCTRLK WPCFG1 [25..25]                                                 */
/* AC_OPACCTRLK_WPCFG1 */
 #define AC_OPACCTRLK_WPCFG1_0                  0U     /* 0 : This peripheral allows write accesses.                           */
 #define AC_OPACCTRLK_WPCFG1_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                AC OPACCTRLK SPCFG1 [26..26]                                               */
/* AC_OPACCTRLK_SPCFG1 */
 #define AC_OPACCTRLK_SPCFG1_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.    */
 #define AC_OPACCTRLK_SPCFG1_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.        */

/*                                                AC OPACCTRLK TPCFG0 [28..28]                                               */
/* AC_OPACCTRLK_TPCFG0 */
#define  AC_OPACCTRLK_TPCFG0_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                 */
#define  AC_OPACCTRLK_TPCFG0_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.             */


/*                                                AC OPACCTRLK WPCFG0 [29..29]                                               */
/* AC_OPACCTRLK_WPCFG0 */
 #define AC_OPACCTRLK_WPCFG0_0                  0U     /* 0 : This peripheral allows write accesses.                          */
 #define AC_OPACCTRLK_WPCFG0_1                  1U     /* 1 : This peripheral is write protected.                             */


/*                                                AC OPACCTRLK SPCFG0 [30..30]                                                */
 /* AC_OPACCTRLK_SPCFG0 */
 #define AC_OPACCTRLK_SPCFG0_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                      for accesses.     */
 #define AC_OPACCTRLK_SPCFG0_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.         */


/*                                                          OPACCTRLL    */
/*                                                 AC OPACCTRLL TPCFG7 [0..0]                                                  */
/* AC_OPACCTRLL_TPCFG7 */
#define  AC_OPACCTRLL_TPCFG7_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                   */
#define  AC_OPACCTRLL_TPCFG7_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.               */


/*                                                 AC OPACCTRLL WPCFG7 [1..1]                                                  */
/* AC_OPACCTRLL_WPCFG7 */
#define  AC_OPACCTRLL_WPCFG7_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLL_WPCFG7_1                  1U     /* 1 : This peripheral is write protected.                              */


/*                                                 AC OPACCTRLL SPCFG7 [2..2]                                               */
/* AC_OPACCTRLL_SPCFG7 */
 #define AC_OPACCTRLL_SPCFG7_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                       for accesses.  */
 #define AC_OPACCTRLL_SPCFG7_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                      accesses.       */


/*                                                 AC OPACCTRLL TPCFG6 [4..4]                                              */
/* AC_OPACCTRLL_TPCFG6 */
 #define AC_OPACCTRLL_TPCFG6_0                  0U     /* 0 : Accesses from an untrusted master are allowed.               */
 #define AC_OPACCTRLL_TPCFG6_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.           */


/*                                                 AC OPACCTRLL WPCFG6 [5..5]                                               */
/* AC_OPACCTRLL_WPCFG6 */
#define  AC_OPACCTRLL_WPCFG6_0                  0U     /* 0 : This peripheral allows write accesses.                        */
#define  AC_OPACCTRLL_WPCFG6_1                  1U     /* 1 : This peripheral is write protected.                           */


/*                                                 AC OPACCTRLL SPCFG6 [6..6]                                               */
/* AC_OPACCTRLL_SPCFG6 */
 #define AC_OPACCTRLL_SPCFG6_0                  0U     /* 0 : This peripheral does not require supervisor privilege level
                                                        for accesses.  */
 #define AC_OPACCTRLL_SPCFG6_1                  1U     /* 1 : This peripheral requires supervisor privilege level for
                                                        accesses.      */


/*                                                 AC OPACCTRLL TPCFG5 [8..8]                                                 */
/* AC_OPACCTRLL_TPCFG5*/
#define  AC_OPACCTRLL_TPCFG5_0                  0U     /* 0 : Accesses from an untrusted master are allowed.                  */
#define  AC_OPACCTRLL_TPCFG5_1                  1U     /* 1 : Accesses from an untrusted master are not allowed.              */


/*                                                 AC OPACCTRLL WPCFG5 [9..9]                                                  */
/* AC_OPACCTRLL_WPCFG5 */
#define  AC_OPACCTRLL_WPCFG5_0                  0U     /* 0 : This peripheral allows write accesses.                           */
#define  AC_OPACCTRLL_WPCFG5_1                  1U     /* 1 : This peripheral is write protected.                              */


