MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 MSC OCMD1 OCMDPWID [17..19]                                                 */
                                  /* MSC_OCMD1_OCMDPWID                                                        */
#define  MSC_OCMD1_OCMDPWID_010                 2U     /* 010 : OCMEMn 32-bits wide                                                 */
#define  MSC_OCMD1_OCMDPWID_011                 3U     /* 011 : OCMEMn 64-bits wide                                                 */
#define  MSC_OCMD1_OCMDPWID_100                 4U     /* 100 : OCMEMn 128-bits wide                                                */
#define  MSC_OCMD1_OCMDPWID_101                 5U     /* 101 : OCMEMn 256-bits wide                                                */


/*                                                 MSC OCMD1 OCMSIZE [24..27]                                                  */
                                   /* MSC_OCMD1_OCMSIZE                                                         */
#define  MSC_OCMD1_OCMSIZE_0000                 0U     /* 0000 : no OCMEMn                                                          */
#define  MSC_OCMD1_OCMSIZE_0001                 1U     /* 0001 : 1KB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_0010                 2U     /* 0010 : 2KB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_0011                 3U     /* 0011 : 4KB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_0100                 4U     /* 0100 : 8KB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_0101                 5U     /* 0101 : 16KB OCMEMn                                                        */
#define  MSC_OCMD1_OCMSIZE_0110                 6U     /* 0110 : 32KB OCMEMn                                                        */
#define  MSC_OCMD1_OCMSIZE_0111                 7U     /* 0111 : 64KB OCMEMn                                                        */
#define  MSC_OCMD1_OCMSIZE_1000                 8U     /* 1000 : 128KB OCMEMn                                                       */
#define  MSC_OCMD1_OCMSIZE_1001                 9U     /* 1001 : 256KB OCMEMn                                                       */
#define  MSC_OCMD1_OCMSIZE_1010                 10U    /* 1010 : 512KB OCMEMn                                                       */
#define  MSC_OCMD1_OCMSIZE_1011                 11U    /* 1011 : 1MB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_1100                 12U    /* 1100 : 2MB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_1101                 13U    /* 1101 : 4MB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_1110                 14U    /* 1110 : 8MB OCMEMn                                                         */
#define  MSC_OCMD1_OCMSIZE_1111                 15U    /* 1111 : 16MB OCMEMn                                                        */


/*                                                  MSC OCMD1 IFOCM [28..28]                                                   */
                                 /* MSC_OCMD1_IFOCM                                                           */
#define  MSC_OCMD1_IFOCM_0                      0U     /* 0 : OCMEMn is a power-of-2 capacity.                                      */
#define  MSC_OCMD1_IFOCM_1                      1U     /* 1 : OCMEMn is not a power-of-2U with a capacity is 0.75 * OCMSZ.          */


/*                                                MSC OCMD1 OCMVLDFLG [31..31]                                                 */
                                  /* MSC_OCMD1_OCMVLDFLG                                                       */
#define  MSC_OCMD1_OCMVLDFLG_0                  0U     /* 0 : OCMEMn is not present.                                                */
#define  MSC_OCMD1_OCMVLDFLG_1                  1U     /* 1 : OCMEMn is present.                                                    */


/*                                                            OCMD2                                                            */
/*                                                 MSC OCMD2 OCMTYPE [13..15]                                                  */
                                     /* MSC_OCMD2_OCMTYPE                                                         */
#define  MSC_OCMD2_OCMTYPE_100                  4U     /* 100 : OCMEMn is a Program Flash.                                          */
#define  MSC_OCMD2_OCMTYPE_101                  5U     /* 101 : OCMEMn is a Data Flash.                                             */
#define  MSC_OCMD2_OCMTYPE_110                  6U     /* 110 : OCMEMn is an EEE.                                                   */


/*                                                  MSC OCMD2 RONLY [16..16]                                                   */
                                   /* MSC_OCMD2_RONLY                                                           */
#define  MSC_OCMD2_RONLY_0                      0U     /* 0 : Writes to the OCMDRn[11:0] are allowed                                */
#define  MSC_OCMD2_RONLY_1                      1U     /* 1 : Writes to the OCMDRn[11:0] are ignored                                */


/*                                                 MSC OCMD2 OCMDPWID [17..19]                                                 */
                                   /* MSC_OCMD2_OCMDPWID                                                        */
#define  MSC_OCMD2_OCMDPWID_010                 2U     /* 010 : OCMEMn 32-bits wide                                                 */
#define  MSC_OCMD2_OCMDPWID_011                 3U     /* 011 : OCMEMn 64-bits wide                                                 */
#define  MSC_OCMD2_OCMDPWID_100                 4U     /* 100 : OCMEMn 128-bits wide                                                */
#define  MSC_OCMD2_OCMDPWID_101                 5U     /* 101 : OCMEMn 256-bits wide                                                */


/*                                                 MSC OCMD2 OCMSIZE [24..27]                                                  */
                                    /* MSC_OCMD2_OCMSIZE                                                         */
#define  MSC_OCMD2_OCMSIZE_0000                 0U     /* 0000 : no OCMEMn                                                          */
#define  MSC_OCMD2_OCMSIZE_0001                 1U     /* 0001 : 1KB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_0010                 2U     /* 0010 : 2KB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_0011                 3U     /* 0011 : 4KB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_0100                 4U     /* 0100 : 8KB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_0101                 5U     /* 0101 : 16KB OCMEMn                                                        */
#define  MSC_OCMD2_OCMSIZE_0110                 6U     /* 0110 : 32KB OCMEMn                                                        */
#define  MSC_OCMD2_OCMSIZE_0111                 7U     /* 0111 : 64KB OCMEMn                                                        */
#define  MSC_OCMD2_OCMSIZE_1000                 8U     /* 1000 : 128KB OCMEMn                                                       */
#define  MSC_OCMD2_OCMSIZE_1001                 9U     /* 1001 : 256KB OCMEMn                                                       */
#define  MSC_OCMD2_OCMSIZE_1010                 10U    /* 1010 : 512KB OCMEMn                                                       */
#define  MSC_OCMD2_OCMSIZE_1011                 11U    /* 1011 : 1MB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_1100                 12U    /* 1100 : 2MB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_1101                 13U    /* 1101 : 4MB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_1110                 14U    /* 1110 : 8MB OCMEMn                                                         */
#define  MSC_OCMD2_OCMSIZE_1111                 15U    /* 1111 : 16MB OCMEMn                                                        */


/*                                                  MSC OCMD2 IFOCM [28..28]                                                   */
                                  /* MSC_OCMD2_IFOCM                                                           */
#define  MSC_OCMD2_IFOCM_0                      0U     /* 0 : OCMEMn is a power-of-2 capacity.                                      */
#define  MSC_OCMD2_IFOCM_1                      1U     /* 1 : OCMEMn is not a power-of-2U with a capacity is 0.75 * OCMSZ.          */


/*                                                MSC OCMD2 OCMVLDFLG [31..31]                                                 */
                                  /* MSC_OCMD2_OCMVLDFLG                                                       */
 #define MSC_OCMD2_OCMVLDFLG_0                  0U     /* 0 : OCMEMn is not present.                                                */
 #define MSC_OCMD2_OCMVLDFLG_1                  1U     /* 1 : OCMEMn is present.                                                    */




/*                                                                                                                             */
/*                                                             DMA                                                             */
/*                                                                                                                             */

/*                                                            CTRL                                                             */
/*                                                  DMA CTRL HALTEFLG [4..4]                                                   */
                                /* DMA_CTRL_HALTEFLG                                                         */
#define  DMA_CTRL_HALTEFLG_0                    0U     /* 0 : Normal operation                                                      */
#define  DMA_CTRL_HALTEFLG_1                    1U     /* 1 : Any error causes the HALT bit to set. SubsequentlyU all
                                                     service requests are ignored until the HALT bit is cleared.               */


/*                                                    DMA CTRL HALT [5..5]                                                     */
                                 /* DMA_CTRL_HALT                                                             */
#define  DMA_CTRL_HALT_0                        0U     /* 0 : Normal operation                                                      */
#define  DMA_CTRL_HALT_1                        1U     /* 1 : Stall the start of any new channels. Executing channels
                                                     are allowed to complete. Channel execution resumes when
                                                     this bit is cleared.                                                      */


/*                                                    DMA CTRL CLMEN [6..6]                                                    */
                               /* DMA_CTRL_CLMEN                                                            */
#define  DMA_CTRL_CLMEN_0                       0U     /* 0 : A minor loop channel link made to itself goes through channel
                                                      arbitration before being activated again.                                 */
#define  DMA_CTRL_CLMEN_1                       1U     /* 1 : A minor loop channel link made to itself does not go through
                                                       channel arbitration before being activated again. Upon
                                                     minor loop completionU the channel activates again if that
                                                     channel has a minor loop channel link enabled and the link
                                                     channel is itself. This effectively applies the minor loop
                                                     offsets and restarts the next minor loop.                                 */


