MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                  DMA EIEN EIEN15 [15..15]                                                   */
                                     /* DMA_EIEN_EIEN15                                                           */
#define  DMA_EIEN_EIEN15_0                      0U     /* 0 : The error signal for corresponding channel does not generate
                                                        an error interrupt                                                        */
#define  DMA_EIEN_EIEN15_1                      1U     /* 1 : The assertion of the error signal for corresponding channel
                                                    generates an error interrupt request                                      */


/*                                                           EIENCLR                                                           */
/*                                                   DMA EIENCLR NOOP [7..7]                                                   */
                                    /* DMA_EIENCLR_NOOP                                                          */
#define  DMA_EIENCLR_NOOP_0                     0U     /* 0 : Normal operation                                                      */
#define  DMA_EIENCLR_NOOP_1                     1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                           EIENSET                                                           */
/*                                                   DMA EIENSET NOOP [7..7]                                                   */
                                  /* DMA_EIENSET_NOOP                                                          */
#define  DMA_EIENSET_NOOP_0                     0U     /* 0 : Normal operation                                                      */
#define  DMA_EIENSET_NOOP_1                     1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                          REQENCLR                                                           */
/*                                                  DMA REQENCLR NOOP [7..7]                                                   */
                                 /* DMA_REQENCLR_NOOP                                                         */
#define  DMA_REQENCLR_NOOP_0                    0U     /* 0 : Normal operation                                                      */
#define  DMA_REQENCLR_NOOP_1                    1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                          REQENSET                                                           */
/*                                                  DMA REQENSET NOOP [7..7]                                                   */
                                 /* DMA_REQENSET_NOOP                                                         */
#define  DMA_REQENSET_NOOP_0                    0U     /* 0 : Normal operation                                                      */
#define  DMA_REQENSET_NOOP_1                    1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                          DNESTSCLR                                                          */
/*                                                DMA DNESTSCLR ADNECLR [6..6]                                                 */
                                      /* DMA_DNESTSCLR_ADNECLR                                                     */
#define  DMA_DNESTSCLR_ADNECLR_0                0U     /* 0 : Clears only the TCDn_CSTS[DONE] bit specified in the CDNE
                                                       field                                                                     */
#define  DMA_DNESTSCLR_ADNECLR_1                1U     /* 1 : Clears all bits in TCDn_CSTS[DONE]                                    */


/*                                                  DMA DNESTSCLR NOOP [7..7]                                                  */
                                  /* DMA_DNESTSCLR_NOOP                                                        */
#define  DMA_DNESTSCLR_NOOP_0                   0U     /* 0 : Normal operation                                                      */
#define  DMA_DNESTSCLR_NOOP_1                   1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                           STATSET                                                            */
/*                                                 DMA STATSET ASTATSET [6..6]                                                 */
                                      /* DMA_SRTSET_ASTATSET                                                      */
 #define DMA_STATSET_ASTATSET_0                 0U     /* 0 : Set only the TCDn_CSTS[START] bit specified in the SSRT
                                                        field                                                                     */
 #define DMA_STATSET_ASTATSET_1                 1U     /* 1 : Set all bits in TCDn_CSTS[START]                                      */


/*                                                   DMA STATSET NOOP [7..7]                                                    */
                                     /* DMA_SRTSET_NOOP                                                           */
#define  DMA_STATSET_NOOP_0                      0U     /* 0 : Normal operation                                                      */
#define  DMA_STATSET_NOOP_1                      1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                            ESTSCLR                                                             */
/*                                                    DMA ESTSCLR NOOP [7..7]                                                     */
                                    /* DMA_ESTSCLR_NOOP                                                             */
#define  DMA_ESTSCLR_NOOP_0                        0U     /* 0 : Normal operation                                                      */
#define  DMA_ESTSCLR_NOOP_1                        1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                          INTREQCLR                                                          */
/*                                                  DMA INTREQCLR NOOP [7..7]                                                  */
                                /* DMA_INTREQCLR_NOOP                                                        */
#define  DMA_INTREQCLR_NOOP_0                   0U     /* 0 : Normal operation                                                      */
#define  DMA_INTREQCLR_NOOP_1                   1U     /* 1 : No operationU ignore the other bits in this register                  */


/*                                                           INTREQ                                                            */
/*                                                DMA INTREQ INTREQSTS0 [0..0]                                                 */
                                   /* DMA_INTREQ_INTREQSTS0                                                     */
#define  DMA_INTREQ_INTREQSTS0_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS0_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS1 [1..1]                                                 */
                                    /* DMA_INTREQ_INTREQSTS1                                                     */
#define  DMA_INTREQ_INTREQSTS1_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS1_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS2 [2..2]                                                 */
                                    /* DMA_INTREQ_INTREQSTS2                                                     */
#define  DMA_INTREQ_INTREQSTS2_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS2_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


