MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                DMA INTREQ INTREQSTS3 [3..3]                                                 */
                                    /* DMA_INTREQ_INTREQSTS3                                                     */
#define  DMA_INTREQ_INTREQSTS3_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS3_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS4 [4..4]                                                 */
                                    /* DMA_INTREQ_INTREQSTS4                                                     */
#define  DMA_INTREQ_INTREQSTS4_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS4_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS5 [5..5]                                                 */
                                     /* DMA_INTREQ_INTREQSTS5                                                     */
#define  DMA_INTREQ_INTREQSTS5_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS5_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS6 [6..6]                                                 */
                                    /* DMA_INTREQ_INTREQSTS6                                                     */
#define  DMA_INTREQ_INTREQSTS6_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS6_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS7 [7..7]                                                 */
                                     /* DMA_INTREQ_INTREQSTS7                                                     */
#define  DMA_INTREQ_INTREQSTS7_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS7_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS8 [8..8]                                                 */
                                    /* DMA_INTREQ_INTREQSTS8                                                     */
#define  DMA_INTREQ_INTREQSTS8_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS8_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                                DMA INTREQ INTREQSTS9 [9..9]                                                 */
                                    /* DMA_INTREQ_INTREQSTS9                                                     */
#define  DMA_INTREQ_INTREQSTS9_0                0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS9_1                1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS10 [10..10]                                               */
                                    /* DMA_INTREQ_INTREQSTS10                                                    */
#define  DMA_INTREQ_INTREQSTS10_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS10_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS11 [11..11]                                               */
                                    /* DMA_INTREQ_INTREQSTS11                                                    */
#define  DMA_INTREQ_INTREQSTS11_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS11_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS12 [12..12]                                               */
                                    /* DMA_INTREQ_INTREQSTS12                                                    */
#define  DMA_INTREQ_INTREQSTS12_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS12_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS13 [13..13]                                               */
                                    /* DMA_INTREQ_INTREQSTS13                                                    */
#define  DMA_INTREQ_INTREQSTS13_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS13_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS14 [14..14]                                               */
                                    /* DMA_INTREQ_INTREQSTS14                                                    */
#define  DMA_INTREQ_INTREQSTS14_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS14_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


/*                                               DMA INTREQ INTREQSTS15 [15..15]                                               */
                                     /* DMA_INTREQ_INTREQSTS15                                                    */
#define  DMA_INTREQ_INTREQSTS15_0               0U     /* 0 : The interrupt request for corresponding channel is cleared            */
#define  DMA_INTREQ_INTREQSTS15_1               1U     /* 1 : The interrupt request for corresponding channel is active             */


