MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                  DMA CHESTS EFLG12 [12..12]                                                   */
                                        /* DMA_CHESTS_EFLG12                                                           */
#define  DMA_CHESTS_EFLG12_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG12_1                      1U     /* 1 : An error in this channel has occurred                                 */


/*                                                  DMA CHESTS EFLG13 [13..13]                                                   */
                                        /* DMA_CHESTS_EFLG13                                                           */
#define  DMA_CHESTS_EFLG13_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG13_1                      1U     /* 1 : An error in this channel has occurred                                 */


/*                                                  DMA CHESTS EFLG14 [14..14]                                                   */
                                        /* DMA_CHESTS_EFLG14                                                           */
#define  DMA_CHESTS_EFLG14_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG14_1                      1U     /* 1 : An error in this channel has occurred                                 */


/*                                                  DMA CHESTS EFLG15 [15..15]                                                   */
                                        /* DMA_CHESTS_EFLG15                                                           */
#define  DMA_CHESTS_EFLG15_0                      0U     /* 0 : An error in this channel has not occurred                             */
#define  DMA_CHESTS_EFLG15_1                      1U     /* 1 : An error in this channel has occurred                                 */


/*                                                           HWREQSTS                                                           */
/*                                                 DMA HWREQSTS HREQSTS0 [0..0]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS0                                                      */
#define  DMA_HWREQSTS_HREQSTS0_0                 0U     /* 0 : A hardware service request for channel 0 is not present               */
#define  DMA_HWREQSTS_HREQSTS0_1                 1U     /* 1 : A hardware service request for channel 0 is present                   */


/*                                                 DMA HWREQSTS HREQSTS1 [1..1]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS1                                                      */
#define  DMA_HWREQSTS_HREQSTS1_0                 0U     /* 0 : A hardware service request for channel 1 is not present               */
#define  DMA_HWREQSTS_HREQSTS1_1                 1U     /* 1 : A hardware service request for channel 1 is present                   */


/*                                                 DMA HWREQSTS HREQSTS2 [2..2]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS2                                                      */
#define  DMA_HWREQSTS_HREQSTS2_0                 0U     /* 0 : A hardware service request for channel 2 is not present               */
#define  DMA_HWREQSTS_HREQSTS2_1                 1U     /* 1 : A hardware service request for channel 2 is present                   */


/*                                                 DMA HWREQSTS HREQSTS3 [3..3]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS3                                                      */
#define  DMA_HWREQSTS_HREQSTS3_0                 0U     /* 0 : A hardware service request for channel 3 is not present               */
#define  DMA_HWREQSTS_HREQSTS3_1                 1U     /* 1 : A hardware service request for channel 3 is present                   */


/*                                                 DMA HWREQSTS HREQSTS4 [4..4]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS4                                                      */
#define  DMA_HWREQSTS_HREQSTS4_0                 0U     /* 0 : A hardware service request for channel 4 is not present               */
#define  DMA_HWREQSTS_HREQSTS4_1                 1U     /* 1 : A hardware service request for channel 4 is present                   */


/*                                                 DMA HWREQSTS HREQSTS5 [5..5]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS5                                                      */
#define  DMA_HWREQSTS_HREQSTS5_0                 0U     /* 0 : A hardware service request for channel 5 is not present               */
#define  DMA_HWREQSTS_HREQSTS5_1                 1U     /* 1 : A hardware service request for channel 5 is present                   */


/*                                                 DMA HWREQSTS HREQSTS6 [6..6]                                                 */
                                        /* DMA_HWREQSTS_HREQSTS6                                                      */
#define  DMA_HWREQSTS_HREQSTS6_0                 0U     /* 0 : A hardware service request for channel 6 is not present               */
#define  DMA_HWREQSTS_HREQSTS6_1                 1U     /* 1 : A hardware service request for channel 6 is present                   */


/*                                                 DMA HWREQSTS HREQSTS7 [7..7]                                                 */
                                    /* DMA_HWREQSTS_HREQSTS7                                                      */
#define  DMA_HWREQSTS_HREQSTS7_0                 0U     /* 0 : A hardware service request for channel 7 is not present               */
#define  DMA_HWREQSTS_HREQSTS7_1                 1U     /* 1 : A hardware service request for channel 7 is present                   */


/*                                                 DMA HWREQSTS HREQSTS8 [8..8]                                                 */
                                    /* DMA_HWREQSTS_HREQSTS8                                                      */
#define  DMA_HWREQSTS_HREQSTS8_0                 0U     /* 0 : A hardware service request for channel 8 is not present               */
#define  DMA_HWREQSTS_HREQSTS8_1                 1U     /* 1 : A hardware service request for channel 8 is present                   */


