MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 DMA HWREQSTS HREQSTS9 [9..9]                                                 */
                                    /* DMA_HWREQSTS_HREQSTS9                                                      */
#define  DMA_HWREQSTS_HREQSTS9_0                 0U     /* 0 : A hardware service request for channel 9 is not present               */
#define  DMA_HWREQSTS_HREQSTS9_1                 1U     /* 1 : A hardware service request for channel 9 is present                   */


/*                                               DMA HWREQSTS HREQSTS10 [10..10]                                                */
                                   /* DMA_HWREQSTS_HREQSTS10                                                     */
#define  DMA_HWREQSTS_HREQSTS10_0                0U     /* 0 : A hardware service request for channel 10 is not present              */
#define  DMA_HWREQSTS_HREQSTS10_1                1U     /* 1 : A hardware service request for channel 10 is present                  */


/*                                               DMA HWREQSTS HREQSTS11 [11..11]                                                */
                                     /* DMA_HWREQSTS_HREQSTS11                                                     */
#define  DMA_HWREQSTS_HREQSTS11_0                0U     /* 0 : A hardware service request for channel 11 is not present              */
#define  DMA_HWREQSTS_HREQSTS11_1                1U     /* 1 : A hardware service request for channel 11 is present                  */


/*                                               DMA HWREQSTS HREQSTS12 [12..12]                                                */
                                 /* DMA_HWREQSTS_HREQSTS12                                                     */
#define  DMA_HWREQSTS_HREQSTS12_0                0U     /* 0 : A hardware service request for channel 12 is not present              */
#define  DMA_HWREQSTS_HREQSTS12_1                1U     /* 1 : A hardware service request for channel 12 is present                  */


/*                                               DMA HWREQSTS HREQSTS13 [13..13]                                                */
                                     /* DMA_HWREQSTS_HREQSTS13                                                     */
#define  DMA_HWREQSTS_HREQSTS13_0                0U     /* 0 : A hardware service request for channel 13 is not present              */
#define  DMA_HWREQSTS_HREQSTS13_1                1U     /* 1 : A hardware service request for channel 13 is present                  */


/*                                               DMA HWREQSTS HREQSTS14 [14..14]                                                */
                                    /* DMA_HWREQSTS_HREQSTS14                                                     */
#define  DMA_HWREQSTS_HREQSTS14_0                0U     /* 0 : A hardware service request for channel 14 is not present              */
#define  DMA_HWREQSTS_HREQSTS14_1                1U     /* 1 : A hardware service request for channel 14 is present                  */


/*                                               DMA HWREQSTS HREQSTS15 [15..15]                                                */
                                    /* DMA_HWREQSTS_HREQSTS15                                                     */
#define  DMA_HWREQSTS_HREQSTS15_0                0U     /* 0 : A hardware service request for channel 15 is not present              */
#define  DMA_HWREQSTS_HREQSTS15_1                1U     /* 1 : A hardware service request for channel 15 is present                  */


/*                                                           AREQSEN                                                            */
/*                                                 DMA AREQSEN AREQSEN0 [0..0]                                                  */
                                    /* DMA_AREQSEN_AREQSEN0                                                       */
#define  DMA_AREQSEN_AREQSEN0_0                  0U     /* 0 : Disable asynchronous DMA request for channel 0.                       */
#define  DMA_AREQSEN_AREQSEN0_1                  1U     /* 1 : Enable asynchronous DMA request for channel 0.                        */


/*                                                 DMA AREQSEN AREQSEN1 [1..1]                                                  */
                                     /* DMA_AREQSEN_AREQSEN1                                                       */
#define  DMA_AREQSEN_AREQSEN1_0                  0U     /* 0 : Disable asynchronous DMA request for channel 1                        */
#define  DMA_AREQSEN_AREQSEN1_1                  1U     /* 1 : Enable asynchronous DMA request for channel 1.                        */


/*                                                 DMA AREQSEN AREQSEN2 [2..2]                                                  */
                                    /* DMA_AREQSEN_AREQSEN2                                                       */
#define  DMA_AREQSEN_AREQSEN2_0                  0U     /* 0 : Disable asynchronous DMA request for channel 2.                       */
#define  DMA_AREQSEN_AREQSEN2_1                  1U     /* 1 : Enable asynchronous DMA request for channel 2.                        */


/*                                                 DMA AREQSEN AREQSEN3 [3..3]                                                  */
                            /* DMA_AREQSEN_AREQSEN3                                                       */
#define  DMA_AREQSEN_AREQSEN3_0                  0U     /* 0 : Disable asynchronous DMA request for channel 3.                       */
#define  DMA_AREQSEN_AREQSEN3_1                  1U     /* 1 : Enable asynchronous DMA request for channel 3.                        */


/*                                                 DMA AREQSEN AREQSEN4 [4..4]                                                  */
                              /* DMA_AREQSEN_AREQSEN4                                                       */
#define  DMA_AREQSEN_AREQSEN4_0                  0U     /* 0 : Disable asynchronous DMA request for channel 4.                       */
#define  DMA_AREQSEN_AREQSEN4_1                  1U     /* 1 : Enable asynchronous DMA request for channel 4.                        */


/*                                                 DMA AREQSEN AREQSEN5 [5..5]                                                  */
                              /* DMA_AREQSEN_AREQSEN5                                                       */
#define  DMA_AREQSEN_AREQSEN5_0                  0U     /* 0 : Disable asynchronous DMA request for channel 5.                       */
#define  DMA_AREQSEN_AREQSEN5_1                  1U     /* 1 : Enable asynchronous DMA request for channel 5.                        */


