MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                DMA CHPRI5 BPHPRICHEN [7..7]                                                 */
                                  /* DMA_CHPRI5_BPHPRICHEN                                                     */
#define  DMA_CHPRI5_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                   service request.                                                          */
#define  DMA_CHPRI5_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                       of a higher priority channel.                                             */


/*                                                           CHPRI4                                                            */
/*                                                 DMA CHPRI4 PLPRICHD [6..6]                                                  */
                                   /* DMA_CHPRI4_PLPRICHD                                                       */
#define  DMA_CHPRI4_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI4_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI4 BPHPRICHEN [7..7]                                                 */
                                    /* DMA_CHPRI4_BPHPRICHEN                                                     */
#define  DMA_CHPRI4_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                       service request.                                                          */
#define  DMA_CHPRI4_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                      of a higher priority channel.                                             */


/*                                                           CHPRI11                                                           */
/*                                                 DMA CHPRI11 PLPRICHD [6..6]                                                 */
                                      /* DMA_CHPRI11_PLPRICHD                                                      */
#define  DMA_CHPRI11_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI11_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                     priority.                                                                 */


/*                                                DMA CHPRI11 BPHPRICHEN [7..7]                                                */
                                     /* DMA_CHPRI11_BPHPRICHEN                                                    */
#define  DMA_CHPRI11_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                    service request.                                                          */
#define  DMA_CHPRI11_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                    of a higher priority channel.                                             */


/*                                                           CHPRI10                                                           */
/*                                                 DMA CHPRI10 PLPRICHD [6..6]                                                 */
                                      /* DMA_CHPRI10_PLPRICHD                                                      */
#define  DMA_CHPRI10_PLPRICHD_0                 0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI10_PLPRICHD_1                 1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                        priority.                                                                 */


/*                                                DMA CHPRI10 BPHPRICHEN [7..7]                                                */
                                      /* DMA_CHPRI10_BPHPRICHEN                                                    */
#define  DMA_CHPRI10_BPHPRICHEN_0               0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                         service request.                                                          */
#define  DMA_CHPRI10_BPHPRICHEN_1               1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                       of a higher priority channel.                                             */


/*                                                           CHPRI9                                                            */
/*                                                 DMA CHPRI9 PLPRICHD [6..6]                                                  */
                                  /* DMA_CHPRI9_PLPRICHD                                                       */
#define  DMA_CHPRI9_PLPRICHD_0                  0U     /* 0 : Channel n can suspend a lower priority channel.                       */
#define  DMA_CHPRI9_PLPRICHD_1                  1U     /* 1 : Channel n cannot suspend any channelU regardless of channel
                                                        priority.                                                                 */


/*                                                DMA CHPRI9 BPHPRICHEN [7..7]                                                 */
                                     /* DMA_CHPRI9_BPHPRICHEN                                                     */
#define  DMA_CHPRI9_BPHPRICHEN_0                0U     /* 0 : Channel n cannot be suspended by a higher priority channels
                                                        service request.                                                          */
#define  DMA_CHPRI9_BPHPRICHEN_1                1U     /* 1 : Channel n can be temporarily suspended by the service request
                                                        of a higher priority channel.                                             */


