MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                     TCD_MINBCNT_MINLMD_DMA                                                     */
/*                                                   TCD_SMLOF_MINLMENOFD_DMA                                                   */
/*                                       DMA TCD_SMLOF_MINLMENOFD_DMA DMINLOFEN [30..30]                                        */
                                     /* DMA_TCD_SMLOF_MINLMENOFD_DMA_DMINLOFEN                                     */
#define  DMA_TCD_SMLOF_MINLMENOFD_DMA_DMINLOFEN_0   0U  /* 0 : The minor loop offset is not applied to the DADDR                     */
#define  DMA_TCD_SMLOF_MINLMENOFD_DMA_DMINLOFEN_1   1U  /* 1 : The minor loop offset is applied to the DADDR                         */


/*                                       DMA TCD_SMLOF_MINLMENOFD_DMA SMINLOFEN [31..31]                                        */
                               /* DMA_TCD_SMLOF_MINLMENOFD_DMA_SMINLOFEN                                     */
#define  DMA_TCD_SMLOF_MINLMENOFD_DMA_SMINLOFEN_0   0U  /* 0 : The minor loop offset is not applied to the SADDR                     */
#define  DMA_TCD_SMLOF_MINLMENOFD_DMA_SMINLOFEN_1   1U  /* 1 : The minor loop offset is applied to the SADDR                         */


/*                                                   TCD_SMINLOF_MINLMOFEN_DMA                                                    */
/*                                        DMA TCD_SMINLOF_MINLMOFEN_DMA DMINLOFEN [30..30]                                        */
    /* DMA_TCD_SMINLOF_MINLMOFEN_DMA_DMINLOFEN                                      */
#define  DMA_TCD_SMINLOF_MINLMOFEN_DMA_DMINLOFEN_0   0U   /* 0 : The minor loop offset is not applied to the DADDR                     */
#define  DMA_TCD_SMINLOF_MINLMOFEN_DMA_DMINLOFEN_1   1U   /* 1 : The minor loop offset is applied to the DADDR                         */


/*                                        DMA TCD_SMINLOF_MINLMOFEN_DMA SMINLOFEN [31..31]                                        */
                  /* DMA_TCD_SMINLOF_MINLMOFEN_DMA_SMINLOFEN                                      */
#define  DMA_TCD_SMINLOF_MINLMOFEN_DMA_SMINLOFEN_0   0U   /* 0 : The minor loop offset is not applied to the SADDR                     */
#define  DMA_TCD_SMINLOF_MINLMOFEN_DMA_SMINLOFEN_1   1U   /* 1 : The minor loop offset is applied to the SADDR                         */


/*                                                        TCD_SADDRAV                                                         */
/*                                                         TCD_DADDR                                                          */
/*                                                        TCD_DADDRSOF                                                        */
/*                                                   TCD_CMAJICNT_LINKD_DMA                                                   */
/*                                       DMA TCD_CMAJICNT_LINKD_DMA MINLINKEN [15..15]                                        */
                                  /* DMA_TCD_CMAJICNT_LINKD_DMA_MINLINKEN                                     */
 #define DMA_TCD_CMAJICNT_LINKD_DMA_LINKEN_0   0U  /* 0 : The channel-to-channel linking is disabled                            */
 #define DMA_TCD_CMAJICNT_LINKD_DMA_LINKEN_1   1U  /* 1 : The channel-to-channel linking is enabled                             */


/*                                                 TCD_CMAJICNT_CHLINKEN_DMA                                                  */
/*                                      DMA TCD_CMAJICNT_CHLINKEN_DMA MINLINKEN [15..15]                                      */
                                  /* DMA_TCD_CMAJICNT_CHLINKEN_DMA_MINLINKEN                                  */
#define  DMA_TCD_CMAJICNT_LINKEN_DMA_LINKEN_0   0U/* 0 : The channel-to-channel linking is disabled                           */
#define  DMA_TCD_CMAJICNT_LINKEN_DMA_LINKEN_1   1U/* 1 : The channel-to-channel linking is enabled                            */


/*                                                       TCD_DADDRAVSGA                                                       */
/*                                                          TCD_CSTS                                                          */
/*                                                 DMA TCD_CSTS START [0..0]                                                  */
                                  /* DMA_TCD_CSTS_START                                                       */
#define  DMA_TCD_CSTS_START_0                  0U     /* 0 : The channel is not explicitly started.                                */
#define  DMA_TCD_CSTS_START_1                  1U     /* 1 : The channel is explicitly started via a software initiated
                                                     service request.                                                          */


/*                                                DMA TCD_CSTS MAJICMPIEN [1..1]                                                */
                                  /* DMA_TCD_CSTS_MAJICMPIEN                                                    */
#define  DMA_TCD_CSTS_MAJICMPIEN_0               0U     /* 0 : The end-of-major loop interrupt is disabled.                          */
#define  DMA_TCD_CSTS_MAJICMPIEN_1               1U     /* 1 : The end-of-major loop interrupt is enabled.                           */


/*                                               DMA TCD_CSTS MAJIHCMPIEN [2..2]                                                */
                                  /* DMA_TCD_CSTS_MAJIHCMPIEN                                                   */
#define  DMA_TCD_CSTS_MAJIHCMPIEN_0              0U     /* 0 : The half-point interrupt is disabled.                                 */
#define  DMA_TCD_CSTS_MAJIHCMPIEN_1              1U     /* 1 : The half-point interrupt is enabled.                                  */

/*                                               DMA TCD_CSTS DMAREQD [3..3]                                                */
                                  /* DMA_TCD_CSTS_DMAREQD                                                   */
#define  DMA_TCD_CSTS_DMAREQD_0              0U     /* 0 : The channel's ERQ bit is not affected.                                 */
#define  DMA_TCD_CSTS_DMAREQD_1              1U     /* 1 : The channel's ERQ bit is cleared when the major loop is complete.                                  */

/*                                                 DMA TCD_CSTS SGFEN [4..4]                                                  */
                                      /* DMA_TCD_CSTS_SGFEN                                                       */
#define  DMA_TCD_CSTS_SGFEN_0                  0U     /* 0 : The current channels TCD is normal format.                            */
#define  DMA_TCD_CSTS_SGFEN_1                  1U     /* 1 : The current channels TCD specifies a scatter gather format.
                                                     The DLASTSGA field provides a memory pointer to the next
                                                     TCD to be loaded into this channel after the major loop
                                                     completes its execution.                                                  */

/*                                               DMA TCD_CSTS MAJILINKEN [5..5]                                                */
                                    /* DMA_TCD_CSTS_MAJILINKEN                                                   */
#define  DMA_TCD_CSTS_MAJILINKEN_0              0U     /* 0 : The channel-to-channel linking is disabled.                           */
#define  DMA_TCD_CSTS_MAJILINKEN_1              1U     /* 1 : The channel-to-channel linking is enabled.                            */

