MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                              MPU REGD2_WORD2 SMCTRLM3 [21..22]                                               */
                                 /* MPU_REGD2_WORD2_SMCTRLM3                                                   */
#define  MPU_REGD2_WORD2_SMCTRLM3_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD2_WORD2_SMCTRLM3_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD2_WORD2_SMCTRLM3_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD2_WORD2_SMCTRLM3_11             3U     /* 11 : Same as User mode defined in M3UM                                    */


/*                                                MPU REGD2_WORD2 WENM4 [24..24]                                                */
                                 /* MPU_REGD2_WORD2_WENM4                                                      */
#define  MPU_REGD2_WORD2_WENM4_0                 0U     /* 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
#define  MPU_REGD2_WORD2_WENM4_1                 1U     /* 1 : Bus master 4 writes allowed                                           */


/*                                                MPU REGD2_WORD2 RENM4 [25..25]                                                */
                                 /* MPU_REGD2_WORD2_RENM4                                                      */
#define  MPU_REGD2_WORD2_RENM4_0                 0U     /* 0 : Bus master 4 reads terminate with an access error and the
                                                  read is not performed                                                     */
#define  MPU_REGD2_WORD2_RENM4_1                 1U     /* 1 : Bus master 4 reads allowed                                            */


/*                                                MPU REGD2_WORD2 WENM5 [26..26]                                                */
                                 /* MPU_REGD2_WORD2_WENM5                                                      */
#define  MPU_REGD2_WORD2_WENM5_0                 0U     /* 0 : Bus master 5 writes terminate with an access error and the
                                                    write is not performed                                                    */
#define  MPU_REGD2_WORD2_WENM5_1                 1U     /* 1 : Bus master 5 writes allowed                                           */


/*                                                MPU REGD2_WORD2 RENM5 [27..27]                                                */
                                 /* MPU_REGD2_WORD2_RENM5                                                      */
#define  MPU_REGD2_WORD2_RENM5_0                 0U     /* 0 : Bus master 5 reads terminate with an access error and the
                                                    read is not performed                                                     */
#define  MPU_REGD2_WORD2_RENM5_1                 1U     /* 1 : Bus master 5 reads allowed                                            */


/*                                                MPU REGD2_WORD2 WENM6 [28..28]                                                */
                                 /* MPU_REGD2_WORD2_WENM6                                                      */
#define  MPU_REGD2_WORD2_WENM6_0                 0U     /* 0 : Bus master 6 writes terminate with an access error and the
                                                         write is not performed                                                    */
#define  MPU_REGD2_WORD2_WENM6_1                 1U     /* 1 : Bus master 6 writes allowed                                           */


/*                                                MPU REGD2_WORD2 RENM6 [29..29]                                                */
                                 /* MPU_REGD2_WORD2_RENM6                                                      */
#define  MPU_REGD2_WORD2_RENM6_0                 0U     /* 0 : Bus master 6 reads terminate with an access error and the
                                                   read is not performed                                                     */
#define  MPU_REGD2_WORD2_RENM6_1                 1U     /* 1 : Bus master 6 reads allowed                                            */


/*                                                MPU REGD2_WORD2 WENM7 [30..30]                                                */
                                 /* MPU_REGD2_WORD2_WENM7                                                      */
#define  MPU_REGD2_WORD2_WENM7_0                 0U     /* 0 : Bus master 7 writes terminate with an access error and the
                                                        write is not performed                                                    */
#define  MPU_REGD2_WORD2_WENM7_1                 1U     /* 1 : Bus master 7 writes allowed                                           */


/*                                                MPU REGD2_WORD2 RENM7 [31..31]                                                */
                                 /* MPU_REGD2_WORD2_RENM7                                                      */
#define  MPU_REGD2_WORD2_RENM7_0                 0U     /* 0 : Bus master 7 reads terminate with an access error and the
                                                    read is not performed                                                     */
#define  MPU_REGD2_WORD2_RENM7_1                 1U     /* 1 : Bus master 7 reads allowed                                            */


/*                                                         REGD2_WORD3                                                         */
/*                                                MPU REGD2_WORD3 RDVALID [0..0]                                                */
                                 /* MPU_REGD2_WORD3_RDVALID                                                    */
#define  MPU_REGD2_WORD3_RDVALID_0               0U     /* 0 : Region descriptor is invalid                                          */
#define  MPU_REGD2_WORD3_RDVALID_1               1U     /* 1 : Region descriptor is valid                                            */


/*                                                         REGD3_WORD0                                                         */
/*                                                         REGD3_WORD1                                                         */
/*                                                         REGD3_WORD2                                                         */
/*                                               MPU REGD3_WORD2 SMCTRLM0 [3..4]                                                */
                                 /* MPU_REGD3_WORD2_SMCTRLM0                                                   */
#define  MPU_REGD3_WORD2_SMCTRLM0_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD3_WORD2_SMCTRLM0_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD3_WORD2_SMCTRLM0_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD3_WORD2_SMCTRLM0_11             3U     /* 11 : Same as User mode defined in M0UM                                    */


/*                                                MPU REGD3_WORD2 PIDENM0 [5..5]                                                */
                                 /* MPU_REGD3_WORD2_PIDENM0                                                    */
#define  MPU_REGD3_WORD2_PIDENM0_0               0U     /* 0 : Do not include the process identifier in the evaluation               */
#define  MPU_REGD3_WORD2_PIDENM0_1               1U     /* 1 : Include the process identifier and mask (RGDn.RGDAACC) in
                                                     the region hit evaluation                                                 */


/*                                               MPU REGD3_WORD2 SMCTRLM1 [9..10]                                               */
                                 /* MPU_REGD3_WORD2_SMCTRLM1                                                   */
#define  MPU_REGD3_WORD2_SMCTRLM1_0              0U     /* 0 : r/w/x; readU write and execute allowed                                */
#define  MPU_REGD3_WORD2_SMCTRLM1_1              1U     /* 1 : r/x; read and execute allowedU but no write                           */
#define  MPU_REGD3_WORD2_SMCTRLM1_10             2U     /* 10 : r/w; read and write allowedU but no execute                          */
#define  MPU_REGD3_WORD2_SMCTRLM1_11             3U     /* 11 : Same as User mode defined in M1UM                                    */


