MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 MPU RGDAACC7 RENM4 [25..25]                                                  */
                                 /* MPU_RGDAACC7_RENM4                                                         */
#define  MPU_RGDAACC7_RENM4_0                    0U     /* 0 : Bus master 4 reads terminate with an access error and the
                                                       read is not performed                                                     */
#define  MPU_RGDAACC7_RENM4_1                    1U     /* 1 : Bus master 4 reads allowed                                            */


/*                                                 MPU RGDAACC7 WENM5 [26..26]                                                  */
                                 /* MPU_RGDAACC7_WENM5                                                         */
#define  MPU_RGDAACC7_WENM5_0                    0U     /* 0 : Bus master 5 writes terminate with an access error and the
                                                         write is not performed                                                    */
#define  MPU_RGDAACC7_WENM5_1                    1U     /* 1 : Bus master 5 writes allowed                                           */


/*                                                 MPU RGDAACC7 RENM5 [27..27]                                                  */
                                 /* MPU_RGDAACC7_RENM5                                                         */
#define  MPU_RGDAACC7_RENM5_0                    0U     /* 0 : Bus master 5 reads terminate with an access error and the
                                                   read is not performed                                                     */
#define  MPU_RGDAACC7_RENM5_1                    1U     /* 1 : Bus master 5 reads allowed                                            */


/*                                                 MPU RGDAACC7 WENM6 [28..28]                                                  */
                                 /* MPU_RGDAACC7_WENM6                                                         */
#define  MPU_RGDAACC7_WENM6_0                    0U     /* 0 : Bus master 6 writes terminate with an access error and the
                                                      write is not performed                                                    */
#define  MPU_RGDAACC7_WENM6_1                    1U     /* 1 : Bus master 6 writes allowed                                           */


/*                                                 MPU RGDAACC7 RENM6 [29..29]                                                  */
                                 /* MPU_RGDAACC7_RENM6                                                         */
#define  MPU_RGDAACC7_RENM6_0                    0U     /* 0 : Bus master 6 reads terminate with an access error and the
                                                      read is not performed                                                     */
#define  MPU_RGDAACC7_RENM6_1                    1U     /* 1 : Bus master 6 reads allowed                                            */


/*                                                 MPU RGDAACC7 WENM7 [30..30]                                                  */
                                 /* MPU_RGDAACC7_WENM7                                                         */
#define  MPU_RGDAACC7_WENM7_0                    0U     /* 0 : Bus master 7 writes terminate with an access error and the
                                                       write is not performed                                                    */
#define  MPU_RGDAACC7_WENM7_1                    1U     /* 1 : Bus master 7 writes allowed                                           */


/*                                                 MPU RGDAACC7 RENM7 [31..31]                                                  */
                                 /* MPU_RGDAACC7_RENM7                                                         */
#define MPU_RGDAACC7_RENM7_0                     0U     /* 0 : Bus master 7 reads terminate with an access error and the
                                                 read is not performed                                                     */
#define MP_RGDAACC7_RENM7_1                     1U     /* 1 : Bus master 7 reads allowed                                            */




/*                                                                                                                             */
/*                                                            EREP                                                             */
/*                                                                                                                             */

/*                                                            CFG0                                                             */
/*                                                EREP CFG0 UINTNENM1 [26..26]                                                 */
                                 /* EREP_CFG0_UINTNENM1                                                       */
#define  EREP_CFG0_UINTNENM1_0                  0U     /* 0 : Interrupt notification of Memory 1 non-correctable error
                                                      events is disabled.                                                       */
#define  EREP_CFG0_UINTNENM1_1                  1U     /* 1 : Interrupt notification of Memory 1 non-correctable error
                                                        events is enabled.                                                        */


/*                                                EREP CFG0 SCINTNENM1 [27..27]                                                */
                                 /* EREP_CFG0_SCINTNENM1                                                      */
#define  EREP_CFG0_SCINTNENM1_0                 0U     /* 0 : Interrupt notification of Memory 1 single-bit correction
                                                        events is disabled.                                                       */
#define  EREP_CFG0_SCINTNENM1_1                 1U     /* 1 : Interrupt notification of Memory 1 single-bit correction
                                                        events is enabled.                                                        */


/*                                                EREP CFG0 UINTNENM0 [30..30]                                                 */
                                 /* EREP_CFG0_UINTNENM0                                                       */
#define  EREP_CFG0_UINTNENM0_0                  0U     /* 0 : Interrupt notification of Memory 0 non-correctable error
                                                      events is disabled.                                                       */
#define  EREP_CFG0_UINTNENM0_1                  1U     /* 1 : Interrupt notification of Memory 0 non-correctable error
                                                       events is enabled.                                                        */


/*                                                EREP CFG0 SCINTNENM0 [31..31]                                                */
                                 /* EREP_CFG0_SCINTNENM0                                                      */
#define  EREP_CFG0_SCINTNENM0_0                 0U     /* 0 : Interrupt notification of Memory 0 single-bit correction
                                                        events is disabled.                                                       */
#define  EREP_CFG0_SCINTNENM0_1                 1U     /* 1 : Interrupt notification of Memory 0 single-bit correction
                                                       events is enabled.                                                        */


/*                                                             STS0                                                             */
/*                                                  EREP STS0 UEFLGM1 [26..26]                                                  */
                                 /* EREP_SRS0_UEFLGM1                                                          */
#define  EREP_SRS0_UEFLGM1_0                     0U     /* 0 : No non-correctable error event on Memory 1 detected                   */
#define  EREP_SRS0_UEFLGM1_1                     1U     /* 1 : Non-correctable error event on Memory 1 detected                      */


