MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/*                                                 EREP STS0 SBCFLGM1 [27..27]                                                  */
                                 /* EREP_SRS0_SBCFLGM1                                                         */
#define  EREP_SRS0_SBCFLGM1_0                    0U     /* 0 : No single-bit correction event on Memory 1 detected                   */
#define  EREP_SRS0_SBCFLGM1_1                    1U     /* 1 : Single-bit correction event on Memory 1 detected                      */


/*                                                  EREP STS0 UEFLGM0 [30..30]                                                  */
                                 /* EREP_SRS0_UEFLGM0                                                          */
#define  EREP_SRS0_UEFLGM0_0                     0U     /* 0 : No non-correctable error event on Memory 0 detected                   */
#define  EREP_SRS0_UEFLGM0_1                     1U     /* 1 : Non-correctable error event on Memory 0 detected                      */


/*                                                 EREP STS0 SBCFLGM0 [31..31]                                                  */
                                 /* EREP_SRS0_SBCFLGM0                                                         */
#define  EREP_SRS0_SBCFLGM0_0                    0U     /* 0 : No single-bit correction event on Memory 0 detected                   */
#define  EREP_SRS0_SBCFLGM0_1                    1U     /* 1 : Single-bit correction event on Memory 0 detected                      */


/* ========================================================  EADDR0  ========================================================= */
/* ========================================================  EADDR1  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           EINJ                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/*                                                   EINJ CFG GEINJEN [0..0]                                                   */
                                  /* EINJ_CFG_GEINJEN                                                          */
#define  EINJ_CFG_GEINJEN_0                     0U     /* 0 : Disabled                                                              */
#define  EINJ_CFG_GEINJEN_1                     1U     /* 1 : Enabled                                                               */


/*                                                            CHEN                                                             */
/*                                                EINJ CHEN EINJENCH1 [30..30]                                                 */
                                  /* EINJ_CHEN_EINJENCH1                                                       */
#define  EINJ_CHEN_EINJENCH1_0                  0U     /* 0 : Error injection is disabled on Error Injection Channel 1              */
#define  EINJ_CHEN_EINJENCH1_1                  1U     /* 1 : Error injection is enabled on Error Injection Channel 1               */


/*                                                EINJ CHEN EINJENCH0 [31..31]                                                 */
                                  /* EINJ_CHEN_EINJENCH0                                                       */
#define  EINJ_CHEN_EINJENCH0_0                  0U     /* 0 : Error injection is disabled on Error Injection Channel 0              */
#define  EINJ_CHEN_EINJENCH0_1                  1U     /* 1 : Error injection is enabled on Error Injection Channel 0               */


/* ======================================================  CHD0_WORD0  ======================================================= */
/* ======================================================  CHD0_WORD1  ======================================================= */
/* ======================================================  CHD1_WORD0  ======================================================= */
/* ======================================================  CHD1_WORD1  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  STS  ========================================================== */
/* ===============================================  FLASH STS PROVFLG [4..4]  ================================================ */
                                  /* FLASH_STS_PROVFLG                                                         */
#define  FLASH_STS_PROVFLG_0                    0U     /* 0 : No protection violation detected                                      */
#define  FLASH_STS_PROVFLG_1                    1U     /* 1 : Protection violation detected                                         */


/* ===============================================  FLASH STS ACCEFLG [5..5]  ================================================ */
                                  /* FLASH_STS_ACCEFLG                                                         */
#define  FLASH_STS_ACCEFLG_0                    0U     /* 0 : No access error detected                                              */
#define  FLASH_STS_ACCEFLG_1                    1U     /* 1 : Access error detected                                                 */


/* ===============================================  FLASH STS COLEFLG [6..6]  ================================================ */
                                  /* FLASH_STS_COLEFLG                                                         */
#define  FLASH_STS_COLEFLG_0                    0U     /* 0 : No collision error detected                                           */
#define  FLASH_STS_COLEFLG_1                    1U     /* 1 : Collision error detected                                              */


/* ==========================================================  CFG  ========================================================== */
/* ==============================================  FLASH CFG ERACMDSUS [4..4]  =============================================== */
                                  /* FLASH_CFG_ERACMDSUS                                                       */
#define  FLASH_CFG_ERACMDSUS_0                  0U     /* 0 : No suspend requested                                                  */
#define  FLASH_CFG_ERACMDSUS_1                  1U     /* 1 : Suspend the current Erase Flash Sector command execution              */


/* ===============================================  FLASH CFG ERAABREQ [5..5]  =============================================== */
                                  /* FLASH_CFG_ERAABREQ                                                        */
#define  FLASH_CFG_ERAABREQ_0                   0U     /* 0 : No request or request complete                                        */


/* ===============================================  FLASH CFG RCOLEIEN [6..6]  =============================================== */
                                  /* FLASH_CFG_RCOLEIEN                                                        */
#define  FLASH_CFG_RCOLEIEN_0                   0U     /* 0 : Read collision error interrupt disabled                               */
#define  FLASH_CFG_RCOLEIEN_1                   1U     /* 1 : Read collision error interrupt enabled. An interrupt request
                                                     is generated whenever an FTFC read collision error is detected
                                                     (see the description of FSTAT[RDCOLERR]).                                 */

/* ===============================================  FLASH CFG CMDCIEN [7..7]  ================================================ */
                                  /* FLASH_CFG_CMDCIEN                                                         */
#define  FLASH_CFG_CMDCIEN_0                    0U     /* 0 : Command complete interrupt disabled                                   */
#define  FLASH_CFG_CMDCIEN_1                    1U     /* 1 : Command complete interrupt enabled. An interrupt request
                                                     is generated whenever the STS[OCIFLG] flag is set.                        */


/* ==========================================================  SEC  ========================================================== */
/* ===============================================  FLASH SEC SECFLG [0..1]  ================================================ */
                                  /* FLASH_SEC_SECFLG                                                         */
#define  FLASH_SEC_SECFLG_10                  2U     /* 10 : MCU security status is unsecure (The standard shipping
                                                         condition of the FTFC is unsecure.)                                       */


/* ===============================================  FLASH SEC FCACCEN [2..3]  ================================================ */
                                  /* FLASH_SEC_FCACCEN                                                         */
#define  FLASH_SEC_FCACCEN_00                   0U     /* 00 : Factory access granted                                               */
#define  FLASH_SEC_FCACCEN_11                   3U     /* 11 : Factory access granted                                               */


/* ================================================  FLASH SEC MERAEN [4..5]  ================================================ */
                                  /* FLASH_SEC_MERAEN                                                          */
#define  FLASH_SEC_MERAEN_00                    0U     /* 00 : Mass erase is enabled                                                */
#define  FLASH_SEC_MERAEN_01                    1U     /* 01 : Mass erase is enabled                                                */
#define  FLASH_SEC_MERAEN_11                    3U     /* 11 : Mass erase is enabled                                                */


/* ==============================================  FLASH SEC BKEYACCEN [6..7]  =============================================== */
                                  /* FLASH_SEC_BKEYACCEN                                                       */
#define  FLASH_SEC_BKEYACCEN_00                 0U     /* 00 : Backdoor key access disabled                                         */
#define  FLASH_SEC_BKEYACCEN_01                 1U     /* 01 : Backdoor key access disabled (preferred KEYEN state to
                                                     disable backdoor key access)                                              */
#define  FLASH_SEC_BKEYACCEN_10                 2U     /* 10 : Backdoor key access enabled                                          */
#define  FLASH_SEC_BKEYACCEN_11                 3U     /* 11 : Backdoor key access disabled                                         */


/* ==========================================================  NOPT  ========================================================== */
/* =======================================================  CCMDDATA3  ======================================================= */
/* =======================================================  CCMDDATA2  ======================================================= */
/* =======================================================  CCMDDATA1  ======================================================= */
/* =======================================================  CCMDDATA0  ======================================================= */
/* =======================================================  CCMDDATA7  ======================================================= */
/* =======================================================  CCMDDATA6  ======================================================= */
/* =======================================================  CCMDDATA5  ======================================================= */
/* =======================================================  CCMDDATA4  ======================================================= */
/* =======================================================  CCMDDATAB  ======================================================= */
/* =======================================================  CCMDDATAA  ======================================================= */
/* =======================================================  CCMDDATA9  ======================================================= */
/* =======================================================  CCMDDATA8  ======================================================= */
/* ========================================================  PFPRO3  ========================================================= */
/* ========================================================  PFPRO2  ========================================================= */
/* ========================================================  PFPRO1  ========================================================= */
/* ========================================================  PFPRO0  ========================================================= */
/* ========================================================  EEPRO  ========================================================= */
/* ========================================================  DFPRO  ======================================================== */
/* =============================================  FLASH DFPRO DFPRO [0..7]  ============================================== */
                                 /* FLASH_DFLASHPRO_DFLASHPRO                                                    */
#define  FLASH_DFLASHPRO_DFLASHPRO_00000000         0U     /* 00000000 : Data Flash region is protected                                 */
#define  FLASH_DFLASHPRO_DFLASHPRO_00000001         1U     /* 00000001 : Data Flash region is not protected                             */


