MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  CAN MCFG SRD [17..17]  ================================================= */
                                  /* CAN_MCFG_SRD                                                             */
#define  CAN_MCFG_SRD_0                        0U     /* 0 : Self reception enabled.                                               */
#define  CAN_MCFG_SRD_1                        1U     /* 1 : Self reception disabled.                                              */


/* ================================================  CAN MCFG LPM [20..20]  ================================================= */
                                  /* CAN_MCFG_LPM                                                             */
#define  CAN_MCFG_LPM_0                        0U     /* 0 : CAN is not in a low-power mode.                                   */
#define  CAN_MCFG_LPM_1                        1U     /* 1 : CAN is in a low-power mode.                                       */


/* ================================================  CAN MCFG WIEN [21..21]  ================================================ */
                                  /* CAN_MCFG_WIEN                                                            */
#define  CAN_MCFG_WIEN_0                       0U     /* 0 : TWRNINT and RWRNINT bits are zeroU independent of the values
                                                         in the error counters.                                                    */
#define  CAN_MCFG_WIEN_1                       1U     /* 1 : TWRNINT and RWRNINT bits are set when the respective error
                                                        counter transitions from less than 96 to greater than or
                                                     equal to 96.                                                              */


/* ===============================================  CAN MCFG FRZFLG [24..24]  =============================================== */
                                  /* CAN_MCFG_FRZFLG                                                          */
#define  CAN_MCFG_FRZFLG_0                     0U     /* 0 : CAN not in Freeze modeU prescaler running.                        */
#define  CAN_MCFG_FRZFLG_1                     1U     /* 1 : CAN in Freeze modeU prescaler stopped.                            */


/* ===============================================  CAN MCFG CANRST [25..25]  =============================================== */
                                  /* CAN_MCFG_CANRST                                                          */
#define  CAN_MCFG_CANRST_0                     0U     /* 0 : No reset request.                                                     */
#define  CAN_MCFG_CANRST_1                     1U     /* 1 : Resets the registers affected by soft reset.                          */


/* ===============================================  CAN MCFG NRDY [27..27]  ================================================ */
                                  /* CAN_MCFG_NRDY                                                           */
#define  CAN_MCFG_NRDY_0                      0U     /* 0 : CAN module is either in Normal modeU Listen-Only mode
                                                     or Loop-Back mode.                                                        */


/* ================================================  CAN MCFG EFRZ [28..28]  ================================================ */
                                  /* CAN_MCFG_EFRZ                                                            */
#define  CAN_MCFG_EFRZ_0                       0U     /* 0 : No Freeze mode request.                                               */
#define  CAN_MCFG_EFRZ_1                       1U     /* 1 : Enters Freeze mode if the FRZ bit is asserted.                        */


/* ===============================================  CAN MCFG FIFOEN [29..29]  =============================================== */
                                  /* CAN_MCFG_FIFOEN                                                          */
#define  CAN_MCFG_FIFOEN_0                     0U     /* 0 : Rx FIFO not enabled.                                                  */
#define  CAN_MCFG_FIFOEN_1                     1U     /* 1 : Rx FIFO enabled.                                                      */


/* ===============================================  CAN MCFG FRZEN [30..30]  ================================================ */
                                  /* CAN_MCFG_FRZEN                                                           */
#define  CAN_MCFG_FRZEN_0                      0U     /* 0 : Not enabled to enter Freeze mode.                                     */
#define  CAN_MCFG_FRZEN_1                      1U     /* 1 : Enabled to enter Freeze mode.                                         */


/* ================================================  CAN MCFG CMD [31..31]  ================================================= */
                                  /* CAN_MCFG_CMD                                                             */
#define  CAN_MCFG_CMD_0                        0U     /* 0 : Enable the CAN module.                                            */
#define  CAN_MCFG_CMD_1                        1U     /* 1 : Disable the CAN module.                                           */


/* =========================================================  CTRL1  ========================================================= */
/* ================================================  CAN CTRL1 PTS [0..0]  ================================================= */
                                  /* CAN_CTRL1_PTS                                                           */
#define  CAN_CTRL1_PTS_0                      0U     /* 0 : the length of the propagation segment in the bit time is 0.    */
#define  CAN_CTRL1_PTS_1                      1U     /* 1 : the length of the propagation segment in the bit time is 1.    */
#define  CAN_CTRL1_PTS_2                      2U     /* 2 : the length of the propagation segment in the bit time is 2.    */
#define  CAN_CTRL1_PTS_3                      3U     /* 4 : the length of the propagation segment in the bit time is 3.    */
#define  CAN_CTRL1_PTS_4                      4U     /* 4 : the length of the propagation segment in the bit time is 4.    */
#define  CAN_CTRL1_PTS_5                      5U     /* 5 : the length of the propagation segment in the bit time is 5.    */
#define  CAN_CTRL1_PTS_6                      6U     /* 6 : the length of the propagation segment in the bit time is 6.    */
#define  CAN_CTRL1_PTS_7                      7U     /* 7 : the length of the propagation segment in the bit time is 7.    */

