MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  CAN ERRFLG1 BOFLG [2..2]  =============================================== */
                                 /* CAN_ERRFLG1_BOFLG                                                        */
#define  CAN_ERRFLG1_BOFLG_0                   0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_BOFLG_1                   1U     /* 1 : CAN module entered Bus Off state.                                 */


/* =========                                        CAN ERRFLG1 RXFLG [3..3]                                                  */
                                 /* CAN_ERRFLG1_RXFLG                                                        */
#define  CAN_ERRFLG1_RXFLG_0                   0U     /* 0 : CAN is not receiving a message.                                   */
#define  CAN_ERRFLG1_RXFLG_1                   1U     /* 1 : CAN is receiving a message.                                       */


/* ===============================================  CAN ERRFLG1 FCFLG [4..5]  ================================================ */
                                 /* CAN_ERRFLG1_FCFLG                                                         */
#define  CAN_ERRFLG1_FCFLG_00                   0U     /* 00 : Error Active                                                         */
#define  CAN_ERRFLG1_FCFLG_01                   1U     /* 01 : Error Passive                                                        */
#define  CAN_ERRFLG1_FCFLG_1x_2                 2U     /* 1x_2 : Bus Off                                                            */
#define  CAN_ERRFLG1_FCFLG_1x_3                 3U     /* 1x_3 : Bus Off                                                            */


/* ===============================================  CAN ERRFLG1 TXFLG [6..6]  =============================================== */
                                 /* CAN_ERRFLG1_TXFLG                                                        */
#define  CAN_ERRFLG1_TXFLG_0                   0U     /* 0 : CAN is not transmitting a message.                                */
#define  CAN_ERRFLG1_TXFLG_1                   1U     /* 1 : CAN is transmitting a message.                                    */


/* ===============================================  CAN ERRFLG1 BIDLEFLG [7..7]  =============================================== */
                                 /* CAN_ERRFLG1_BIDLEFLG                                                        */
#define  CAN_ERRFLG1_BIDLEFLG_0                   0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_BIDLEFLG_1                   1U     /* 1 : CAN bus is now IDLE.                                                  */


/* ===============================================  CAN ERRFLG1 RXERRWFLG [8..8]  ================================================ */
                                 /* CAN_ERRFLG1_RXERRWFLG                                                         */
#define  CAN_ERRFLG1_RXERRWFLG_0                    0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_RXERRWFLG_1                    1U     /* 1 : RXERRCNT is greater than or equal to 96.                              */


/* ===============================================  CAN ERRFLG1 TXERRWFLG [9..9]  ================================================ */
                                 /* CAN_ERRFLG1_TXERRWFLG                                                         */
#define  CAN_ERRFLG1_TXERRWFLG_0                    0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_TXERRWFLG_1                    1U     /* 1 : TXERRCNT is greater than or equal to 96.                              */


/* =============================================  CAN ERRFLG1 SERRFLG [10..10]  ============================================= */
                                 /* CAN_ERRFLG1_SERRFLG                                                      */
#define  CAN_ERRFLG1_SERRFLG_0                 0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_SERRFLG_1                 1U     /* 1 : A Stuffing Error occurred since last read of this register.           */


/* =============================================  CAN ERRFLG1 FERRFLG [11..11]  ============================================= */
                                 /* CAN_ERRFLG1_FERRFLG                                                      */
#define  CAN_ERRFLG1_FERRFLG_0                 0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_FERRFLG_1                 1U     /* 1 : A Form Error occurred since last read of this register.               */


/* ============================================  CAN ERRFLG1 CRCERRFLG [12..12]  ============================================ */
                                 /* CAN_ERRFLG1_CRCERRFLG                                                    */
#define  CAN_ERRFLG1_CRCERRFLG_0               0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_CRCERRFLG_1               1U     /* 1 : A CRC error occurred since last read of this register.                */


/* ============================================  CAN ERRFLG1 ACKERRFLG [13..13]  ============================================ */
                                 /* CAN_ERRFLG1_ACKERRFLG                                                    */
#define  CAN_ERRFLG1_ACKERRFLG_0               0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_ACKERRFLG_1               1U     /* 1 : An ACK error occurred since last read of this register.               */


/* ============================================  CAN ERRFLG1 B0ERRFLG [14..14]  ============================================= */
                                 /* CAN_ERRFLG1_B0ERRFLG                                                     */
#define  CAN_ERRFLG1_B0ERRFLG_0                0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_B0ERRFLG_1                1U     /* 1 : At least one bit sent as dominant is received as recessive.           */


/* ============================================  CAN ERRFLG1 B1ERRFLG [15..15]  ============================================= */
                                 /* CAN_ERRFLG1_B1ERRFLG                                                     */
#define  CAN_ERRFLG1_B1ERRFLG_0                0U     /* 0 : No such occurrence.                                                   */
#define  CAN_ERRFLG1_B1ERRFLG_1                1U     /* 1 : At least one bit sent as recessive is received as dominant.           */


