MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  CAN IFLG MB5INT [5..5]  ================================================ */
                                 /* CAN_IFLG_MB5INT                                                          */
#define  CAN_IFLG_MB5INT_0                     0U     /* 0 : No occurrence of MB5 completing transmission/reception when
                                                 MCR[RFEN] 0U or of frame(s) available in the FIFOU when
                                                     MCR[RFEN] 1                                                               */
#define  CAN_IFLG_MB5INT_1                     1U     /* 1 : MB5 completed transmission/reception when MCR[RFEN] 0U or
                                                 frame(s) available in the Rx FIFO when MCR[RFEN] 1. It
                                                     generates a DMA request in case of MCR[RFEN] and MCR[DMA]
                                                     are enabled.                                                              */


/* ================================================  CAN IFLG MB6INT [6..6]  ================================================ */
                                 /* CAN_IFLG_MB6INT                                                          */
#define  CAN_IFLG_MB6INT_0                     0U     /* 0 : No occurrence of MB6 completing transmission/reception when
                                                        MCR[RFEN] 0U or of Rx FIFO almost full when MCR[RFEN] 1                   */
#define  CAN_IFLG_MB6INT_1                     1U     /* 1 : MB6 completed transmission/reception when MCR[RFEN] 0U or
                                                         Rx FIFO almost full when MCR[RFEN] 1                                      */


/* ================================================  CAN IFLG MB7INT [7..7]  ================================================ */
                                 /* CAN_IFLG_MB7INT                                                          */
#define  CAN_IFLG_MB7INT_0                     0U     /* 0 : No occurrence of MB7 completing transmission/reception when
                                                       MCR[RFEN] 0U or of Rx FIFO overflow when MCR[RFEN] 1                      */
#define  CAN_IFLG_MB7INT_1                     1U     /* 1 : MB7 completed transmission/reception when MCR[RFEN] 0U or
                                                      Rx FIFO overflow when MCR[RFEN] 1                                         */


/* =========================================================  CTRL2  ========================================================= */
/* ================================================  CAN CTRL2 EFD [11..11]  ================================================ */
                                 /* CAN_CTRL2_EFD                                                            */
#define  CAN_CTRL2_EFD_0                       0U     /* 0 : Edge Filter is enabled.                                               */
#define  CAN_CTRL2_EFD_1                       1U     /* 1 : Edge Filter is disabled.                                              */


/* ==============================================  CAN CTRL2 ISOFDEN [12..12]  ============================================== */
                                 /* CAN_CTRL2_ISOFDEN                                                        */
#define  CAN_CTRL2_ISOFDEN_0                   0U     /* 0 : CAN operates using the non-ISO CAN FD protocol.                   */
#define  CAN_CTRL2_ISOFDEN_1                   1U     /* 1 : CAN operates using the ISO CAN FD protocol (ISO 11898-1).         */


/* ===============================================  CAN CTRL2 PEEN [14..14]  ================================================ */
                                 /* CAN_CTRL2_PEEN                                                           */
#define  CAN_CTRL2_PEEN_0                      0U     /* 0 : Protocol Exception is disabled.                                       */
#define  CAN_CTRL2_PEEN_1                      1U     /* 1 : Protocol Exception is enabled.                                        */


/* ==============================================  CAN CTRL2 TMRSRC [15..15]  =============================================== */
                                 /* CAN_CTRL2_TMRSRC                                                         */
#define  CAN_CTRL2_TMRSRC_0                    0U     /* 0 : The Free Running Timer is clocked by the CAN bit clockU
                                                      which defines the baud rate on the CAN bus.                               */
#define  CAN_CTRL2_TMRSRC_1                    1U     /* 1 : The Free Running Timer is clocked by an external time tick.
                                                      The period can be either adjusted to be equal to the baud
                                                     rate on the CAN busU or a different value as required.
                                                     See the device specific section for details about the external
                                                     time tick.                                                                */


/* ===============================================  CAN CTRL2 CMPEN [16..16]  =============================================== */
                                 /* CAN_CTRL2_CMPEN                                                          */
#define  CAN_CTRL2_CMPEN_0                     0U     /* 0 : Rx Mailbox filters IDE bit is always compared and RTR is
                                                      never compared despite mask bits.                                         */
#define  CAN_CTRL2_CMPEN_1                     1U     /* 1 : Enables the comparison of both Rx Mailbox filters IDE and
                                                        RTR bit with their corresponding bits within the incoming
                                                     frame. Mask bits do apply.                                                */


/* ================================================  CAN CTRL2 RFS [17..17]  ================================================ */
                                 /* CAN_CTRL2_RFS                                                            */
#define  CAN_CTRL2_RFS_0                       0U     /* 0 : Remote Response Frame is generated.                                   */
#define  CAN_CTRL2_RFS_1                       1U     /* 1 : Remote Request Frame is stored.                                       */


/* ===============================================  CAN CTRL2 MBPRI [18..18]  =============================================== */
                                 /* CAN_CTRL2_MBPRI                                                          */
#define  CAN_CTRL2_MBPRI_0                     0U     /* 0 : Matching starts from Rx FIFO and continues on Mailboxes.              */
#define  CAN_CTRL2_MBPRI_1                     1U     /* 1 : Matching starts from Mailboxes and continues on Rx FIFO.              */


