MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  CAN PNCTRL1 WUTEN [17..17]  ============================================== */
                                 /* CAN_PNCTRL1_WUTEN                                                        */
#define  CAN_PNCTRL1_WUTEN_0                   0U     /* 0 : Timeout wake up event is disabled                                     */
#define  CAN_PNCTRL1_WUTEN_1                   1U     /* 1 : Timeout wake up event is enabled                                      */



/* ========================================================  PNCTRL2  ======================================================== */
/* =========================================================  PNWM  ========================================================== */
/* ===============================================  CAN PNWM WUMFLG [16..16]  =============================================== */
                                 /* CAN_PNWM_WUMFLG                                                          */
#define  CAN_PNWM_WUMFLG_0                     0U     /* 0 : No wake up by match event detected                                    */
#define  CAN_PNWM_WUMFLG_1                     1U     /* 1 : Wake up by match event detected                                       */


/* ===============================================  CAN PNWM WUTFLG [17..17]  =============================================== */
                                 /* CAN_PNWM_WUTFLG                                                          */
#define  CAN_PNWM_WUTFLG_0                     0U     /* 0 : No wake up by timeout event detected                                  */
#define  CAN_PNWM_WUTFLG_1                     1U     /* 1 : Wake up by timeout event detected                                     */


/* ========================================================  PNIDF1  ========================================================= */
/* ===============================================  CAN PNIDF1 RFF [29..29]  ================================================ */
                                 /* CAN_PNIDF1_RFF                                                           */
#define  CAN_PNIDF1_RFF_0                      0U     /* 0 : Reject remote frame (accept data frame)                               */
#define  CAN_PNIDF1_RFF_1                      1U     /* 1 : Accept remote frame                                                   */


/* ===============================================  CAN PNIDF1 EXFF [30..30]  =============================================== */
                                 /* CAN_PNIDF1_EXFF                                                          */
#define  CAN_PNIDF1_EXFF_0                     0U     /* 0 : Accept standard frame format                                          */
#define  CAN_PNIDF1_EXFF_1                     1U     /* 1 : Accept extended frame format                                          */


/* ========================================================  PNDLCF  ========================================================= */
/* ========================================================  PNPLF1  ========================================================= */
/* ========================================================  PNPHF1  ========================================================= */
/* ========================================================  PNIDF2  ========================================================= */
/* ==============================================  CAN PNIDF2 RFMASK [29..29]  ============================================== */
                                 /* CAN_PNIDF2_RFMASK                                                        */
#define  CAN_PNIDF2_RFMASK_0                   0U     /* 0 : The corresponding bit in the filter is 'dont care'                    */
#define  CAN_PNIDF2_RFMASK_1                   1U     /* 1 : The corresponding bit in the filter is checked                        */


/* =============================================  CAN PNIDF2 EXFMASK [30..30]  ============================================== */
                                 /* CAN_PNIDF2_EXFMASK                                                       */
#define  CAN_PNIDF2_EXFMASK_0                  0U     /* 0 : The corresponding bit in the filter is 'dont care'                    */
#define  CAN_PNIDF2_EXFMASK_1                  1U     /* 1 : The corresponding bit in the filter is checked                        */


/* ========================================================  PNPLF2  ========================================================= */
/* ========================================================  PNPHF2  ========================================================= */
/* ========================================================  WMB0_CS  ======================================================== */
/* ===============================================  CAN WMB0_CS RTR [20..20]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB0_CS_RTR                                            */
#define  CAN_WMB_CS_WMB_CS_WMB0_CS_RTR_0       0U     /* 0 : Frame is data one (not remote)                                        */
#define  CAN_WMB_CS_WMB_CS_WMB0_CS_RTR_1       1U     /* 1 : Frame is a remote one                                                 */


/* ===============================================  CAN WMB0_CS IDE [21..21]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB0_CS_IDE                                            */
#define  CAN_WMB_CS_WMB_CS_WMB0_CS_IDE_0       0U     /* 0 : Frame format is standard                                              */
#define  CAN_WMB_CS_WMB_CS_WMB0_CS_IDE_1       1U     /* 1 : Frame format is extended                                              */


/* ========================================================  WMB1_CS  ======================================================== */
/* ===============================================  CAN WMB1_CS RTR [20..20]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB1_CS_RTR                                            */
#define  CAN_WMB_CS_WMB_CS_WMB1_CS_RTR_0       0U     /* 0 : Frame is data one (not remote)                                        */
#define  CAN_WMB_CS_WMB_CS_WMB1_CS_RTR_1       1U     /* 1 : Frame is a remote one                                                 */


/* ===============================================  CAN WMB1_CS IDE [21..21]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB1_CS_IDE                                            */
#define  CAN_WMB_CS_WMB_CS_WMB1_CS_IDE_0       0U     /* 0 : Frame format is standard                                              */
#define  CAN_WMB_CS_WMB_CS_WMB1_CS_IDE_1       1U     /* 1 : Frame format is extended                                              */


/* ========================================================  WMB2_CS  ======================================================== */
/* ===============================================  CAN WMB2_CS RTR [20..20]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB2_CS_RTR                                            */
#define  CAN_WMB_CS_WMB_CS_WMB2_CS_RTR_0       0U     /* 0 : Frame is data one (not remote)                                        */
#define  CAN_WMB_CS_WMB_CS_WMB2_CS_RTR_1       1U     /* 1 : Frame is a remote one                                                 */


/* ===============================================  CAN WMB2_CS IDE [21..21]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB2_CS_IDE                                            */
#define  CAN_WMB_CS_WMB_CS_WMB2_CS_IDE_0       0U     /* 0 : Frame format is standard                                              */
#define  CAN_WMB_CS_WMB_CS_WMB2_CS_IDE_1       1U     /* 1 : Frame format is extended                                              */


