MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ========================================================  WMB3_CS  ======================================================== */
/* ===============================================  CAN WMB3_CS RTR [20..20]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB3_CS_RTR                                            */
#define  CAN_WMB_CS_WMB_CS_WMB3_CS_RTR_0       0U     /* 0 : Frame is data one (not remote)                                        */
#define  CAN_WMB_CS_WMB_CS_WMB3_CS_RTR_1       1U     /* 1 : Frame is a remote one                                                 */


/* ===============================================  CAN WMB3_CS IDE [21..21]  =============================================== */
                                 /* CAN_WMB_CS_WMB_CS_WMB3_CS_IDE                                            */
#define  CAN_WMB_CS_WMB_CS_WMB3_CS_IDE_0       0U     /* 0 : Frame format is standard                                              */
#define  CAN_WMB_CS_WMB_CS_WMB3_CS_IDE_1       1U     /* 1 : Frame format is extended                                              */


/* ========================================================  WMB0_ID  ======================================================== */
/* ========================================================  WMB1_ID  ======================================================== */
/* ========================================================  WMB2_ID  ======================================================== */
/* ========================================================  WMB3_ID  ======================================================== */
/* ======================================================  WMB0_LDATA  ====================================================== */
/* ======================================================  WMB1_LDATA  ====================================================== */
/* ======================================================  WMB2_LDATA  ====================================================== */
/* ======================================================  WMB3_LDATA  ====================================================== */
/* ======================================================  WMB0_HDATA  ====================================================== */
/* ======================================================  WMB1_HDATA  ====================================================== */
/* ======================================================  WMB2_HDATA  ====================================================== */
/* ======================================================  WMB3_HDATA  ====================================================== */
/* ========================================================  FDCTRL  ========================================================= */
/* ===============================================  CAN FDCTRL TDCF [14..14]  =============================================== */
                                 /* CAN_FDCTRL_TDCF                                                          */
#define  CAN_FDCTRL_TDCF_0                     0U     /* 0 : Measured loop delay is in range.                                      */
#define  CAN_FDCTRL_TDCF_1                     1U     /* 1 : Measured loop delay is out of range.                                  */


/* ==============================================  CAN FDCTRL TDCEN [15..15]  =============================================== */
                                 /* CAN_FDCTRL_TDCEN                                                         */
#define  CAN_FDCTRL_TDCEN_0                    0U     /* 0 : TDC is disabled                                                       */
#define  CAN_FDCTRL_TDCEN_1                    1U     /* 1 : TDC is enabled                                                        */


/* ==============================================  CAN FDCTRL MBSIZE [16..17]  ============================================== */
                                 /* CAN_FDCTRL_MBSIZE                                                        */
#define  CAN_FDCTRL_MBSIZE_00                  0U     /* 00 : Selects 8 bytes per Message Buffer.                                  */
#define  CAN_FDCTRL_MBSIZE_01                  1U     /* 01 : Selects 16 bytes per Message Buffer.                                 */
#define  CAN_FDCTRL_MBSIZE_10                  2U     /* 10 : Selects 32 bytes per Message Buffer.                                 */
#define  CAN_FDCTRL_MBSIZE_11                  3U     /* 11 : Selects 64 bytes per Message Buffer.                                 */


/* ==============================================  CAN FDCTRL BRSEN [31..31]  =============================================== */
                                 /* CAN_FDCTRL_BRSEN                                                         */
#define  CAN_FDCTRL_BRSEN_0                    0U     /* 0 : Transmit a frame in nominal rate. The BRS bit in the Tx
                                                         MB has no effect.                                                         */
#define  CAN_FDCTRL_BRSEN_1                    1U     /* 1 : Transmit a frame with bit rate switching if the BRS bit
                                                         in the Tx MB is recessive.                                                */


/* ========================================================  FDBTIM  ========================================================= */
/* =========================================================  FDCRC  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           CFGTMR                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CSTS  ========================================================== */
/* ==============================================  CFGTMR CSTS CLKDFSEL [0..2]  =============================================== */
                                 /* CFGTMR_CSTS_CLKDFSEL                                                       */
#define  CFGTMR_CSTS_CLKDFSEL_000                0U     /* 000 : Divide by 1                                                         */
#define  CFGTMR_CSTS_CLKDFSEL_001                1U     /* 001 : Divide by 2                                                         */
#define  CFGTMR_CSTS_CLKDFSEL_010                2U     /* 010 : Divide by 4                                                         */
#define  CFGTMR_CSTS_CLKDFSEL_011                3U     /* 011 : Divide by 8                                                         */
#define  CFGTMR_CSTS_CLKDFSEL_100                4U     /* 100 : Divide by 16                                                        */
#define  CFGTMR_CSTS_CLKDFSEL_101                5U     /* 101 : Divide by 32                                                        */
#define  CFGTMR_CSTS_CLKDFSEL_110                6U     /* 110 : Divide by 64                                                        */
#define  CFGTMR_CSTS_CLKDFSEL_111                7U     /* 111 : Divide by 128                                                       */


