MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  CFGTMR CSTS CCLKSSEL [3..4]  =============================================== */
                                 /* CFGTMR_CSTS_CCLKSSEL                                                       */
#define  CFGTMR_CSTS_CCLKSSEL_00                 0U     /* 00 : No clock selected. This in effect disables the CFGTMR counter.          */
#define  CFGTMR_CSTS_CCLKSSEL_01                 1U     /* 01 : CFGTMR input clock                                                      */
#define  CFGTMR_CSTS_CCLKSSEL_10                 2U     /* 10 : Fixed frequency clock                                                */
#define  CFGTMR_CSTS_CCLKSSEL_11                 3U     /* 11 : External clock                                                       */


/* ================================================  CFGTMR CSTS CMSEL [5..5]  ================================================ */
                                 /* CFGTMR_CSTS_CMSEL                                                          */
#define  CFGTMR_CSTS_CMSEL_0                     0U     /* 0 : CFGTMR counter operates in Up Counting mode.                             */
#define  CFGTMR_CSTS_CMSEL_1                     1U     /* 1 : CFGTMR counter operates in Up-Down Counting mode.                        */


/* ================================================  CFGTMR CSTS RPIEN [6..6]  ================================================ */
                                 /* CFGTMR_CSTS_RPIEN                                                          */
#define  CFGTMR_CSTS_RPIEN_0                     0U     /* 0 : Reload point interrupt is disabled.                                   */
#define  CFGTMR_CSTS_RPIEN_1                     1U     /* 1 : Reload point interrupt is enabled.                                    */


/* ================================================  CFGTMR CSTS RFLG [7..7]  ================================================= */
                                 /* CFGTMR_CSTS_RFLG                                                           */
#define  CFGTMR_CSTS_RFLG_0                      0U     /* 0 : A selected reload point did not happen.                               */
#define  CFGTMR_CSTS_RFLG_1                      1U     /* 1 : A selected reload point happened.                                     */


/* ==============================================  CFGTMR CSTS CFGTMROIEN [8..8]  =============================================== */
                                 /* CFGTMR_CSTS_CFGTMROIEN                                                       */
#define  CFGTMR_CSTS_CFGTMROIEN_0                  0U     /* 0 : Disable TOF interrupts. Use software polling.                         */
#define  CFGTMR_CSTS_CFGTMROIEN_1                  1U     /* 1 : Enable TOF interrupts. An interrupt is generated when TOF
                                                     equals one.                                                               */


/* ==============================================  CFGTMR CSTS CFGTMROFLG [9..9]  =============================================== */
                                 /* CFGTMR_CSTS_CFGTMROFLG                                                       */
#define  CFGTMR_CSTS_CFGTMROFLG_0                  0U     /* 0 : CFGTMR counter has not overflowed.                                       */
#define  CFGTMR_CSTS_CFGTMROFLG_1                  1U     /* 1 : CFGTMR counter has overflowed.                                           */


/* =============================================  CFGTMR CSTS PWMOENCH0 [16..16]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH0                                                       */
#define  CFGTMR_CSTS_PWMOENCH0_0                  0U     /* 0 : Channel 0 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH0_1                  1U     /* 1 : Channel 0 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH1 [17..17]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH1                                                       */
#define  CFGTMR_CSTS_PWMOENCH1_0                  0U     /* 0 : Channel 1 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH1_1                  1U     /* 1 : Channel 1 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH2 [18..18]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH2                                                       */
#define  CFGTMR_CSTS_PWMOENCH2_0                  0U     /* 0 : Channel 2 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH2_1                  1U     /* 1 : Channel 2 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH3 [19..19]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH3                                                       */
#define  CFGTMR_CSTS_PWMOENCH3_0                  0U     /* 0 : Channel 3 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH3_1                  1U     /* 1 : Channel 3 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH4 [20..20]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH4                                                       */
#define  CFGTMR_CSTS_PWMOENCH4_0                  0U     /* 0 : Channel 4 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH4_1                  1U     /* 1 : Channel 4 output port is enabled                                        */

/* =============================================  CFGTMR CSTS PWMOENCH5 [21..21]  ============================================== */
                                 /* CFGTMR_CSTS_PWMOENCH5                                                       */
#define  CFGTMR_CSTS_PWMOENCH5_0                  0U     /* 0 : Channel 5 output port is disabled                                       */
#define  CFGTMR_CSTS_PWMOENCH5_1                  1U     /* 1 : Channel 5 output port is enabled                                        */

