MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  CFGTMR CHnCSTS CHIEN [6..6]  =============================================== */
                                 /* CFGTMR_CHnCSTS_CHIEN                                         */
#define  CFGTMR_CHnCSTS_CHIEN_0    0U     /* 0 : Disable channel (n) interrupt. Use software polling.                  */
#define  CFGTMR_CHnCSTS_CHIEN_1    1U     /* 1 : Enable channel (n) interrupt.                                         */


/* =============================================  CFGTMR CHnCSTS CHEVFLG [7..7]  ============================================== */
                                 /* CFGTMR_CHnCSTS_CHEVFLG                                       */
#define  CFGTMR_CHnCSTS_CHEVFLG_0   0U    /* 0 : No channel (n) event has occurred.                                    */
#define  CFGTMR_CHnCSTS_CHEVFLG_1   1U    /* 1 : A channel (n) event has occurred.                                     */


/* ============================================  CFGTMR CHnCSTS CHOTMCTRL [8..8]  ============================================= */
                                 /* CFGTMR_CHnCSTS_CHOTMCTRL                                     */
#define  CFGTMR_CHnCSTS_CHOTMCTRL_0   0U  /* 0 : Channel outputs will generate the normal PWM outputs without
                                                       generating a pulse.                                                       */
#define  CFGTMR_CHnCSTS_CHOTMCTRL_1   1U  /* 1 : If a match in the channel occursU a trigger generation on
                                                        channel output will happen. The trigger pulse width has
                                                     one CFGTMR clock cycle.                                                      */


/* ==============================================  CFGTMR CHnCSTS CHISTS [9..9]  ============================================== */
                                 /* CFGTMR_CHnCSTS_CHISTS                                        */
#define  CFGTMR_CHnCSTS_CHISTS_0   0U     /* 0 : The channel (n) input is zero.                                        */
#define  CFGTMR_CHnCSTS_CHISTS_1   1U     /* 1 : The channel (n) input is one.                                         */


/* ============================================  CFGTMR CHnCSTS CHOLSEL [10..10]  ============================================= */
                                 /* CFGTMR_CHnCSTS_CHOLSEL                                       */
#define  CFGTMR_CHnCSTS_CHOLSEL_0   0U    /* 0 : The channel (n) output is zero.                                       */
#define  CFGTMR_CHnCSTS_CHOLSEL_1   1U    /* 1 : The channel (n) output is one.                                        */

/* =========================================================  CHnV  ========================================================== */
/* =========================================================  INITV  ========================================================= */
/* =========================================================  CCSTS  ========================================================= */
/* ==============================================  CFGTMR CCSTS CHEVFLG0 [0..0]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG0                                                       */
#define  CFGTMR_CCSTS_CHEVFLG0_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG0_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG1 [1..1]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG1                                                       */
#define  CFGTMR_CCSTS_CHEVFLG1_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG1_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG2 [2..2]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG2                                                       */
#define  CFGTMR_CCSTS_CHEVFLG2_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG2_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG3 [3..3]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG3                                                       */
#define  CFGTMR_CCSTS_CHEVFLG3_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG3_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG4 [4..4]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG4                                                       */
#define  CFGTMR_CCSTS_CHEVFLG4_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG4_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG [5..5]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG5                                                      */
#define  CFGTMR_CCSTS_CHEVFLG5_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG5_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG6 [6..6]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG6                                                       */
#define  CFGTMR_CCSTS_CHEVFLG6_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG6_1                  1U     /* 1 : A channel event has occurred.                                         */

/* ==============================================  CFGTMR CCSTS CHEVFLG7 [7..7]  =============================================== */
                                 /* CFGTMR_CCSTS_CHEVFLG7                                                       */
#define  CFGTMR_CCSTS_CHEVFLG7_0                  0U     /* 0 : No channel event has occurred.                                        */
#define  CFGTMR_CCSTS_CHEVFLG7_1                  1U     /* 1 : A channel event has occurred.                                         */


/* ==========================================================  FMSEL  ========================================================== */
/* ================================================  CFGTMR FMSEL CFGTMREN [0..0]  ================================================ */
                                 /* CFGTMR_FMSEL_CFGTMREN                                                          */
#define  CFGTMR_FMSEL_CFGTMREN_0                     0U     /* 0 : TPM compatibility. Free running counter and synchronization
                                                       compatible with TPM.                                                      */
#define  CFGTMR_FMSEL_CFGTMREN_1                     1U     /* 1 : Free running counter and synchronization are different from
                                                      TPM behavior.                                                             */


