MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  CFGTMR FMSEL WPUNLOCK [2..2]  =============================================== */
                                 /* CFGTMR_FMSEL_WPUNLOCK                                                        */
#define  CFGTMR_FMSEL_WPUNLOCK_0                   0U     /* 0 : Write protection is enabled.                                          */
#define  CFGTMR_FMSEL_WPUNLOCK_1                   1U     /* 1 : Write protection is disabled.                                         */


/* ===============================================  CFGTMR FMSEL PWMSMCFG [3..3]  =============================================== */
                                 /* CFGTMR_FMSEL_PWMSMCFG                                                        */
#define  CFGTMR_FMSEL_PWMSMCFG_0                   0U     /* 0 : No restrictions. Software and hardware triggers can be used
                                                         by MODU CnVU OUTMASKU and CFGTMR counter synchronization.                    */
#define  CFGTMR_FMSEL_PWMSMCFG_1                   1U     /* 1 : Software trigger can only be used by MOD and CHnV synchronizationU
                                                         and hardware triggers can only be used by OUTMASK and CFGTMR
                                                     counter synchronization.                                                  */


/* ================================================  CFGTMR FMSEL CTMEN [4..4]  ================================================= */
                                 /* CFGTMR_FMSEL_CTMEN                                                           */
#define  CFGTMR_FMSEL_CTMEN_0                      0U     /* 0 : Capture test mode is disabled.                                        */
#define  CFGTMR_FMSEL_CTMEN_1                      1U     /* 1 : Capture test mode is enabled.                                         */


/* ==============================================  CFGTMR FMSEL FCTRLMSEL [5..6]  =============================================== */
                                 /* CFGTMR_FMSEL_FCTRLMSEL                                                       */
#define  CFGTMR_FMSEL_FCTRLMSEL_00                 0U     /* 00 : Fault control is disabled for all channels.                          */
#define  CFGTMR_FMSEL_FCTRLMSEL_01                 1U     /* 01 : Fault control is enabled for even channels only (channels
                                                     0U 2U 4U and 6)U and the selected mode is the manual fault
                                                     clearing.                                                                 */
#define  CFGTMR_FMSEL_FCTRLMSEL_10                 2U     /* 10 : Fault control is enabled for all channelsU and the selected
                                                       mode is the manual fault clearing.                                        */
#define  CFGTMR_FMSEL_FCTRLMSEL_11                 3U     /* 11 : Fault control is enabled for all channelsU and the selected
                                                       mode is the automatic fault clearing.                                     */


/* ===============================================  CFGTMR FMSEL FCTRLIEN [7..7]  =============================================== */
                                 /* CFGTMR_FMSEL_FCTRLIEN                                                        */
#define  CFGTMR_FMSEL_FCTRLIEN_0                   0U     /* 0 : Fault control interrupt is disabled.                                  */
#define  CFGTMR_FMSEL_FCTRLIEN_1                   1U     /* 1 : Fault control interrupt is enabled.                                   */


/* ==========================================================  SYN  ========================================================== */
/* ===============================================  CFGTMR SYN MINLPEN [0..0]  ================================================ */
                                 /* CFGTMR_SYN_MINLPEN                                                         */
#define  CFGTMR_SYN_MINLPEN_0                    0U     /* 0 : The minimum loading point is disabled.                                */
#define  CFGTMR_SYN_MINLPEN_1                    1U     /* 1 : The minimum loading point is enabled.                                 */


/* ===============================================  CFGTMR SYN MAXLPEN [1..1]  ================================================ */
                                 /* CFGTMR_SYN_MAXLPEN                                                         */
#define  CFGTMR_SYN_MAXLPEN_0                    0U     /* 0 : The maximum loading point is disabled.                                */
#define  CFGTMR_SYN_MAXLPEN_1                    1U     /* 1 : The maximum loading point is enabled.                                 */


/* ==============================================  CFGTMR SYN CFGTMRCRINT [2..2]  =============================================== */
                                 /* CFGTMR_SYN_CFGTMRCRINT                                                       */
#define  CFGTMR_SYN_CFGTMRCRINT_0                  0U     /* 0 : CFGTMR counter continues to count normally.                              */
#define  CFGTMR_SYN_CFGTMRCRINT_1                  1U     /* 1 : CFGTMR counter is updated with its initial value when the selected
                                                     trigger is detected.                                                      */


/* ===============================================  CFGTMR SYN OVSMSEL [3..3]  ================================================ */
                                 /* CFGTMR_SYN_OVSMSEL                                                         */
#define  CFGTMR_SYN_OVSMSEL_0                    0U     /* 0 : OUTMASK register is updated with the value of its buffer
                                                        in all rising edges of the CFGTMR input clock.                               */
#define  CFGTMR_SYN_OVSMSEL_1                    1U     /* 1 : OUTMASK register is updated with the value of its buffer
                                                        only by the PWM synchronization.                                          */


/* ===============================================  CFGTMR SYN HWT0SEL [4..4]  ================================================ */
                                 /* CFGTMR_SYN_HWT0SEL                                                         */
#define  CFGTMR_SYN_HWT0SEL_0                    0U     /* 0 : Trigger is disabled.                                                  */
#define  CFGTMR_SYN_HWT0SEL_1                    1U     /* 1 : Trigger is enabled.                                                   */


