MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  CFGTMR FLCH DECSTS0 [3..3]  =============================================== */
                                 /* CFGTMR_FLCH_DECSTS0                                                        */
#define  CFGTMR_FLCH_DECSTS0_0                   0U     /* 0 : The dual edge captures are inactive.                                  */
#define  CFGTMR_FLCH_DECSTS0_1                   1U     /* 1 : The dual edge captures are active.                                    */


/* ===============================================  CFGTMR FLCH DTIEN0 [4..4]  ================================================ */
                                 /* CFGTMR_FLCH_DTIEN0                                                         */
#define  CFGTMR_FLCH_DTIEN0_0                    0U     /* 0 : The deadtime insertion in this pair of channels is disabled.          */
#define  CFGTMR_FLCH_DTIEN0_1                    1U     /* 1 : The deadtime insertion in this pair of channels is enabled.           */


/* ==============================================  CFGTMR FLCH PWMSYNEN0 [5..5]  ============================================== */
                                 /* CFGTMR_FLCH_PWMSYNEN0                                                      */
#define  CFGTMR_FLCH_PWMSYNEN0_0                 0U     /* 0 : The PWM synchronization in this pair of channels is disabled.         */
#define  CFGTMR_FLCH_PWMSYNEN0_1                 1U     /* 1 : The PWM synchronization in this pair of channels is enabled.          */


/* ==============================================  CFGTMR FLCH FCTRLEN0 [6..6]  =============================================== */
                                 /* CFGTMR_FLCH_FCTRLEN0                                                       */
#define  CFGTMR_FLCH_FCTRLEN0_0                  0U     /* 0 : The fault control in this pair of channels is disabled.               */
#define  CFGTMR_FLCH_FCTRLEN0_1                  1U     /* 1 : The fault control in this pair of channels is enabled.                */

/* ================================================  CFGTMR FLCH CCHO1 [9..9]  ================================================ */
                                 /* CFGTMR_FLCH_CCHO1                                                          */
#define  CFGTMR_FLCH_CCHO1_0                     0U     /* 0 : The channel (n+1) output is the same as the channel (n)
                                                       output.                                                                   */
#define  CFGTMR_FLCH_CCHO1_1                     1U     /* 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */


/* ==============================================  CFGTMR FLCH DECSTS1 [11..11]  ============================================== */
                                 /* CFGTMR_FLCH_DECSTS1                                                        */
#define  CFGTMR_FLCH_DECSTS1_0                   0U     /* 0 : The dual edge captures are inactive.                                  */
#define  CFGTMR_FLCH_DECSTS1_1                   1U     /* 1 : The dual edge captures are active.                                    */


/* ==============================================  CFGTMR FLCH DTIEN1 [12..12]  =============================================== */
                                 /* CFGTMR_FLCH_DTIEN1                                                         */
#define  CFGTMR_FLCH_DTIEN1_0                    0U     /* 0 : The deadtime insertion in this pair of channels is disabled.          */
#define  CFGTMR_FLCH_DTIEN1_1                    1U     /* 1 : The deadtime insertion in this pair of channels is enabled.           */


/* =============================================  CFGTMR FLCH PWMSYNEN1 [13..13]  ============================================= */
                                 /* CFGTMR_FLCH_PWMSYNEN1                                                      */
#define  CFGTMR_FLCH_PWMSYNEN1_0                 0U     /* 0 : The PWM synchronization in this pair of channels is disabled.         */
#define  CFGTMR_FLCH_PWMSYNEN1_1                 1U     /* 1 : The PWM synchronization in this pair of channels is enabled.          */


/* =============================================  CFGTMR FLCH FCTRLEN1 [14..14]  ============================================== */
                                 /* CFGTMR_FLCH_FCTRLEN1                                                       */
#define  CFGTMR_FLCH_FCTRLEN1_0                  0U     /* 0 : The fault control in this pair of channels is disabled.               */
#define  CFGTMR_FLCH_FCTRLEN1_1                  1U     /* 1 : The fault control in this pair of channels is enabled.                */


/* ===============================================  CFGTMR FLCH CCHO2 [17..17]  =============================================== */
                                 /* CFGTMR_FLCH_CCHO2                                                          */
#define  CFGTMR_FLCH_CCHO2_0                     0U     /* 0 : The channel (n+1) output is the same as the channel (n)
                                                        output.                                                                   */
#define  CFGTMR_FLCH_CCHO2_1                     1U     /* 1 : The channel (n+1) output is the complement of the channel
                                                        (n) output.                                                               */


/* ==============================================  CFGTMR FLCH DECSTS2 [19..19]  ============================================== */
                                 /* CFGTMR_FLCH_DECSTS2                                                        */
#define  CFGTMR_FLCH_DECSTS2_0                   0U     /* 0 : The dual edge captures are inactive.                                  */
#define  CFGTMR_FLCH_DECSTS2_1                   1U     /* 1 : The dual edge captures are active.                                    */


/* ==============================================  CFGTMR FLCH DTIEN2 [20..20]  =============================================== */
                                 /* CFGTMR_FLCH_DTIEN2                                                         */
#define  CFGTMR_FLCH_DTIEN2_0                    0U     /* 0 : The deadtime insertion in this pair of channels is disabled.          */
#define  CFGTMR_FLCH_DTIEN2_1                    1U     /* 1 : The deadtime insertion in this pair of channels is enabled.           */


/* =============================================  CFGTMR FLCH PWMSYNEN2 [21..21]  ============================================= */
                                 /* CFGTMR_FLCH_PWMSYNEN2                                                      */
#define  CFGTMR_FLCH_PWMSYNEN2_0                 0U     /* 0 : The PWM synchronization in this pair of channels is disabled.         */
#define  CFGTMR_FLCH_PWMSYNEN2_1                 1U     /* 1 : The PWM synchronization in this pair of channels is enabled.          */


