MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =============================================  CFGTMR FLCH FCTRLEN2 [22..22]  ============================================== */
                                 /* CFGTMR_FLCH_FCTRLEN2                                                       */
#define  CFGTMR_FLCH_FCTRLEN2_0                  0U     /* 0 : The fault control in this pair of channels is disabled.               */
#define  CFGTMR_FLCH_FCTRLEN2_1                  1U     /* 1 : The fault control in this pair of channels is enabled.                */


/* ===============================================  CFGTMR FLCH CCHO3 [25..25]  =============================================== */
                                 /* CFGTMR_FLCH_CCHO3                                                          */
#define  CFGTMR_FLCH_CCHO3_0                     0U     /* 0 : The channel (n+1) output is the same as the channel (n)
                                                         output.                                                                   */
#define  CFGTMR_FLCH_CCHO3_1                     1U     /* 1 : The channel (n+1) output is the complement of the channel
                                                        (n) output.                                                               */


/* ==============================================  CFGTMR FLCH DECSTS3 [27..27]  ============================================== */
                                 /* CFGTMR_FLCH_DECSTS3                                                        */
#define  CFGTMR_FLCH_DECSTS3_0                   0U     /* 0 : The dual edge captures are inactive.                                  */
#define  CFGTMR_FLCH_DECSTS3_1                   1U     /* 1 : The dual edge captures are active.                                    */


/* ==============================================  CFGTMR FLCH DTIEN3 [28..28]  =============================================== */
                                 /* CFGTMR_FLCH_DTIEN3                                                         */
#define  CFGTMR_FLCH_DTIEN3_0                    0U     /* 0 : The deadtime insertion in this pair of channels is disabled.          */
#define  CFGTMR_FLCH_DTIEN3_1                    1U     /* 1 : The deadtime insertion in this pair of channels is enabled.           */


/* =============================================  CFGTMR FLCH PWMSYNEN3 [29..29]  ============================================= */
                                 /* CFGTMR_FLCH_PWMSYNEN3                                                      */
#define  CFGTMR_FLCH_PWMSYNEN3_0                 0U     /* 0 : The PWM synchronization in this pair of channels is disabled.         */
#define  CFGTMR_FLCH_PWMSYNEN3_1                 1U     /* 1 : The PWM synchronization in this pair of channels is enabled.          */


/* =============================================  CFGTMR FLCH FCTRLEN3 [30..30]  ============================================== */
                                 /* CFGTMR_FLCH_FCTRLEN3                                                       */
#define  CFGTMR_FLCH_FCTRLEN3_0                  0U     /* 0 : The fault control in this pair of channels is disabled.               */
#define  CFGTMR_FLCH_FCTRLEN3_1                  1U     /* 1 : The fault control in this pair of channels is enabled.                */


/* =========================================================  DCFG  ========================================================== */
/* ================================================  CFGTMR DCFG DPSCCFG [6..7]  ================================================ */
                                 /* CFGTMR_DCFG_DPSCCFG                                                          */
#define  CFGTMR_DCFG_DPSCCFG_00                  0U     /* 00 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_DCFG_DPSCCFG_01                  1U     /* 01 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_DCFG_DPSCCFG_10                  2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_DCFG_DPSCCFG_11                  3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  EXTTRG  ========================================================= */
/* ============================================  CFGTMR EXTTRG EXTTRGENCH2 [0..0]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH2                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH2_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH2_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH3 [1..1]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH3                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH3_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH3_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH4 [2..2]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH4                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH4_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH4_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH5 [3..3]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH5                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH5_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH5_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


/* ============================================  CFGTMR EXTTRG EXTTRGENCH0 [4..4]  ============================================ */
                                 /* CFGTMR_EXTTRG_EXTTRGENCH0                                                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH0_0             0U     /* 0 : The generation of this external trigger is disabled.                  */
#define  CFGTMR_EXTTRG_EXTTRGENCH0_1             1U     /* 1 : The generation of this external trigger is enabled.                   */


