MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  CFGTMR SYNCFG HWTAC [16..16]  ============================================== */
                                 /* CFGTMR_SYNCFG_HWTAC                                                        */
#define  CFGTMR_SYNCFG_HWTAC_0                   0U     /* 0 : A hardware trigger does not activate the CFGTMR counter synchronization. */
#define  CFGTMR_SYNCFG_HWTAC_1                   1U     /* 1 : A hardware trigger activates the CFGTMR counter synchronization.         */


/* ============================================  CFGTMR SYNCFG HWTAWRBUF [17..17]  ============================================ */
                                 /* CFGTMR_SYNCFG_HWTAWRBUF                                                    */
#define  CFGTMR_SYNCFG_HWTAWRBUF_0               0U     /* 0 : A hardware trigger does not activate MODU HCRU CNTINU and
                                                        CV registers synchronization.                                             */
#define  CFGTMR_SYNCFG_HWTAWRBUF_1               1U     /* 1 : A hardware trigger activates MODU HCRU CNTINU and CV registers
                                                        synchronization.                                                          */


/* =============================================  CFGTMR SYNCFG HWTAOM [18..18]  ============================================== */
                                 /* CFGTMR_SYNCFG_HWTAOM                                                       */
#define  CFGTMR_SYNCFG_HWTAOM_0                  0U     /* 0 : A hardware trigger does not activate the OUTMASK register
                                                         synchronization.                                                          */
#define  CFGTMR_SYNCFG_HWTAOM_1                  1U     /* 1 : A hardware trigger activates the OUTMASK register synchronization.    */


/* ============================================  CFGTMR SYNCFG HWTAICTRL [19..19]  ============================================ */
                                 /* CFGTMR_SYNCFG_HWTAICTRL                                                    */
#define  CFGTMR_SYNCFG_HWTAICTRL_0               0U     /* 0 : A hardware trigger does not activate the INVCTRL register
                                                         synchronization.                                                          */
#define  CFGTMR_SYNCFG_HWTAICTRL_1               1U     /* 1 : A hardware trigger activates the INVCTRL register synchronization.    */


/* =============================================  CFGTMR SYNCFG HWTASWO [20..20]  ============================================= */
                                 /* CFGTMR_SYNCFG_HWTASWO                                                      */
#define  CFGTMR_SYNCFG_HWTASWO_0                 0U     /* 0 : A hardware trigger does not activate the SWOCTRL register
                                                         synchronization.                                                          */
#define  CFGTMR_SYNCFG_HWTASWO_1                 1U     /* 1 : A hardware trigger activates the SWOCTRL register synchronization.    */


/* =========================================================  ICTRL  ========================================================= */
/* ==============================================  CFGTMR ICTRL CHPIEN0 [0..0]  =============================================== */
                                 /* CFGTMR_ICTRL_CHPIEN0                                                       */
#define  CFGTMR_ICTRL_CHPIEN0_0                  0U     /* 0 : Inverting is disabled.                                                */
#define  CFGTMR_ICTRL_CHPIEN0_1                  1U     /* 1 : Inverting is enabled.                                                 */


/* ==============================================  CFGTMR ICTRL CHPIEN1 [1..1]  =============================================== */
                                 /* CFGTMR_ICTRL_CHPIEN1                                                       */
#define  CFGTMR_ICTRL_CHPIEN1_0                  0U     /* 0 : Inverting is disabled.                                                */
#define  CFGTMR_ICTRL_CHPIEN1_1                  1U     /* 1 : Inverting is enabled.                                                 */


/* ==============================================  CFGTMR ICTRL CHPIEN2 [2..2]  =============================================== */
                                 /* CFGTMR_ICTRL_CHPIEN2                                                       */
#define  CFGTMR_ICTRL_CHPIEN2_0                  0U     /* 0 : Inverting is disabled.                                                */
#define  CFGTMR_ICTRL_CHPIEN2_1                  1U     /* 1 : Inverting is enabled.                                                 */


/* ==============================================  CFGTMR ICTRL CHPIEN3 [3..3]  =============================================== */
                                 /* CFGTMR_ICTRL_CHPIEN3                                                       */
#define  CFGTMR_ICTRL_CHPIEN3_0                  0U     /* 0 : Inverting is disabled.                                                */
#define  CFGTMR_ICTRL_CHPIEN3_1                  1U     /* 1 : Inverting is enabled.                                                 */


/* ========================================================  SWOCTRL  ======================================================== */
/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN0 [0..0]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN0                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN0_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN0_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN1 [1..1]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN1                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN1_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN1_1            1U     /* 1 : The channel output is affected by software output control.            */

/* ===========================================  CFGTMR SWOCTRL CHSWOCTRLEN2 [2..2]  ============================================ */
                                 /* CFGTMR_SWOCTRL_CHSWOCTRLEN2                                                 */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN2_0            0U     /* 0 : The channel output is not affected by software output control.        */
#define  CFGTMR_SWOCTRL_CHSWOCTRLEN2_1            1U     /* 1 : The channel output is affected by software output control.            */

