MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==========================================================  HC  =========================================================== */
/* ========================================================  P0DCFG  ========================================================= */
/* ==============================================  CFGTMR P0DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P0DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P1DCFG  ========================================================= */
/* ==============================================  CFGTMR P1DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P1DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P2DCFG  ========================================================= */
/* ==============================================  CFGTMR P2DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P2DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ========================================================  P3DCFG  ========================================================= */
/* ==============================================  CFGTMR P3DCFG PSCCFG [6..7]  =============================================== */
                                 /* CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG                                           */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_0x_0   0U     /* 0x_0 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_0x_1   1U     /* 0x_1 : Divide the CFGTMR input clock by 1.                                   */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_10     2U     /* 10 : Divide the CFGTMR input clock by 4.                                     */
#define  CFGTMR_PDCFG_PDCFG_P3DCFG_PSCCFG_11     3U     /* 11 : Divide the CFGTMR input clock by 16.                                    */


/* ==========================================================  MMV  ========================================================== */
/* =========================================================  MCH0M  ========================================================= */
/* =========================================================  MCH1M  ========================================================= */
/* =========================================================  MCH2M  ========================================================= */
/* =========================================================  MCH3M  ========================================================= */
/* =========================================================  MCH4M  ========================================================= */
/* =========================================================  MCH5M  ========================================================= */
/* =========================================================  MCH6M  ========================================================= */
/* =========================================================  MCH7M  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           ADC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CSTS1  ========================================================= */
/* ===============================================  ADC CSTS1 ICHSEL [0..5]  =============================================== */
                                    /* ADC_CSTS1_ICHSEL                                            */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000000      0     /*!< 000000 : Exernal channel 0 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000001      1     /*!< 000001 : Exernal channel 1 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000010      2     /*!< 000010 : Exernal channel 2 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000011      3     /*!< 000011 : Exernal channel 3 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000100      4     /*!< 000100 : Exernal channel 4 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000101      5     /*!< 000101 : Exernal channel 5 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000110      6     /*!< 000110 : Exernal channel 6 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_000111      7     /*!< 000111 : Exernal channel 7 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001000      8     /*!< 001000 : Exernal channel 8 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001001      9     /*!< 001001 : Exernal channel 9 is selected as input.                          */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001010      10    /*!< 001010 : Exernal channel 10 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001011      11    /*!< 001011 : Exernal channel 11 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001100      12    /*!< 001100 : Exernal channel 12 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001101      13    /*!< 001101 : Exernal channel 13 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001110      14    /*!< 001110 : Exernal channel 14 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_001111      15    /*!< 001111 : Exernal channel 15 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_010101      21    /*!< 010101 : Internal channel 0 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_010110      22    /*!< 010110 : Internal channel 1 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_010111      23    /*!< 010111 : Internal channel 2 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_011011      27    /*!< 011011 : Band Gap                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_011100      28    /*!< 011100 : Internal channel 3 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_011101      29    /*!< 011101 : VREFSH is selected as input. Voltage reference selected
                                                        is determined by CSTS2[REFSEL].                                                 */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_011110      30    /*!< 011110 : VREFSL is selected as input. Voltage reference selected
                                                        is determined by CSTS2[REFSEL].                                                 */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_011111      31    /*!< 011111 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100000      32    /*!< 100000 : Exernal channel 16 is selected as input.                        */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100001      33    /*!< 100001 : Exernal channel 17 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100010      34    /*!< 100010 : Exernal channel 18 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100011      35    /*!< 100011 : Exernal channel 19 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100100      36    /*!< 100100 : Exernal channel 20 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100101      37    /*!< 100101 : Exernal channel 21 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100110      38    /*!< 100110 : Exernal channel 22 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_100111      39    /*!< 100111 : Exernal channel 23 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101000      40    /*!< 101000 : Exernal channel 24 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101001      41    /*!< 101001 : Exernal channel 25 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101010      42    /*!< 101010 : Exernal channel 26 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101011      43    /*!< 101011 : Exernal channel 27 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101100      44    /*!< 101100 : Exernal channel 28 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101101      45    /*!< 101101 : Exernal channel 29 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101110      46    /*!< 101110 : Exernal channel 30 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_101111      47    /*!< 101111 : Exernal channel 31 is selected as input.                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110000      48    /*!< 110000 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110001      49    /*!< 110001 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110010      50    /*!< 110010 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110011      51    /*!< 110011 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110100      52    /*!< 110100 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110101      53    /*!< 110101 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110110      54    /*!< 110110 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_110111      55    /*!< 110111 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111000      56    /*!< 111000 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111001      57    /*!< 111001 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111010      58    /*!< 111010 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111011      59    /*!< 111011 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111100      60    /*!< 111100 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111101      61    /*!< 111101 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111110      62    /*!< 111110 : Reserved                                                         */
#define ADC0_CSTS1_CSTS1_CSTS1A_ICHSEL_111111      63    /*!< 111111 : Module is disabled                                               */

