MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  ADC CSTS1 CCIEN [6..6]  ================================================ */
                                    /* ADC_CSTS1_CCIEN                                             */
#define ADC_CSTS1_CCIEN_0        0U      /* 0 : Conversion complete interrupt is disabled.                     */
#define ADC_CSTS1_CCIEN_1        1U      /* 1 : Conversion complete interrupt is enabled.                      */

/* ===============================================  ADC CSTS1 CCFLG [7..7]  ================================================ */
                                    /* ADC_CSTS1_CCFLG                                             */
#define ADC_CSTS1_CCFLG_0        0U      /* 0 : Conversion is not completed.                                   */
#define ADC_CSTS1_CCFLG_1        1U      /* 1 : Conversion is completed.                                       */


/* =========================================================  CFG1  ========================================================== */
/* ==============================================  ADC CFG1 ICLKSSEL [0..1]  ============================================== */
                                    /* ADC_CFG1_ICLKSSEL                                                      */
#define ADC_CFG1_ICLKSSEL_00                0U      /* 00 : Alternate clock 1 (ADC_ALTCLK1)                               */
#define ADC_CFG1_ICLKSSEL_01                1U      /* 01 : Alternate clock 2 (ADC_ALTCLK2)                               */
#define ADC_CFG1_ICLKSSEL_10                2U      /* 10 : Alternate clock 3 (ADC_ALTCLK3)                               */
#define ADC_CFG1_ICLKSSEL_11                3U      /* 11 : Alternate clock 4 (ADC_ALTCLK4)                               */

/* ===============================================  ADC CFG1 CMODSEL [2..3]  ================================================ */
                                    /* ADC_CFG1_CMODSEL                                                         */
#define ADC_CFG1_CMODSEL_00                   0U      /* 00 : 8-bit conversion.                                             */
#define ADC_CFG1_CMODSEL_01                   1U      /* 01 : 12-bit conversion.                                            */
#define ADC_CFG1_CMODSEL_10                   2U      /* 10 : 10-bit conversion.                                            */

/* ==============================================  ADC CFG1 CLKDIVCFG [5..6]  =============================================== */
                                    /* ADC_CFG1_CLKDIVCFG                                                       */
#define ADC_CFG1_CLKDIVCFG_00                 0U      /* 00 : The divide ratio is 1 and the clock rate is input clock.      */
#define ADC_CFG1_CLKDIVCFG_01                 1U      /* 01 : The divide ratio is 2 and the clock rate is (input clock)/2.  */
#define ADC_CFG1_CLKDIVCFG_10                 2U      /* 10 : The divide ratio is 4 and the clock rate is (input clock)/4.  */
#define ADC_CFG1_CLKDIVCFG_11                 3U      /* 11 : The divide ratio is 8 and the clock rate is (input clock)/8.  */

/* =========================================================  CFG2  ========================================================== */
/* =========================================================  DATAA  ========================================================= */
/* =========================================================  DATAB  ========================================================= */
/* =========================================================  DATAC  ========================================================= */
/* =========================================================  DATAD  ========================================================= */
/* =========================================================  DATAE  ========================================================= */
/* =========================================================  DATAF  ========================================================= */
/* =========================================================  DATAG  ========================================================= */
/* =========================================================  DATAH  ========================================================= */
/* =========================================================  DATAI  ========================================================= */
/* =========================================================  DATAJ  ========================================================= */
/* =========================================================  DATAK  ========================================================= */
/* =========================================================  DATAL  ========================================================= */
/* =========================================================  DATAM  ========================================================= */
/* =========================================================  DATAN  ========================================================= */
/* =========================================================  DATAO  ========================================================= */
/* =========================================================  DATAP  ========================================================= */
/* ==========================================================  CV1  ========================================================== */
/* ==========================================================  CV2  ========================================================== */
/* =========================================================  CSTS2  ========================================================= */
/* ===============================================  ADC CSTS2 VREFSEL [0..1]  =============================================== */
                                    /* ADC_CSTS2_VREFSEL                                                        */
#define ADC_CSTS2_VREFSEL_00                  0U      /* 00 : Default voltage reference pin pair  that is  external pins
                                                     VREFH and VREFL                                                           */
#define ADC_CSTS2_VREFSEL_01                  1U      /* 01 : Alternate reference voltage  that is  VALTH. This voltage
                                                     may be additional external pin or internal source depending
                                                     on the MCU configuration. See the chip configuration information
                                                     for details specific to this MCU.                                         */

