MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  ADC CSTS2 DMAEN [2..2]  ================================================ */
                                    /* ADC_CSTS2_DMAEN                                                          */
#define ADC_CSTS2_DMAEN_0                     0U      /* 0 : DMA is disabled.                                               */
#define ADC_CSTS2_DMAEN_1                     1U      /* 1 : DMA is enabled and will assert the ADC DMA request during
                                                     an ADC conversion complete event   which is indicated when
                                                     any SC1n[COCO] flag is asserted.                                          */

/* ===============================================  ADC CSTS2 COMPEN [5..5]  ================================================ */
                                    /* ADC_CSTS2_COMPEN                                                         */
#define ADC_CSTS2_COMPEN_0                    0U      /* 0 : Compare function disabled.                                     */
#define ADC_CSTS2_COMPEN_1                    1U      /* 1 : Compare function enabled.                                      */

/* ===============================================  ADC CSTS2 CTRGSEL [6..6]  =============================================== */
                                    /* ADC_CSTS2_CTRGSEL                                                        */
#define ADC_CSTS2_CTRGSEL_0                   0U      /* 0 : Software trigger selected.                                     */
#define ADC_CSTS2_CTRGSEL_1                   1U      /* 1 : Hardware trigger selected.                                     */

/* ================================================  ADC CSTS2 CFLAG [7..7]  ================================================ */
                                    /* ADC_CSTS2_CFLAG                                                   */
#define ADC_CSTS2_CFLAG_0                     0U      /* 0 : Conversion not in progress.                                    */
#define ADC_CSTS2_CFLAG_1                     1U      /* 1 : Conversion in progress.                                        */

/* ==============================================  ADC CSTS2 TRGSTS [16..19]  =============================================== */
                                    /* ADC_CSTS2_TRGSTS                                                  */
#define ADC_CSTS2_TRGSTS_0                    0U      /* 0 : No trigger request has been latched                            */
#define ADC_CSTS2_TRGSTS_1                    1U      /* 1 : A trigger request has been latched                             */

/* ==============================================  ADC CSTS2 TRGEFLG [24..27]  ============================================== */
                                    /* ADC_CSTS2_TRGEFLG                                                        */
#define ADC_CSTS2_TRGEFLG_0                   0U      /* 0 : No error has occurred                                          */
#define ADC_CSTS2_TRGEFLG_1                   1U      /* 1 : An error has occurred                                          */

/* =========================================================  CSTS3  ========================================================= */
/* ===============================================  ADC CSTS3 HAVGCFG [0..1]  =============================================== */
                                   /* ADC_CSTS3_HAVGCFG                                                        */
#define ADC_CSTS3_HAVGCFG_00                  0U      /* 00 : 4 samples averaged.                                           */
#define ADC_CSTS3_HAVGCFG_01                  1U      /* 01 : 8 samples averaged.                                           */
#define ADC_CSTS3_HAVGCFG_10                  2U      /* 10 : 16 samples averaged.                                          */
#define ADC_CSTS3_HAVGCFG_11                  3U      /* 11 : 32 samples averaged.                                          */

/* ===============================================  ADC CSTS3 HAVGEN [2..2]  ================================================ */
                                  /* ADC_CSTS3_HAVGEN                                                         */
#define ADC_CSTS3_HAVGEN_0                    0U      /* 0 : Hardware average function disabled.                            */
#define ADC_CSTS3_HAVGEN_1                    1U      /* 1 : Hardware average function enabled.                             */

/* ===============================================  ADC CSTS3 CONTCEN [3..3]  =============================================== */
                                  /* ADC_CSTS3_CONTCEN                                                        */
#define ADC_CSTS3_CONTCEN_0                   0U      /* 0 : One conversion will be performed (or one set of conversions
                                                     if AVGE is set) after a conversion is initiated.                          */
#define ADC_CSTS3_CONTCEN_1                   1U      /* 1 : Continuous conversions will be performed (or continuous
                                                     sets of conversions  if AVGE is set) after a conversion
                                                     is initiated.                                                             */

 /* ===============================================  ADC CSTS3 CAL [7..7]  =============================================== */
                                  /* ADC_CSTS3_CAL                                                        */
#define ADC_CSTS3_CAL_0                   0U      /* 0 : The calibration sequence is completed                              */
#define ADC_CSTS3_CAL_1                   1U      /* 1 : The ADC begins the calibration sequence                            */

/* =========================================================  BOEC  ========================================================== */
/* ==========================================================  OEC  ========================================================== */
/* =========================================================  UOEC  ========================================================== */
/* =========================================================  XOEC  ========================================================== */
/* =========================================================  YOEC  ========================================================== */
/* =========================================================  GEAF  ========================================================== */
/* =========================================================  UGEC  ========================================================= */
/* =========================================================  GCALS  ========================================================= */
/* ========================================================  PSGCAL3  ======================================================== */
/* ========================================================  PSGCAL2  ======================================================== */
/* ========================================================  PSGCAL1  ======================================================== */
/* ========================================================  PSGCAL0  ======================================================== */
/* ========================================================  PSGCALX  ======================================================== */
/* ========================================================  PSGCAL9  ======================================================== */
/* ========================================================  GCALOS  ========================================================= */
/* =======================================================  PSGCALOV3  ======================================================= */
/* =======================================================  PSGCALOV2  ======================================================= */
/* =======================================================  PSGCALOV1  ======================================================= */
/* =======================================================  PSGCALOV0  ======================================================= */
/* =======================================================  PSGCALOVX  ======================================================= */
/* =======================================================  PSGCALOV9  ======================================================= */
/* ===============================================  ADC ACSTS1 ICHSEL [0..5]  =============================================== */
                                    /* ADC_aSC1_ICHSEL                                            */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000000      0     /*!< 000000 : Exernal intput channel 0 is selected.                            */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000001      1     /*!< 000001 : Exernal channel 1 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000010      2     /*!< 000010 : Exernal channel 2 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000011      3     /*!< 000011 : Exernal channel 3 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000100      4     /*!< 000100 : Exernal channel 4 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000101      5     /*!< 000101 : Exernal channel 5 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000110      6     /*!< 000110 : Exernal channel 6 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_000111      7     /*!< 000111 : Exernal channel 7 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001000      8     /*!< 001000 : Exernal channel 8 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001001      9     /*!< 001001 : Exernal channel 9 is selected as input.                          */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001010      10    /*!< 001010 : Exernal channel 10 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001011      11    /*!< 001011 : Exernal channel 11 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001100      12    /*!< 001100 : Exernal channel 12 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001101      13    /*!< 001101 : Exernal channel 13 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001110      14    /*!< 001110 : Exernal channel 14 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_001111      15    /*!< 001111 : Exernal channel 15 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_010101      21    /*!< 010101 : Internal channel 0 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_010110      22    /*!< 010110 : Internal channel 1 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_010111      23    /*!< 010111 : Internal channel 2 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_011011      27    /*!< 011011 : Band Gap                                                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_011100      28    /*!< 011100 : Internal channel 3 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_011101      29    /*!< 011101 : VREFSH is selected as input. Voltage reference selected
                                                        is determined by CSTS2[REFSEL].                                                 */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_011110      30    /*!< 011110 : VREFSL is selected as input. Voltage reference selected
                                                        is determined by CSTS2[REFSEL].                                                 */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_011111      31    /*!< 011111 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100000      32    /*!< 100000 : Internal channel 16 is selected as input.                        */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100001      33    /*!< 100001 : Exernal channel 17 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100010      34    /*!< 100010 : Exernal channel 18 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100011      35    /*!< 100011 : Exernal channel 19 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100100      36    /*!< 100100 : Exernal channel 20 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100101      37    /*!< 100101 : Exernal channel 21 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100110      38    /*!< 100110 : Exernal channel 22 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_100111      39    /*!< 100111 : Exernal channel 23 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101000      40    /*!< 101000 : Exernal channel 24 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101001      41    /*!< 101001 : Exernal channel 25 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101010      42    /*!< 101010 : Exernal channel 26 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101011      43    /*!< 101011 : Exernal channel 27 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101100      44    /*!< 101100 : Exernal channel 28 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101101      45    /*!< 101101 : Exernal channel 29 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101110      46    /*!< 101110 : Exernal channel 30 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_101111      47    /*!< 101111 : Exernal channel 31 is selected as input.                         */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_48   48 /*!< 11xxxx_48 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_49   49 /*!< 11xxxx_49 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_50   50 /*!< 11xxxx_50 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_51   51 /*!< 11xxxx_51 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_52   52 /*!< 11xxxx_52 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_53   53 /*!< 11xxxx_53 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_54   54 /*!< 11xxxx_54 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_55   55 /*!< 11xxxx_55 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_56   56 /*!< 11xxxx_56 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_57   57 /*!< 11xxxx_57 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_58   58 /*!< 11xxxx_58 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_59   59 /*!< 11xxxx_59 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_60   60 /*!< 11xxxx_60 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_61   61 /*!< 11xxxx_61 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_62   62 /*!< 11xxxx_62 : Module is disabled                                               */
#define ADC0_aSC1_aSC1_aSC1A_ICHSEL_11xxxx_63   63 /*!< 11xxxx_63 : Module is disabled                                               */
/* ===============================================  ADC ACSTS1 CCIEN [6..6]  ================================================ */
                                    /* ADC_aSC1_CCIEN                                             */
#define ADC_aSC1_CCIEN_0        0U      /* 0 : Conversion complete interrupt is disabled.                     */
#define ADC_aSC1_CCIEN_1        1U      /* 1 : Conversion complete interrupt is enabled.                      */

