MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  ADC ACSTS1 CCFLG [7..7]  ================================================ */
                                    /* ADC_aSC1_CCFLG                                             */
#define ADC_aSC1_CCFLG_0        0U      /* 0 : Conversion is not completed.                                   */
#define ADC_aSC1_CCFLG_1        1U      /* 1 : Conversion is completed.                                       */
/* =======================================================  aRA-X  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          LPSPI                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* =============================================  LPSPI VERID FEATURE [0..15]  ============================================== */
                                  /* LPSPI_VERID_FEATURE                                                      */
#define LPSPI_VERID_FEATURE_0000000000000100   4U     /* 0000000000000100 : Standard feature set supporting 32-bit shift
                                                     register.                                                                 */

/* =========================================================  PARA  ========================================================= */
/* =========================================================  CTRL  ========================================================== */
/* ================================================  LPSPI CTRL MEN [0..0]  ================================================= */
                                 /* LPSPI_CTRL_MEN                                                           */
#define LPSPI_CTRL_MEN_0                      0U      /* 0 : Module is disabled.                                            */
#define LPSPI_CTRL_MEN_1                      1U      /* 1 : Module is enabled.                                             */

/* ===============================================  LPSPI CTRL SWRST [1..1]  ================================================ */
                                  /* LPSPI_CTRL_SWRST                                                         */
#define LPSPI_CTRL_SWRST_0                    0U      /* 0 : Master logic is not reset.                                     */
#define LPSPI_CTRL_SWRST_1                    1U      /* 1 : Master logic is reset.                                         */

/* ==============================================  LPSPI CTRL DOZEDIS [2..2]  =============================================== */
                                 /* LPSPI_CTRL_DOZEDIS                                                       */
#define LPSPI_CTRL_DOZEDIS_0                  0U      /* 0 : Module is enabled in Doze mode.                                */
#define LPSPI_CTRL_DOZEDIS_1                  1U      /* 1 : Module is disabled in Doze mode.                               */

/* ===============================================  LPSPI CTRL DBGEN [3..3]  ================================================ */
                                  /* LPSPI_CTRL_DBGEN                                                         */
#define LPSPI_CTRL_DBGEN_0                    0U      /* 0 : Module is disabled in debug mode.                              */
#define LPSPI_CTRL_DBGEN_1                    1U      /* 1 : Module is enabled in debug mode.                               */

/* ===============================================  LPSPI CTRL TXFRST [8..8]  =============================================== */
                                 /* LPSPI_CTRL_TXFRST                                                        */
#define LPSPI_CTRL_TXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPSPI_CTRL_TXFRST_1                   1U      /* 1 : Transmit FIFO is reset.                                        */

/* ===============================================  LPSPI CTRL RXFRST [9..9]  =============================================== */
                                 /* LPSPI_CTRL_RXFRST                                                        */
#define LPSPI_CTRL_RXFRST_0                   0U      /* 0 : No effect.                                                     */
#define LPSPI_CTRL_RXFRST_1                   1U      /* 1 : Receive FIFO is reset.                                         */

/* ==========================================================  STS  ========================================================== */
/* ==============================================  LPSPI STS TXDATAFLG [0..0]  ============================================== */
                                 /* LPSPI_STS_TXDATAFLG                                                      */
#define LPSPI_STS_TXDATAFLG_0                 0U      /* 0 : Transmit data not requested.                                   */
#define LPSPI_STS_TXDATAFLG_1                 1U      /* 1 : Transmit data is requested.                                    */

/* ==============================================  LPSPI STS RXDATAFLG [1..1]  ============================================== */
                                  /* LPSPI_STS_RXDATAFLG                                                      */
#define LPSPI_STS_RXDATAFLG_0                 0U      /* 0 : Receive Data is not ready.                                     */
#define LPSPI_STS_RXDATAFLG_1                 1U      /* 1 : Receive data is ready.                                         */

/* ===============================================  LPSPI STS RXWCFLG [8..8]  =============================================== */
                                  /* LPSPI_STS_RXWCFLG                                                        */
#define LPSPI_STS_RXWCFLG_0                   0U      /* 0 : Transfer word not completed.                                   */
#define LPSPI_STS_RXWCFLG_1                   1U      /* 1 : Transfer word completed.                                       */

/* ===============================================  LPSPI STS FTXCFLG [9..9]  =============================================== */
                                  /* LPSPI_STS_FTXCFLG                                                        */
#define LPSPI_STS_FTXCFLG_0                   0U      /* 0 : Frame transfer has not completed.                              */
#define LPSPI_STS_FTXCFLG_1                   1U      /* 1 : Frame transfer has completed.                                  */

