MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  LPSPI STS TXCFLG [10..10]  =============================================== */
                                /* LPSPI_STS_TXCFLG                                                         */
#define LPSPI_STS_TXCFLG_0                    0U      /* 0 : All transfers have not completed.                              */
#define LPSPI_STS_TXCFLG_1                    1U      /* 1 : All transfers have completed.                                  */

/* ==============================================  LPSPI STS TXEFLG [11..11]  =============================================== */
                                  /* LPSPI_STS_TXEFLG                                                         */
#define LPSPI_STS_TXEFLG_0                    0U      /* 0 : Transmit FIFO underrun has not occurred.                       */
#define LPSPI_STS_TXEFLG_1                    1U      /* 1 : Transmit FIFO underrun has occurred                            */

/* ==============================================  LPSPI STS RXEFLG [12..12]  =============================================== */
                                 /* LPSPI_STS_RXEFLG                                                         */
#define LPSPI_STS_RXEFLG_0                    0U      /* 0 : Receive FIFO has not overflowed.                               */
#define LPSPI_STS_RXEFLG_1                    1U      /* 1 : Receive FIFO has overflowed.                                   */

/* ==============================================  LPSPI STS RXMFLG [13..13]  =============================================== */
                                  /* LPSPI_STS_RXMFLG                                                         */
#define LPSPI_STS_RXMFLG_0                    0U      /* 0 : Have not received matching data.                               */
#define LPSPI_STS_RXMFLG_1                    1U      /* 1 : Have received matching data.                                   */

/* ==============================================  LPSPI STS BSYFLG [24..24]  =============================================== */
                                  /* LPSPI_STS_BSYFLG                                                         */
#define LPSPI_STS_BSYFLG_0                    0U      /* 0 : LPSPI is idle.                                                 */
#define LPSPI_STS_BSYFLG_1                    1U      /* 1 : LPSPI is busy.                                                 */

/* =========================================================  IEN  ========================================================= */
/* ===============================================  LPSPI IEN TXIEN [0..0]  =============================================== */
                                  /* LPSPI_IEN_TXIEN                                                        */
#define LPSPI_IEN_TXIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_TXIEN_1                   1U      /* 1 : Interrupt enabled                                              */

/* ===============================================  LPSPI IEN RXIEN [1..1]  =============================================== */
                                  /* LPSPI_IEN_RXIEN                                                        */
#define LPSPI_IEN_RXIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXIEN_1                   1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPSPI IEN RXWCIEN [8..8]  ============================================== */
                                  /* LPSPI_IEN_RXWCIEN                                                      */
#define LPSPI_IEN_RXWCIEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXWCIEN_1                 1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPSPI IEN FTCIEN [9..9]  =============================================== */
                                  /* LPSPI_IEN_FTCIEN                                                       */
#define LPSPI_IEN_FTCIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_FTCIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPSPI IEN TXCIEN [10..10]  ============================================== */
                                  /* LPSPI_IEN_TXCIEN                                                       */
#define LPSPI_IEN_TXCIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_TXCIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPSPI IEN TXEIEN [11..11]  ============================================== */
                                  /* LPSPI_IEN_TXEIEN                                                       */
#define LPSPI_IEN_TXEIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_TXEIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPSPI IEN RXEIEN [12..12]  ============================================== */
                                   /* LPSPI_IEN_RXEIEN                                                       */
#define LPSPI_IEN_RXEIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXEIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPSPI IEN RXMIEN [13..13]  ============================================== */
                                 /* LPSPI_IEN_RXMIEN                                                       */
#define LPSPI_IEN_RXMIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPSPI_IEN_RXMIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

