MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =========================================================  DMAEN  ========================================================= */
/* ==============================================  LPSPI DMAEN TXDMAEN [0..0]  ============================================== */
                                   /* LPSPI_DMAEN_TXDMAEN                                                      */
#define LPSPI_DMAEN_TXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPSPI_DMAEN_TXDMAEN_1                 1U      /* 1 : DMA request enabled                                            */

/* ==============================================  LPSPI DMAEN RXDMAEN [1..1]  ============================================== */
                               /* LPSPI_DMAEN_RXDMAEN                                                      */
#define LPSPI_DMAEN_RXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPSPI_DMAEN_RXDMAEN_1                 1U      /* 1 : DMA request enabled.                                           */

/* =========================================================  CFG0  ========================================================== */
/* ===============================================  LPSPI CFG0 HREQEN [0..0]  =============================================== */
                                    /* LPSPI_CFG0_MREQEN                                                        */
#define LPSPI_CFG0_MREQEN_0                   0U      /* 0 : Host request is disabled.                                      */
#define LPSPI_CFG0_MREQEN_1                   1U      /* 1 : Host request is enabled.                                       */

/* ==============================================  LPSPI CFG0 HREQPCFG [1..1]  ============================================== */
                                  /* LPSPI_CFG0_MREQPCFG                                                      */
#define LPSPI_CFG0_MREQPCFG_0                 0U      /* 0 : Active low.                                                    */
#define LPSPI_CFG0_MREQPCFG_1                 1U      /* 1 : Active high.                                                   */

/* ==============================================  LPSPI CFG0 HREQISEL [2..2]  ============================================== */
                                  /* LPSPI_CFG0_MREQISEL                                               */
#define LPSPI_CFG0_MREQISEL_0                 0U      /* 0 : Host request input is pin LPSPI_HREQ.                          */
#define LPSPI_CFG0_MREQISEL_1                 1U      /* 1 : Host request input is input trigger.                           */

/* ===============================================  LPSPI CFG0 CIRFEN [8..8]  =============================================== */
                                  /* LPSPI_CFG0_CIRFEN                                                        */
#define LPSPI_CFG0_CIRFEN_0                   0U      /* 0 : Circular FIFO is disabled.                                     */
#define LPSPI_CFG0_CIRFEN_1                   1U      /* 1 : Circular FIFO is enabled.                                      */

/* ===============================================  LPSPI CFG0 RXMOEN [9..9]  =============================================== */
                                   /* LPSPI_CFG0_RXMOEN                                                        */
#define LPSPI_CFG0_RXMOEN_0                   0U      /* 0 : Received data is stored in the receive FIFO as normal.         */
#define LPSPI_CFG0_RXMOEN_1                   1U      /* 1 : Received data is discarded unless the DMF is set.              */

/* =========================================================  CFG1  ========================================================== */
/* ===============================================  LPSPI CFG1 MSCFG [0..0]  ================================================ */
                              /* LPSPI_CFG1_MSCFG                                                         */
#define LPSPI_CFG1_MSCFG_0                    0U      /* 0 : Slave mode.                                                    */
#define LPSPI_CFG1_MSCFG_1                    1U      /* 1 : Master mode.                                                   */

/* ==============================================  LPSPI CFG1 IDSPCFG [1..1]  =============================================== */
                                /* LPSPI_CFG1_IDSPCFG                                                       */
#define LPSPI_CFG1_IDSPCFG_0                  0U      /* 0 : Input data sampled on SCK edge.                                */
#define LPSPI_CFG1_IDSPCFG_1                  1U      /* 1 : Input data sampled on delayed SCK edge.                        */

/* ===============================================  LPSPI CFG1 APCSEN [2..2]  =============================================== */
                                  /* LPSPI_CFG1_APCSEN                                                        */
#define LPSPI_CFG1_APCSEN_0                   0U      /* 0 : Automatic PCS generation disabled.                             */
#define LPSPI_CFG1_APCSEN_1                   1U      /* 1 : Automatic PCS generation enabled.                              */

/* ===============================================  LPSPI CFG1 DISTXS [3..3]  =============================================== */
                                  /* LPSPI_CFG1_DISTXS                                                        */
#define LPSPI_CFG1_DISTXS_0                   0U      /* 0 : Transfers will stall when transmit FIFO is empty or receive
                                                     FIFO is full.                                                             */
#define LPSPI_CFG1_DISTXS_1                   1U      /* 1 : Transfers will not stall  allowing transmit FIFO underrun
                                                     or receive FIFO overrun to occur.                                         */

/* =============================================  LPSPI CFG1 PCSPPCFG [8..11]  ============================================== */
                                /* LPSPI_CFG1_PCSPPCFG                                                      */
#define LPSPI_CFG1_PCSPPCFG_0000              0U      /* 0000 : The PCSx is active low.                                     */
#define LPSPI_CFG1_PCSPPCFG_0001              1U      /* 0001 : The PCSx is active high.                                    */

/* ===============================================  LPSPI CFG1 MCFG [16..18]  =============================================== */
                                  /* LPSPI_CFG1_MCFG                                                          */
#define LPSPI_CFG1_MCFG_000                   0U      /* 000 : Match is disabled.                                           */
#define LPSPI_CFG1_MCFG_010                   2U      /* 010 : 010b - Match is enabled  if 1st data word equals MATCH0
                                                     OR MATCH1  i.e.  (1st data word = MATCH0 + MATCH1)                        */
#define LPSPI_CFG1_MCFG_011                   3U      /* 011 : 011b - Match is enabled  if any data word equals MATCH0
                                                     OR MATCH1  i.e.  (any data word = MATCH0 + MATCH1)                        */
#define LPSPI_CFG1_MCFG_100                   4U      /* 100 : 100b - Match is enabled  if 1st data word equals MATCH0
                                                     AND 2nd data word equals MATCH1  i.e.  [(1st data word
                                                     = MATCH0) * (2nd data word = MATCH1)]                                     */
#define LPSPI_CFG1_MCFG_101                   5U      /* 101 : 101b - Match is enabled  if any data word equals MATCH0
                                                     AND the next data word equals MATCH1  i.e.  [(any data
                                                     word = MATCH0) * (next data word = MATCH1)]                               */
#define LPSPI_CFG1_MCFG_110                   6U      /* 110 : 110b - Match is enabled  if(1st data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1)  i.e.  [(1st data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */
#define LPSPI_CFG1_MCFG_111                   7U      /* 111 : 111b - Match is enabled  if(any data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1)  i.e.  [(any data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */

