MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===========================================  LPITMR CLRTMREN CLRTMREN1 [1..1]  ============================================ */
                                  /* LPITMR_CLRTMREN_CLRTMREN1                                          */
#define LPITMR_CLRTMREN_CLRTMREN1_0            0U      /* 0 : No Action                                                      */
#define LPITMR_CLRTMREN_CLRTMREN1_1            1U      /* 1 : Clear T_EN bit for Timer Channel 1                             */

/* ===========================================  LPITMR CLRTMREN CLRTMREN2 [2..2]  ============================================ */
                                 /* LPITMR_CLRTMREN_CLRTMREN2                                          */
#define LPITMR_CLRTMREN_CLRTMREN2_0            0U      /* 0 : No Action                                                      */
#define LPITMR_CLRTMREN_CLRTMREN2_1            1U      /* 1 : Clear T_EN bit for Timer Channel 2                             */

/* ===========================================  LPITMR CLRTMREN CLRTMREN3 [3..3]  ============================================ */
                                  /* LPITMR_CLRTMREN_CLRTMREN3                                          */
#define LPITMR_CLRTMREN_CLRTMREN3_0            0U      /* 0 : No Action                                                      */
#define LPITMR_CLRTMREN_CLRTMREN3_1            1U      /* 1 : Clear T_EN bit for Timer Channel 3                             */

/* ========================================================  TMRV  ======================================================== */
/* ==============================================  LPITMR TMRV TMRV [0..31]  ============================================== */
                                  /* LPITMR_TMRV_TMRV                                                */
#define LPITMR_TMRV_TMRV_0                  0U      /* 0 : Invalid load value in compare modes.                           */
#define LPITMR_TMRV_TMRV_1                  1U      /* 1 : Invalid load value in compare modes.                           */

/* =======================================================  CTMRV  ======================================================== */
/* =======================================================  TMRCTRL  ======================================================== */
/* =============================================  LPITMR TMRCTRL TMREN [0..0]  ============================================== */
                                  /* LPITMR_TMRCTRL_TMREN                                              */
#define LPITMR_TMRCTRL_TMREN_0                0U      /* 0 : Timer Channel is disabled                                      */
#define LPITMR_TMRCTRL_TMREN_1                1U      /* 1 : Timer Channel is enabled                                       */

/* ============================================  LPITMR TMRCTRL CHAINEN [1..1]  ============================================= */
                                  /* LPITMR_TMRCTRL_CHAINEN                                            */
#define LPITMR_TMRCTRL_CHAINEN_0              0U      /* 0 : Channel Chaining is disabled. Channel Timer runs independently.*/
#define LPITMR_TMRCTRL_CHAINEN_1              1U      /* 1 : Channel Chaining is enabled. Timer decrements on previous
                                                     channels timeout                                            */

/* ============================================  LPITMR TMRCTRL TMROMCFG [2..3]  ============================================ */
                                   /* LPITMR_TMRCTRL_TMROMCFG                                           */
#define LPITMR_TMRCTRL_TMROMCFG_0             0U      /* 0 : 32-bit Periodic Counter                                        */
#define LPITMR_TMRCTRL_TMROMCFG_1             1U      /* 1 : Dual 16-bit Periodic Counter                                   */
#define LPITMR_TMRCTRL_TMROMCFG_10            2U      /* 10 : 32-bit Trigger Accumulator                                    */
#define LPITMR_TMRCTRL_TMROMCFG_11            3U      /* 11 : 32-bit Trigger Input Capture                                  */

/* ===========================================  LPITMR TMRCTRL TMRDCTRL [16..16]  =========================================== */
                                  /* LPITMR_TMRCTRL_TMRDCTRL                                           */
#define LPITMR_TMRCTRL_TMRDCTRL_0             0U      /* 0 : Timer starts to decrement immediately based on restart condition
                                                     (controlled by TSOI bit)                                           */
#define LPITMR_TMRCTRL_TMRDCTRL_1             1U      /* 1 : Timer starts to decrement when rising edge on selected trigger
                                                     is detected                                                        */

/* ==========================================  LPITMR TMRCTRL TMRTOSCTRL [17..17]  ========================================== */
                                   /* LPITMR_TMRCTRL_TMRTOSCTRL                                         */
#define LPITMR_TMRCTRL_TMRTOSCTRL_0           0U      /* 0 : The channel timer does not stop after timeout.                 */
#define LPITMR_TMRCTRL_TMRTOSCTRL_1           1U      /* 1 : The channel timer will stop after a timeout  and the channel
                                                     timer will restart based on TSOT. When TSOT = 0  the channel
                                                     timer will restart after a rising edge on the T_EN bit
                                                     is detected (which means that the timer channel is disabled
                                                     and then enabled); when TSOT = 1  the channel timer will
                                                     restart after a rising edge on the selected trigger is
                                                     detected.                                                          */

/* ===========================================  LPITMR TMRCTRL TMRRCTRL [18..18]  =========================================== */
                                  /* LPITMR_TMRCTRL_TMRRCTRL                                           */
#define LPITMR_TMRCTRL_TMRRCTRL_0             0U      /* 0 : Timer will not reload on selected trigger                      */
#define LPITMR_TMRCTRL_TMRRCTRL_1             1U      /* 1 : Timer will reload on selected trigger                          */

