MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  RTC IEN SECIEN [4..4]  ================================================ */
                                  /* RTC_IEN_SECIEN                                                   */
#define RTC_IEN_SECIEN_0                     0U      /* 0 : Seconds interrupt is disabled.                                 */
#define RTC_IEN_SECIEN_1                     1U      /* 1 : Seconds interrupt is enabled.                                  */

/* =============================================  RTC IEN TSECICFG [16..18]  ============================================= */
                                   /* RTC_IEN_TSECICFG                                               */
#define RTC_IEN_TSECICFG_000               0U      /* 000 : 1 Hz.                                                        */
#define RTC_IEN_TSECICFG_001               1U      /* 001 : 2 Hz.                                                        */
#define RTC_IEN_TSECICFG_010               2U      /* 010 : 4 Hz.                                                        */
#define RTC_IEN_TSECICFG_011               3U      /* 011 : 8 Hz.                                                        */
#define RTC_IEN_TSECICFG_100               4U      /* 100 : 16 Hz.                                                       */
#define RTC_IEN_TSECICFG_101               5U      /* 101 : 32 Hz.                                                       */
#define RTC_IEN_TSECICFG_110               6U      /* 110 : 64 Hz.                                                       */
#define RTC_IEN_TSECICFG_111               7U      /* 111 : 128 Hz.                                                      */



/* =========================================================================================================================== */
/* ================                                           LPTMR                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CSTS  ========================================================== */
/* ===============================================  LPTMR CSTS LPTMREN [0..0]  =============================================== */
                                   /* LPTMR_CSTS_LPTMREN                                                 */
#define LPTMR_CSTS_LPTMREN_0                   0U      /* 0 : LPTMR is disabled and internal logic is reset.                 */
#define LPTMR_CSTS_LPTMREN_1                   1U      /* 1 : LPTMR is enabled.                                              */

/* ===============================================  LPTMR CSTS TMRMCFG [1..1]  =============================================== */
                                   /* LPTMR_CSTS_TMRMCFG                                                 */
#define LPTMR_CSTS_TMRMCFG_0                   0U      /* 0 : Time Counter mode.                                             */
#define LPTMR_CSTS_TMRMCFG_1                   1U      /* 1 : Pulse Counter mode.                                            */

/* ================================================  LPTMR CSTS FRCNT [2..2]  ================================================ */
                                   /* LPTMR_CSTS_FRCNT                                                   */
#define LPTMR_CSTS_FRCNT_0                     0U      /* 0 : CNR is reset whenever TCF is set.                              */
#define LPTMR_CSTS_FRCNT_1                     1U      /* 1 : CNR is reset on overflow.                                      */

/* ===============================================  LPTMR CSTS TPIMSEL [3..3]  =============================================== */
                                  /* LPTMR_CSTS_TPIMSEL                                                 */
#define LPTMR_CSTS_TPIMSEL_0                   0U      /* 0 : Pulse Counter input source is active-high  and the CNR will
                                                     increment on the rising-edge.                                      */
#define LPTMR_CSTS_TPIMSEL_1                   1U      /* 1 : Pulse Counter input source is active-low  and the CNR will
                                                     increment on the falling-edge.                                     */

/* ===============================================  LPTMR CSTS TPISEL [4..5]  ================================================ */
                                  /* LPTMR_CSTS_TPISEL                                                  */
#define LPTMR_CSTS_TPISEL_00                   0U      /* 00 : Pulse counter input 0 is selected.                            */
#define LPTMR_CSTS_TPISEL_01                   1U      /* 01 : Pulse counter input 1 is selected.                            */
#define LPTMR_CSTS_TPISEL_10                   2U      /* 10 : Pulse counter input 2 is selected.                            */
#define LPTMR_CSTS_TPISEL_11                   3U      /* 11 : Pulse counter input 3 is selected.                            */

/* =================================================  LPTMR CSTS IEN [6..6]  ================================================= */
                                  /* LPTMR_CSTS_IEN                                                     */
#define LPTMR_CSTS_IEN_0                       0U      /* 0 : Timer interrupt disabled.                                      */
#define LPTMR_CSTS_IEN_1                       1U      /* 1 : Timer interrupt enabled.                                       */

/* ===============================================  LPTMR CSTS COMFLG [7..7]  ================================================ */
                                   /* LPTMR_CSTS_COMFLG                                                  */
#define LPTMR_CSTS_COMFLG_0                    0U      /* 0 : The value of CNR is not equal to CMR and increments.           */
#define LPTMR_CSTS_COMFLG_1                    1U      /* 1 : The value of CNR is equal to CMR and increments.               */

/* ===============================================  LPTMR CSTS DMAREN [8..8]  ================================================ */
                                   /* LPTMR_CSTS_DMAREN                                                  */
#define LPTMR_CSTS_DMAREN_0                    0U      /* 0 : Timer DMA Request disabled.                                    */
#define LPTMR_CSTS_DMAREN_1                    1U      /* 1 : Timer DMA Request enabled.                                     */

/* ==========================================================  PSC  ========================================================== */
/* ===============================================  LPTMR PSC PCLKSEL [0..1]  ================================================ */
                                   /* LPTMR_PSC_PCLKSEL                                                  */
#define LPTMR_PSC_PCLKSEL_00                   0U      /* 00 : Prescaler/glitch filter clock 0 selected.                     */
#define LPTMR_PSC_PCLKSEL_01                   1U      /* 01 : Prescaler/glitch filter clock 1 selected.                     */
#define LPTMR_PSC_PCLKSEL_10                   2U      /* 10 : Prescaler/glitch filter clock 2 selected.                     */
#define LPTMR_PSC_PCLKSEL_11                   3U      /* 11 : Prescaler/glitch filter clock 3 selected.                     */

/* ================================================  LPTMR PSC PBYPEN [2..2]  ================================================ */
                                   /* LPTMR_PSC_PBYPEN                                                   */
#define LPTMR_PSC_PBYPEN_0                     0U      /* 0 : Prescaler/glitch filter is enabled.                            */
#define LPTMR_PSC_PBYPEN_1                     1U      /* 1 : Prescaler/glitch filter is bypassed.                           */

/* ================================================  LPTMR PSC PVCFG [3..6]  ================================================= */
                                  /* LPTMR_PSC_PVCFG                                                    */
#define LPTMR_PSC_PVCFG_0000                   0U      /* 0000 : Prescaler divides the prescaler clock by 2; glitch filter
                                                     does not support this configuration.                               */
#define LPTMR_PSC_PVCFG_0001                   1U      /* 0001 : Prescaler divides the prescaler clock by 4; glitch filter
                                                     recognizes change on input pin after 2 rising clock edges.         */
#define LPTMR_PSC_PVCFG_0010                   2U      /* 0010 : Prescaler divides the prescaler clock by 8; glitch filter
                                                     recognizes change on input pin after 4 rising clock edges.         */
#define LPTMR_PSC_PVCFG_0011                   3U      /* 0011 : Prescaler divides the prescaler clock by 16; glitch filter
                                                     recognizes change on input pin after 8 rising clock edges.         */
#define LPTMR_PSC_PVCFG_0100                   4U      /* 0100 : Prescaler divides the prescaler clock by 32; glitch filter
                                                     recognizes change on input pin after 16 rising clock edges.        */
#define LPTMR_PSC_PVCFG_0101                   5U      /* 0101 : Prescaler divides the prescaler clock by 64; glitch filter
                                                     recognizes change on input pin after 32 rising clock edges.        */
#define LPTMR_PSC_PVCFG_0110                   6U      /* 0110 : Prescaler divides the prescaler clock by 128; glitch
                                                     filter recognizes change on input pin after 64 rising clock
                                                     edges.                                                             */
#define LPTMR_PSC_PVCFG_0111                   7U      /* 0111 : Prescaler divides the prescaler clock by 256; glitch
                                                     filter recognizes change on input pin after 128 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1000                   8U      /* 1000 : Prescaler divides the prescaler clock by 512; glitch
                                                     filter recognizes change on input pin after 256 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1001                   9U      /* 1001 : Prescaler divides the prescaler clock by 1024; glitch
                                                     filter recognizes change on input pin after 512 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1010                   10U     /* 1010 : Prescaler divides the prescaler clock by 2048; glitch
                                                     filter recognizes change on input pin after 1024 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1011                   11U     /* 1011 : Prescaler divides the prescaler clock by 4096; glitch
                                                     filter recognizes change on input pin after 2048 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1100                   12U     /* 1100 : Prescaler divides the prescaler clock by 8192; glitch
                                                     filter recognizes change on input pin after 4096 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1101                   13U     /* 1101 : Prescaler divides the prescaler clock by 16 384; glitch
                                                     filter recognizes change on input pin after 8192 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1110                   14U     /* 1110 : Prescaler divides the prescaler clock by 32 768; glitch
                                                     filter recognizes change on input pin after 16 384 rising
                                                     clock edges.                                                       */
#define LPTMR_PSC_PVCFG_1111                   15U     /* 1111 : Prescaler divides the prescaler clock by 65 536; glitch
                                                     filter recognizes change on input pin after 32 768 rising
                                                     clock edges.                                                       */


/* =========================================================  COMP  ========================================================== */
/* ==========================================================  CNT  ========================================================== */


/* =========================================================================================================================== */
/* ================                                            SIM                                            ================ */
/* =========================================================================================================================== */

