MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =======================================================  CHIPCTRL  ======================================================== */
/* =============================================  SIM CHIPCTRL ADCIPSEL [0..3]  ============================================== */
                                  /* SIM_CHIPCTRL_ADCIPSEL                                              */
#define SIM_CHIPCTRL_ADCIPSEL_0000             0U      /* 0000 : Interleaving disabled. No channel pair interleaved. Interleaved
                                                     channels are individually connected to pins. PTC0 is connected
                                                     to ADC0_SE8. PTC1 is connected to ADC0_SE9. PTB15 is connected
                                                     to ADC1_SE14. PTB16 is connected to ADC1_SE15. PTB0 is
                                                     connected to ADC0_SE4. PTB1 is connected to ADC0_SE5. PTB13
                                                     is connected to ADC1_SE8. PTB14 is connected to ADC1_SE9.          */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_8           8U      /* 1xxx_8 : PTB14 to ADC1_SE9 and ADC0_SE9                */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_9           9U      /* 1xxx_9 : PTB14 to ADC1_SE9 and ADC0_SE9                            */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_10          10U     /* 1xxx_10 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_11          11U     /* 1xxx_11 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_12          12U     /* 1xxx_12 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_13          13U     /* 1xxx_13 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_14          14U     /* 1xxx_14 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_1xxx_15          15U     /* 1xxx_15 : PTB14 to ADC1_SE9 and ADC0_SE9                           */
#define SIM_CHIPCTRL_ADCIPSEL_x1xx_4           4U      /* x1xx_4 : PTB13 to ADC1_SE8 and ADC0_SE8                            */
#define SIM_CHIPCTRL_ADCIPSEL_x1xx_5           5U      /* x1xx_5 : PTB13 to ADC1_SE8 and ADC0_SE8                            */
#define SIM_CHIPCTRL_ADCIPSEL_x1xx_6           6U      /* x1xx_6 : PTB13 to ADC1_SE8 and ADC0_SE8                            */
#define SIM_CHIPCTRL_ADCIPSEL_x1xx_7           7U      /* x1xx_7 : PTB13 to ADC1_SE8 and ADC0_SE8                            */
#define SIM_CHIPCTRL_ADCIPSEL_xx1x_2           2U      /* xx1x_2 : PTB1 to ADC0_SE5 and ADC1_SE15                            */
#define SIM_CHIPCTRL_ADCIPSEL_xx1x_3           3U      /* xx1x_3 : PTB1 to ADC0_SE5 and ADC1_SE15                            */
#define SIM_CHIPCTRL_ADCIPSEL_xxx1_1           1U      /* xxx1_1 : PTB0 to ADC0_SE4 and ADC1_SE14                            */

/* =============================================  SIM CHIPCTRL CLKOUTSEL [4..7]  ============================================= */
                                  /* SIM_CHIPCTRL_CLKOUTSEL                                             */
#define SIM_CHIPCTRL_CLKOUTSEL_0000            0U      /* 0000 : SCG CLKOUT                                                  */
#define SIM_CHIPCTRL_CLKOUTSEL_0010            2U      /* 0010 : SYSOSC DIV2 CLK                                               */
#define SIM_CHIPCTRL_CLKOUTSEL_0100            4U      /* 0100 : LSI DIV2 CLK                                               */
#define SIM_CHIPCTRL_CLKOUTSEL_0101            5U      /* 0101 :  QSPI SFIF_CLK_HYP: Divide by 2 clock (configured
                                                     through SCLKCONFIG[5]) for HyperRAM going to sfif clock
                                                     to QSPI; For others: Reserved                                      */
#define SIM_CHIPCTRL_CLKOUTSEL_0110            6U      /* 0110 : HSI DIV2 CLK                                               */
#define SIM_CHIPCTRL_CLKOUTSEL_0111            7U      /* 0111 : HCLK                                                        */
#define SIM_CHIPCTRL_CLKOUTSEL_1000            8U      /* 1000 : SYSPLL DIV2 CLK                                               */
#define SIM_CHIPCTRL_CLKOUTSEL_1001            9U      /* 1001 : BUS_CLK                                                     */
#define SIM_CHIPCTRL_CLKOUTSEL_1010            10U     /* 1010 : LPO128K_CLK                                                 */
#define SIM_CHIPCTRL_CLKOUTSEL_1011            11U     /* 1011 :  QSPI IPG_CLK; For others: Reserved             */
#define SIM_CHIPCTRL_CLKOUTSEL_1100            12U     /* 1100 : LPO_CLK as selected by SIM_LPOCLKS[LPOCLKSEL]               */
#define SIM_CHIPCTRL_CLKOUTSEL_1101            13U     /* 1101 :  QSPI IPG_CLK_SFIF; For others: Reserved        */
#define SIM_CHIPCTRL_CLKOUTSEL_1110            14U     /* 1110 : RTC_CLK as selected by SIM_LPOCLKS[RTCCLKSEL]               */
#define SIM_CHIPCTRL_CLKOUTSEL_1111            15U     /* 1111 :  QSPI IPG_CLK_2XSFIF; For others: Reserved      */

/* ===========================================  SIM CHIPCTRL CLKOUTDIVCFG [8..10]  =========================================== */
                                   /* SIM_CHIPCTRL_CLKOUTDIVCFG                                          */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_000          0U      /* 000 : Divide by 1                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_001          1U      /* 001 : Divide by 2                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_010          2U      /* 010 : Divide by 3                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_011          3U      /* 011 : Divide by 4                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_100          4U      /* 100 : Divide by 5                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_101          5U      /* 101 : Divide by 6                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_110          6U      /* 110 : Divide by 7                                                  */
#define SIM_CHIPCTRL_CLKOUTDIVCFG_111          7U      /* 111 : Divide by 8                                                  */

