MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ============================================  SIM CHIPCTRL CLKOUTEN [11..11]  ============================================ */
                                  /* SIM_CHIPCTRL_CLKOUTEN                                             */
#define SIM_CHIPCTRL_CLKOUTEN_0               0U      /* 0 : Clockout disable                                               */
#define SIM_CHIPCTRL_CLKOUTEN_1               1U      /* 1 : Clockout enable                                                */

/* ===========================================  SIM CHIPCTRL TRACECLKSEL [12..12]  =========================================== */
                                   /* SIM_CHIPCTRL_TRACECLKSEL                                           */
#define SIM_CHIPCTRL_TRACECLKSEL_0             0U      /* 0 : Core clock                                                     */
#define SIM_CHIPCTRL_TRACECLKSEL_1             1U      /* 1 : Platform clock                                                 */

/* ============================================  SIM CHIPCTRL PDUBBMSEL [13..13]  ============================================ */
                                 /* SIM_CHIPCTRL_PDUBBMSEL                                             */
#define SIM_CHIPCTRL_PDUBBMSEL_0               0U      /* 0 : PDU0 channel 0 back-to-back operation with ADC0 COCO[7:0]
                                                     and PDU1 channel 0 back-to-back operation with ADC1 COCO[7:0]      */
#define SIM_CHIPCTRL_PDUBBMSEL_1               1U      /* 1 : Channel 0 of PDU0 and PDU1 back-to-back operation with COCO[7:0]
                                                     of ADC0 and ADC1.                                                  */

/* =============================================  SIM CHIPCTRL ADCSSEL [16..18]  ============================================= */
                                  /* SIM_CHIPCTRL_ADCSSEL                                               */
#define SIM_CHIPCTRL_ADCSSEL_000             = 0U      /* 000 : 5 V input VDD supply (VDD)                                   */
#define SIM_CHIPCTRL_ADCSSEL_001             = 1U      /* 001 : 5 V input analog supply (VDDA)                               */
#define SIM_CHIPCTRL_ADCSSEL_010             = 2U      /* 010 : ADC Reference Supply (VREFH)                                 */
#define SIM_CHIPCTRL_ADCSSEL_011             = 3U      /* 011 : 3.3 V Oscillator Regulator Output (VDD_3V)                   */
#define SIM_CHIPCTRL_ADCSSEL_100             = 4U      /* 100 : 3.3 V flash regulator output (VDD_flash_3V)                  */
#define SIM_CHIPCTRL_ADCSSEL_101             = 5U      /* 101 : 1.2 V core regulator output (VDD_LV)                         */

/* ============================================  SIM CHIPCTRL ADCISMEN [19..19]  ============================================= */
                                /* SIM_CHIPCTRL_ADCISMEN                                              */
#define SIM_CHIPCTRL_ADCISMEN_0                0U      /* 0 : Disable internal supply monitoring                             */
#define SIM_CHIPCTRL_ADCISMEN_1                1U      /* 1 : Enable internal supply monitoring                              */

/* ============================================  SIM CHIPCTRL SRAMHREN [20..20]  ============================================= */
                                  /* SIM_CHIPCTRL_SRAMUREN                                              */
#define SIM_CHIPCTRL_SRAMUREN_0                0U      /* 0 : SRAMU contents are retained across resets                      */
#define SIM_CHIPCTRL_SRAMUREN_1                1U      /* 1 : No SRAMU retention                                             */

/* ============================================  SIM CHIPCTRL SRAMLREN [21..21]  ============================================= */
                                 /* SIM_CHIPCTRL_SRAMLREN                                              */
#define SIM_CHIPCTRL_SRAMLREN_0                0U      /* 0 : SRAML contents are retained across resets                      */
#define SIM_CHIPCTRL_SRAMLREN_1                1U      /* 1 : No SRAML retention                                             */

/* =======================================================  CFGTMROPT0  ======================================================== */
/* ============================================  SIM CFGTMROPT0 CFGTMR0FSxSEL [0..2]  ============================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR0FSxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR0FSxSEL_000            0U      /* 000 : CFGTMR0_FLTx pin                                                */
#define SIM_CFGTMROPT0_CFGTMR0FSxSEL_001            1U      /* 001 : TRGMUX_CFGTMR0 out                                              */

/* ============================================  SIM CFGTMROPT0 CFGTMR1FSxSEL [4..6]  ============================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR1FSxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR1FSxSEL_000            0U      /* 000 : CFGTMR1_FLTx pin                                                */
#define SIM_CFGTMROPT0_CFGTMR1FSxSEL_001            1U      /* 001 : TRGMUX_CFGTMR1 out                                              */

/* ============================================  SIM CFGTMROPT0 CFGTMR2FSxSEL [8..10]  ============================================ */
                                  /* SIM_CFGTMROPT0_CFGTMR2FSxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR2FSxSEL_000            0U      /* 000 : CFGTMR2_FLTx pin                                                */
#define SIM_CFGTMROPT0_CFGTMR2FSxSEL_001            1U      /* 001 : TRGMUX_CFGTMR2 out                                              */

/* ===========================================  SIM CFGTMROPT0 CFGTMR3FSxSEL [12..14]  ============================================ */
                                 /* SIM_CFGTMROPT0_CFGTMR3FSxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR3FSxSEL_000            0U      /* 000 : CFGTMR3_FLTx pin                                                */
#define SIM_CFGTMROPT0_CFGTMR3FSxSEL_001            1U      /* 001 : TRGMUX_CFGTMR3 out                                              */

