MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===========================================  SIM CFGTMROPT0 CFGTMR4TCLKxSEL [12..14]  ============================================ */
                                 /* SIM_CFGTMROPT0_CFGTMR4TCLKxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR4TCLKxSEL_000            0U      /* 000 : CFGTMR4 external clock driven by TCLK0 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR4TCLKxSEL_001            1U      /* 001 : CFGTMR4 external clock driven by TCLK1 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR4TCLKxSEL_010            0U      /* 000 : CFGTMR4 external clock driven by TCLK2 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR4TCLKxSEL_011            1U      /* 001 : No clock input                                                */

/* ===========================================  SIM CFGTMROPT0 CFGTMR5TCLKxSEL [12..14]  ============================================ */
                                 /* SIM_CFGTMROPT0_CFGTMR5TCLKxSEL                                            */
#define SIM_CFGTMROPT0_CFGTMR5TCLKxSEL_000            0U      /* 000 : CFGTMR5 external clock driven by TCLK0 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR5TCLKxSEL_001            1U      /* 001 : CFGTMR5 external clock driven by TCLK1 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR5TCLKxSEL_010            0U      /* 000 : CFGTMR5 external clock driven by TCLK2 pin.                     */
#define SIM_CFGTMROPT0_CFGTMR5TCLKxSEL_011            1U      /* 001 : No clock input                                                */

/* ========================================  SIM CFGTMROPT0 CFGTMR0EXCLKPINSEL [24..25]  ========================================= */
                                   /* SIM_CFGTMROPT0_CFGTMR0EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR0EXCLKPINSEL_00       0U      /* 00 : CFGTMR0 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR0EXCLKPINSEL_01       1U      /* 01 : CFGTMR0 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR0EXCLKPINSEL_10       2U      /* 10 : CFGTMR0 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR0EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* ========================================  SIM CFGTMROPT0 CFGTMR1EXCLKPINSEL [26..27]  ========================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR1EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR1EXCLKPINSEL_00       0U      /* 00 : CFGTMR1 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR1EXCLKPINSEL_01       1U      /* 01 : CFGTMR1 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR1EXCLKPINSEL_10       2U      /* 10 : CFGTMR1 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR1EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* ========================================  SIM CFGTMROPT0 CFGTMR2EXCLKPINSEL [28..29]  ========================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_00       0U      /* 00 : CFGTMR2 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_01       1U      /* 01 : CFGTMR2 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_10       2U      /* 10 : CFGTMR2 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR2EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* ========================================  SIM CFGTMROPT0 CFGTMR3EXCLKPINSEL [30..31]  ========================================= */
                                  /* SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL                                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_00       0U      /* 00 : CFGTMR3 external clock driven by TCLK0 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_01       1U      /* 01 : CFGTMR3 external clock driven by TCLK1 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_10       2U      /* 10 : CFGTMR3 external clock driven by TCLK2 pin.                      */
#define SIM_CFGTMROPT0_CFGTMR3EXCLKPINSEL_11       3U      /* 11 : No clock input                                                */

/* =======================================================  LPOCLKSEL  ======================================================= */
/* ===========================================  SIM LPOCLKSEL LPO1KCLKOEN [0..0]  ============================================ */
                                 /* SIM_LPOCLKSEL_LPO1KCLKOEN                                          */
#define SIM_LPOCLKSEL_LPO1KCLKOEN_0            0U      /* 0 : Disable 1 kHz LPO_CLK output                                   */
#define SIM_LPOCLKSEL_LPO1KCLKOEN_1            1U      /* 1 : Enable 1 kHz LPO_CLK output                                    */

/* ===========================================  SIM LPOCLKSEL LPO32KCLKOEN [1..1]  =========================================== */
                                   /* SIM_LPOCLKSEL_LPO32KCLKOEN                                         */
#define SIM_LPOCLKSEL_LPO32KCLKOEN_0           0U      /* 0 : Disable 32 kHz LPO_CLK output                                  */
#define SIM_LPOCLKSEL_LPO32KCLKOEN_1           1U      /* 1 : Enable 32 kHz LPO_CLK output                                   */

/* ============================================  SIM LPOCLKSEL CLKLPOSSEL [2..3]  ============================================ */
                                  /* SIM_LPOCLKSEL_CLKLPOSSEL                                           */
#define SIM_LPOCLKSEL_CLKLPOSSEL_00            0U      /* 00 : 128 kHz LPO_CLK                                               */
#define SIM_LPOCLKSEL_CLKLPOSSEL_01            1U      /* 01 : No clock                                                      */
#define SIM_LPOCLKSEL_CLKLPOSSEL_10            2U      /* 10 : 32 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK      */
#define SIM_LPOCLKSEL_CLKLPOSSEL_11            3U      /* 11 : 1 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK       */

/* ============================================  SIM LPOCLKSEL CLK32KSSEL [4..5]  ============================================ */
                                  /* SIM_LPOCLKSEL_CLK32KSSEL                                           */
#define SIM_LPOCLKSEL_CLK32KSSEL_00            0U      /* 00 : SYSOSCDIV1_CLK                                                  */
#define SIM_LPOCLKSEL_CLK32KSSEL_01            1U      /* 01 : 32 kHz LPO_CLK                                                */
#define SIM_LPOCLKSEL_CLK32KSSEL_10            2U      /* 10 : RTC_CLKIN clock                                               */
#define SIM_LPOCLKSEL_CLK32KSSEL_11            3U      /* 11 : HSIDIV1_CLK                                                  */

/* ========================================================  ADCOPT  ========================================================= */
/* =============================================  SIM ADCOPT ADC0TRGSSEL [0..0]  ============================================= */
                                   /* SIM_ADCOPT_ADC0TRGSSEL                                             */
#define SIM_ADCOPT_ADC0TRGSSEL_0               0U      /* 0 : PDU output                                                     */
#define SIM_ADCOPT_ADC0TRGSSEL_1               1U      /* 1 : TRGMUX output                                                  */

