MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =============================================  SIM ADCOPT ADC0SWPTSEL [1..3]  ============================================= */
                                   /* SIM_ADCOPT_ADC0SWPTSEL                                             */
#define SIM_ADCOPT_ADC0SWPTSEL_000             0U      /* 000 : Software pretrigger disabled                                 */
#define SIM_ADCOPT_ADC0SWPTSEL_001             1U      /* 001 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_010             2U      /* 010 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_011             3U      /* 011 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_100             4U      /* 100 : Software pretrigger 0                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_101             5U      /* 101 : Software pretrigger 1                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_110             6U      /* 110 : Software pretrigger 2                                        */
#define SIM_ADCOPT_ADC0SWPTSEL_111             7U      /* 111 : Software pretrigger 3                                        */

/* =============================================  SIM ADCOPT ADC0PTSSEL [4..5]  ============================================== */
                                  /* SIM_ADCOPT_ADC0PTSSEL                                              */
#define SIM_ADCOPT_ADC0PTSSEL_00               0U      /* 00 : PDU pretrigger (default)                                      */
#define SIM_ADCOPT_ADC0PTSSEL_01               1U      /* 01 : TRGMUX pretrigger                                             */
#define SIM_ADCOPT_ADC0PTSSEL_10               2U      /* 10 : Software pretrigger                                           */

/* =============================================  SIM ADCOPT ADC1TRGSSEL [8..8]  ============================================= */
                                  /* SIM_ADCOPT_ADC1TRGSSEL                                             */
#define SIM_ADCOPT_ADC1TRGSSEL_0               0U      /* 0 : PDU output                                                     */
#define SIM_ADCOPT_ADC1TRGSSEL_1               1U      /* 1 : TRGMUX output                                                  */

/* ============================================  SIM ADCOPT ADC1SWPTSEL [9..11]  ============================================= */
                                /* SIM_ADCOPT_ADC1SWPTSEL                                             */
#define SIM_ADCOPT_ADC1SWPTSEL_000             0U      /* 000 : Software pretrigger disabled                                 */
#define SIM_ADCOPT_ADC1SWPTSEL_001             1U      /* 001 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_010             2U      /* 010 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_011             3U      /* 011 : Reserved (do not use)                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_100             4U      /* 100 : Software pretrigger 0                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_101             5U      /* 101 : Software pretrigger 1                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_110             6U      /* 110 : Software pretrigger 2                                        */
#define SIM_ADCOPT_ADC1SWPTSEL_111             7U      /* 111 : Software pretrigger 3                                        */

/* ============================================  SIM ADCOPT ADC1PTSSEL [12..13]  ============================================= */
                                   /* SIM_ADCOPT_ADC1PTSSEL                                              */
#define SIM_ADCOPT_ADC1PTSSEL_00               0U      /* 00 : PDU pretrigger (default)                                      */
#define SIM_ADCOPT_ADC1PTSSEL_01               1U      /* 01 : TRGMUX pretrigger                                             */
#define SIM_ADCOPT_ADC1PTSSEL_10               2U      /* 10 : Software pretrigger                                           */

/* =======================================================  CFGTMROPT1  ======================================================== */
/* ===========================================  SIM CFGTMROPT1 CFGTMR1CH0ISEL [4..5]  ============================================ */
                                  /* SIM_CFGTMROPT1_CFGTMR1CH0ISEL                                          */
#define SIM_CFGTMROPT1_CFGTMR1CH0ISEL_00           0U      /* 00 : CFGTMR1_CH0 input                                                */
#define SIM_CFGTMROPT1_CFGTMR1CH0ISEL_01           1U      /* 01 : CMP0 output                                                   */

/* ===========================================  SIM CFGTMROPT1 CFGTMR2CH0ISEL [6..7]  ============================================ */
                                /* SIM_CFGTMROPT1_CFGTMR2CH0ISEL                                          */
#define SIM_CFGTMROPT1_CFGTMR2CH0ISEL_00           0U      /* 00 : CFGTMR2_CH0 input                                                */
#define SIM_CFGTMROPT1_CFGTMR2CH0ISEL_01           1U      /* 01 : CMP0 output                                                   */

/* ===========================================  SIM CFGTMROPT1 CFGTMR2CH1ISEL [8..8]  ============================================ */
                                  /* SIM_CFGTMROPT1_CFGTMR2CH1ISEL                                          */
#define SIM_CFGTMROPT1_CFGTMR2CH1ISEL_0            0U      /* 0 : CFGTMR2_CH1 input                                                 */
#define SIM_CFGTMROPT1_CFGTMR2CH1ISEL_1            1U      /* 1 : exclusive OR of CFGTMR2_CH0 CFGTMR2_CH1 and CFGTMR1_CH1                 */

/* ===========================================  SIM CFGTMROPT1 CFGTMRGLDMEN [15..15]  ============================================ */
                                 /* SIM_CFGTMROPT1_CFGTMRGLDMEN                                            */
#define SIM_CFGTMROPT1_CFGTMRGLDMEN_0              0U      /* 0 : CFGTMR Global load mechanism disabled.                            */
#define SIM_CFGTMROPT1_CFGTMRGLDMEN_1              1U      /* 1 : CFGTMR Global load mechanism enabled                              */

