MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ============================================  SIM CFGTMROPT1 CFGTMR0MEN [16..23]  ============================================= */
                                   /* SIM_CFGTMROPT1_CFGTMR0MEN                                              */
#define SIM_CFGTMROPT1_CFGTMR0MEN_00000000         0U      /* 00000000 : No modulation with CFGTMR1_CH1                             */
#define SIM_CFGTMROPT1_CFGTMR0MEN_00000001         1U      /* 00000001 : Modulation with CFGTMR1_CH1                                */

/* ============================================  SIM CFGTMROPT1 CFGTMR3MEN [24..31]  ============================================= */
                                   /* SIM_CFGTMROPT1_CFGTMR3MEN                                              */
#define SIM_CFGTMROPT1_CFGTMR3MEN_00000000         0U      /* 00000000 : No modulation with CFGTMR2_CH1                             */
#define SIM_CFGTMROPT1_CFGTMR3MEN_00000001         1U      /* 00000001 : Modulation with CFGTMR2_CH1                                */

/* ========================================================  MCTRL0  ========================================================= */
/* ==============================================  SIM MCTRL0 STOP1MON [9..9]  =============================================== */
                                  /* SIM_MCTRL0_STOP1MON                                                */
#define SIM_MCTRL0_STOP1MON_0                  0U      /* 0 : Bus clock enabled or STOP1 entry aborted                       */
#define SIM_MCTRL0_STOP1MON_1                  1U      /* 1 : STOP1 entry successful                                         */

/* =============================================  SIM MCTRL0 STOP2MON [10..10]  ============================================== */
                                  /* SIM_MCTRL0_STOP2MON                                                */
#define SIM_MCTRL0_STOP2MON_0                  0U      /* 0 : System clock enabled or STOP2 entry aborted                    */
#define SIM_MCTRL0_STOP2MON_1                  1U      /* 1 : STOP2 entry successful                                         */

/* ============================================  SIM MCTRL0 CFGTMRSTBEN_D [14..14]  ============================================ */
                                 /* SIM_MCTRL0_CFGTMRSTBEN_D                                             */
#define SIM_MCTRL0_CFGTMRSTBEN_D_0               0U      /* 0 : All the CFGTMRs have a single global time-base                    */
#define SIM_MCTRL0_CFGTMRSTBEN_D_1               1U      /* 1 : CFGTMR0-3 have a common time-base and others have a different
                                                     common time-base                                                   */

/* ===========================================  SIM MCTRL0 CFGTMR0OBECTRL [16..16]  ============================================ */
                                   /* SIM_MCTRL0_CFGTMR0OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR0OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR0OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */

/* ===========================================  SIM MCTRL0 CFGTMR1OBECTRL [17..17]  ============================================ */
                                  /* SIM_MCTRL0_CFGTMR1OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR1OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR1OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */

/* ===========================================  SIM MCTRL0 CFGTMR2OBECTRL [18..18]  ============================================ */
                               /* SIM_MCTRL0_CFGTMR2OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR2OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR2OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */

/* ===========================================  SIM MCTRL0 CFGTMR3OBECTRL [19..19]  ============================================ */
                                  /* SIM_MCTRL0_CFGTMR3OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR3OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR3OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */

/* ===========================================  SIM MCTRL0 CFGTMR4OBECTRL [20..20]  ============================================ */
                                  /* SIM_MCTRL0_CFGTMR3OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR4OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR4OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */

/* ===========================================  SIM MCTRL0 CFGTMR5OBECTRL [21..21]  ============================================ */
                                  /* SIM_MCTRL0_CFGTMR5OBECTRL                                            */
#define SIM_MCTRL0_CFGTMR5OBECTRL_0              0U      /* 0 : The CFGTMR channel output is put to safe state when the CFGTMR
                                                     counter is enabled and the CFGTMR channel output is enabled
                                                     by Fault Control (CFGTMR_FMSEL[FCTRLMSEL]!=2b00 and CFGTMR_FCTRL[FEOSTS]=1b0)
                                                     and PWM is enabled (CFGTMR_CSTS[PWMOENCHn] = 1b1). Otherwise the
                                                     channel output is tristated.                                       */
#define SIM_MCTRL0_CFGTMR5OBECTRL_1              1U      /* 1 : The CFGTMR channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECMEN=1b0  CHCM=1b0
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECMEN=1b1].           */


/* =======================================================  SYSDEVID  ======================================================== */
/* ===============================================  SIM SYSDEVID APOC [8..11]  =============================================== */
                                   /* SIM_SYSDEVID_APOC                                                  */
#define SIM_SYSDEVID_APOC_0010                 2U      /* 0010 : 48 LQFP                                                     */
#define SIM_SYSDEVID_APOC_0011                 3U      /* 0011 : 64 LQFP                                                     */
#define SIM_SYSDEVID_APOC_0100                 4U      /* 0100 : 100 LQFP                                                    */
#define SIM_SYSDEVID_APOC_0110                 6U      /* 0110 : 144 LQFP                                                    */
#define SIM_SYSDEVID_APOC_0111                 7U      /* 0111 : 176 LQFP                                                    */
#define SIM_SYSDEVID_APOC_1000                 8U      /* 1000 : 100 MAP BGA                                                 */

/* =======================================================  PCLKGCTRL  ======================================================= */
/* =============================================  SIM PCLKGCTRL MSCCLKEN [0..0]  ============================================= */
                                   /* SIM_PCLKGCTRL_MSCCLKEN                                             */
#define SIM_PCLKGCTRL_MSCCLKEN_0               0U      /* 0 : Clock disabled                                                 */
#define SIM_PCLKGCTRL_MSCCLKEN_1               1U      /* 1 : Clock enabled                                                  */

/* =============================================  SIM PCLKGCTRL MPUCLKEN [1..1]  ============================================= */
                                  /* SIM_PCLKGCTRL_MPUCLKEN                                             */
#define SIM_PCLKGCTRL_MPUCLKEN_0               0U      /* 0 : Clock disabled                                                 */
#define SIM_PCLKGCTRL_MPUCLKEN_1               1U      /* 1 : Clock enabled                                                  */

/* =============================================  SIM PCLKGCTRL DMACLKEN [2..2]  ============================================= */
                                  /* SIM_PCLKGCTRL_DMACLKEN                                             */
#define SIM_PCLKGCTRL_DMACLKEN_0               0U      /* 0 : Clock disabled                                                 */
#define SIM_PCLKGCTRL_DMACLKEN_1               1U      /* 1 : Clock enabled                                                  */

/* ============================================  SIM PCLKGCTRL EREPCLKEN [3..3]  ============================================= */
                                  /* SIM_PCLKGCTRL_EREPCLKEN                                            */
#define SIM_PCLKGCTRL_EREPCLKEN_0              0U      /* 0 : Clock disabled                                                 */
#define SIM_PCLKGCTRL_EREPCLKEN_1              1U      /* 1 : Clock enabled                                                  */

/* =============================================  SIM PCLKGCTRL EINJCLKEN [4..4]  ============================================= */
                                  /* SIM_PCLKGCTRL_EINJCLKEN                                             */
#define SIM_PCLKGCTRL_EINJCLKEN_0               0U      /* 0 : Clock disabled                                                 */
#define SIM_PCLKGCTRL_EINJCLKEN_1               1U      /* 1 : Clock enabled                                                  */

/* =======================================================  FLASHCFG1  ======================================================= */
/* ============================================  SIM FLASHCFG1 EEERAMDS [16..19]  ============================================ */
                                  /* SIM_FLASHCFG1_EEERAMDS                                             */
#define SIM_FLASHCFG1_EEERAMDS_0010            2U      /* 0010 : 4 KB                                                        */
#define SIM_FLASHCFG1_EEERAMDS_0011            3U      /* 0011 : 2 KB                                                        */
#define SIM_FLASHCFG1_EEERAMDS_0100            4U      /* 0100 : 1 KB                                                        */
#define SIM_FLASHCFG1_EEERAMDS_0101            5U      /* 0101 : 512 Bytes                                                   */
#define SIM_FLASHCFG1_EEERAMDS_0110            6U      /* 0110 : 256 Bytes                                                   */
#define SIM_FLASHCFG1_EEERAMDS_0111            7U      /* 0111 : 128 Bytes                                                   */
#define SIM_FLASHCFG1_EEERAMDS_1000            8U      /* 1000 : 64 Bytes                                                    */
#define SIM_FLASHCFG1_EEERAMDS_1001            9U      /* 1001 : 32 Bytes                                                    */
#define SIM_FLASHCFG1_EEERAMDS_1111            15U     /* 1111 : 0 Bytes                                                     */

