MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =======================================================  UID127_96  ======================================================= */
/* =======================================================  UID95_64  ======================================================== */
/* =======================================================  UID63_32  ======================================================== */
/* ========================================================  UID31_0  ======================================================== */
/* ======================================================  SYSCLKDIV4  ======================================================= */
/* ===========================================  SIM SYSCLKDIV4 DTRACEDEN [28..28]  =========================================== */
                                   /* SIM_SYSCLKDIV4_DTRACEDEN                                           */
#define SIM_SYSCLKDIV4_DTRACEDEN_0             0U      /* 0 : Debug trace divider disabled                                   */
#define SIM_SYSCLKDIV4_DTRACEDEN_1             1U      /* 1 : Debug trace divider enabled                                    */

/* ========================================================  MCTRL1  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            PM                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  PINCTRL  ======================================================== */
/* =======================================================  GPINCTRLL  ======================================================= */
/* =============================================  PM GPINCTRLL PINEN [16..31]  ============================================== */
                                  /* PM_GPINCTRLL_PINEN                                                       */
#define PM_GPINCTRLL_PINEN_0                0U      /* 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
#define PM_GPINCTRLL_PINEN_1                1U      /* 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */


/* =======================================================  GPINCTRLH  ======================================================= */
/* =============================================  PM GPINCTRLH PINEN [16..31]  ============================================== */
                                  /* PM_GPINCTRLH_PINEN                                                       */
#define PM_GPINCTRLH_PINEN_0                0U      /* 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
#define PM_GPINCTRLH_PINEN_1                1U      /* 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */


/* =======================================================  GINTCTRLL  ======================================================= */
/* ==============================================  PM GINTCTRLL INTW [0..15]  =============================================== */
                                  /* PM_GINTCTRLL_INTW                                                        */
#define PM_GINTCTRLL_INTW_0                 0U      /* 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
#define PM_GINTCTRLL_INTW_1                 1U      /* 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */


/* =======================================================  GINTCTRLH  ======================================================= */
/* ==============================================  PM GINTCTRLH INTEN [0..15]  ============================================== */
                                  /* PM_GINTCTRLH_INTEN                                                       */
#define PM_GINTCTRLH_INTEN_0                0U      /* 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
#define PM_GINTCTRLH_INTEN_1                1U      /* 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */


/* ========================================================  INTSTS  ========================================================= */
/* ==============================================  PM INTSTS INTFLG [0..31]  =============================================== */
                                  /* PM_INTSTS_INTSFLG                                                        */
#define PM_INTSTS_INTSFLG_0                 0U      /* 0 : Configured interrupt is not detected.                                 */
#define PM_INTSTS_INTSFLG_1                 1U      /* 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */


/* =========================================================  DFEN  ========================================================== */
/* ================================================  PM DFEN DOFEN [0..31]  ================================================= */
                                  /* PM_DFEN_DOFEN                                                            */
#define PM_DFEN_DOFEN_0                     0U      /* 0 : Digital filter is disabled on the corresponding pin and
                                                     output of the digital filter is reset to zero.                            */
#define PM_DFEN_DOFEN_1                     1U      /* 1 : Digital filter is enabled on the corresponding pin, if the
                                                     pin is configured as a digital input.                                     */


/* =========================================================  DFCLKS  ========================================================= */
/* =================================================  PM DFCLKS DFCLKSS [0..0]  ================================================= */
                                  /* PM_DFCLKS_DFCLKSS                                                            */
#define PM_DFCLKS_DFCLKSS_0                     0U      /* 0 : Digital filters are clocked by the bus clock.                         */
#define PM_DFCLKS_DFCLKSS_1                     1U      /* 1 : Digital filters are clocked by the LPO clock.                         */


/* =========================================================  DFWID  ========================================================= */



/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CSTS  ========================================================== */
/* ================================================  WDT CSTS STOPEN [0..0]  ================================================= */
                                 /* WDT_CSTS_STOPEN                                                    */
#define WDT_CSTS_STOPEN_0                      0U      /* 0 : Watchdog disabled in chip stop mode.                           */
#define WDT_CSTS_STOPEN_1                      1U      /* 1 : Watchdog enabled in chip stop mode.                            */

