MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==================================================  WDT CSTS WEN [1..1]  ================================================== */
                                  /* WDT_CSTS_WEN                                                       */
#define WDT_CSTS_WEN_0                         0U      /* 0 : Watchdog disabled in chip wait mode.                           */
#define WDT_CSTS_WEN_1                         1U      /* 1 : Watchdog enabled in chip wait mode.                            */

/* =================================================  WDT CSTS DBGEN [2..2]  ================================================= */
                                 /* WDT_CSTS_DBGEN                                                     */
#define WDT_CSTS_DBGEN_0                       0U      /* 0 : Watchdog disabled in chip debug mode.                          */
#define WDT_CSTS_DBGEN_1                       1U      /* 1 : Watchdog enabled in chip debug mode.                           */

/* =================================================  WDT CSTS FTEN [3..4]  ================================================== */
                                /* WDT_CSTS_FTEN                                                      */
#define WDT_CSTS_FTEN_00                       0U      /* 00 : Watchdog test mode disabled.                                  */
#define WDT_CSTS_FTEN_01                       1U      /* 01 : Watchdog user mode enabled. (Watchdog test mode disabled.)
                                                     After testing the watchdog  software should use this setting
                                                     to indicate that the watchdog is functioning normally in
                                                     user mode.                                                                */
#define WDT_CSTS_FTEN_10                       2U      /* 10 : Watchdog test mode enabled  only the low byte is used.
                                                     CNT[CNTLOW] is compared with TOVAL[TOVALLOW].                             */
#define WDT_CSTS_FTEN_11                       3U      /* 11 : Watchdog test mode enabled  only the high byte is used.
                                                     CNT[CNTHIGH] is compared with TOVAL[TOVALHIGH].                           */

/* ================================================  WDT CSTS RECFGEN [5..5]  ================================================ */
                                  /* WDT_CSTS_RECFGEN                                                          */
#define WDT_CSTS_RECFGEN_0                     0U      /* 0 : Updates not allowed. After the initial configuration  the
                                                     watchdog cannot be later modified without forcing a reset.                */
#define WDT_CSTS_RECFGEN_1                     1U      /* 1 : Updates allowed. Software can modify the watchdog configuration
                                                     registers within 8d128 bus clocks after performing the
                                                     unlock write sequence.                                                    */

/* ================================================  WDT CSTS WDTIEN [6..6]  ================================================= */
                                   /* WDT_CSTS_WDTIEN                                                           */
#define WDT_CSTS_WDTIEN_0                      0U      /* 0 : Watchdog interrupts are disabled. Watchdog resets are not
                                                     delayed.                                                                  */
#define WDT_CSTS_WDTIEN_1                      1U      /* 1 : Watchdog interrupts are enabled. Watchdog resets are delayed
                                                     by 8d128 bus clocks from the interrupt vector fetch.                      */

/* =================================================  WDT CSTS CNTEN [7..7]  ================================================= */
                                 /* WDT_CSTS_CNTEN                                                            */
#define WDT_CSTS_CNTEN_0                       0U      /* 0 : Watchdog disabled.                                             */
#define WDT_CSTS_CNTEN_1                       1U      /* 1 : Watchdog enabled.                                              */

/* ===============================================  WDT CSTS CLKSRCSEL [8..9]  =============================================== */
                                   /* WDT_CSTS_CLKSRCSEL                                                 */
#define WDT_CSTS_CLKSRCSEL_00                  0U      /* 00 : Bus clock                                                     */
#define WDT_CSTS_CLKSRCSEL_01                  1U      /* 01 : LPO clock                                                     */
#define WDT_CSTS_CLKSRCSEL_10                  2U      /* 10 : INTCLK (internal clock)                                       */
#define WDT_CSTS_CLKSRCSEL_11                  3U      /* 11 : ERCLK (external reference clock)                              */

/* ==============================================  WDT CSTS RCSUSFLG [10..10]  =============================================== */
                                   /* WDT_CSTS_RCSUSFLG                                                  */
#define WDT_CSTS_RCSUSFLG_0                    0U      /* 0 : Reconfiguring WDOG.                                            */
#define WDT_CSTS_RCSUSFLG_1                    1U      /* 1 : Reconfiguration is successful.                                 */

/* ================================================  WDT CSTS ULFLG [11..11]  ================================================ */
                                   /* WDT_CSTS_ULFLG                                                     */
#define WDT_CSTS_ULFLG_0                       0U      /* 0 : WDOG is locked.                                                */
#define WDT_CSTS_ULFLG_1                       1U      /* 1 : WDOG is unlocked.                                              */

/* ================================================  WDT CSTS PSCEN [12..12]  ================================================ */
                                 /* WDT_CSTS_PSCEN                                                     */
#define WDT_CSTS_PSCEN_0                       0U      /* 0 : 256 prescaler disabled.                                        */
#define WDT_CSTS_PSCEN_1                       1U      /* 1 : 256 prescaler enabled.                                         */

/* ===============================================  WDT CSTS CMDEN32 [13..13]  =============================================== */
                                  /* WDT_CSTS_CMDEN32                                                   */
#define WDT_CSTS_CMDEN32_0                     0U      /* 0 : Disables support for 32-bit refresh/unlock command write
                                                     words. Only 16-bit or 8-bit is supported.                          */
#define WDT_CSTS_CMDEN32_1                     1U      /* 1 : Enables support for 32-bit refresh/unlock command write
                                                     words. 16-bit or 8-bit is NOT supported.                           */

/* ===============================================  WDT CSTS WDTIFLG [14..14]  =============================================== */
                                  /* WDT_CSTS_WDTIFLG                                                   */
#define WDT_CSTS_WDTIFLG_0                     0U      /* 0 : No interrupt occurred.                                         */
#define WDT_CSTS_WDTIFLG_1                     1U      /* 1 : An interrupt occurred.                                         */

/* ===============================================  WDT CSTS WINMEN [15..15]  ================================================ */
                                  /* WDT_CSTS_WINMEN                                                    */
#define WDT_CSTS_WINMEN_0                      0U      /* 0 : Window mode disabled.                                          */
#define WDT_CSTS_WINMEN_1                      1U      /* 1 : Window mode enabled.                                           */

