MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==========================================================  CNT  ========================================================== */
/* =========================================================  TOVAL  ========================================================= */
/* ==========================================================  WIN  ========================================================== */


/* =========================================================================================================================== */
/* ================                                            CFGIO                                             ================ */
/* =========================================================================================================================== */

/* ========================================================  VERID  ======================================================== */
/* ==============================================  CFGIO VERID FEATURE [0..15]  =============================================== */
                                   /* CFGIO_VERID_FEATURE                                                 */
#define CFGIO_VERID_FEATURE_0000000000000000    0U      /* 0000000000000000 : Standard features implemented.                  */
#define CFGIO_VERID_FEATURE_0000000000000001    1U      /* 0000000000000001 : Supports state  logic and parallel modes.       */

/* =========================================================  PARA  ========================================================= */
/* =========================================================  CTRL  ========================================================== */
/* ==================================================  CFGIO CTRL CFGIOEN [0..0]  ================================================== */
                                  /* CFGIO_CTRL_CFGIOEN                                                       */
#define CFGIO_CTRL_CFGIOEN_0                         0U      /* 0 : CFGIO module is disabled.                                     */
#define CFGIO_CTRL_CFGIOEN_1                         1U      /* 1 : CFGIO module is enabled.                                      */

/* ================================================  CFGIO CTRL SWRSTEN [1..1]  ================================================= */
                                  /* CFGIO_CTRL_SWRSTEN                                                    */
#define CFGIO_CTRL_SWRSTEN_0                      0U      /* 0 : Software reset is disabled                                     */
#define CFGIO_CTRL_SWRSTEN_1                      1U      /* 1 : Software reset is enabled  all CFGIO registers except the
                                                     Control Register are reset.                                        */

/* ================================================  CFGIO CTRL FRACCEN [2..2]  ================================================= */
                                 /* CFGIO_CTRL_FRACCEN                                                    */
#define CFGIO_CTRL_FRACCEN_0                      0U      /* 0 : Configures for normal register accesses to CFGIO              */
#define CFGIO_CTRL_FRACCEN_1                      1U      /* 1 : Configures for fast register accesses to CFGIO                */

/* ================================================  CFGIO CTRL DBGEN [30..30]  ================================================= */
                                  /* CFGIO_CTRL_DBGEN                                                      */
#define CFGIO_CTRL_DBGEN_0                        0U      /* 0 : CFGIO is disabled in debug modes.                             */
#define CFGIO_CTRL_DBGEN_1                        1U      /* 1 : CFGIO is enabled in debug modes                               */

/* ===============================================  CFGIO CTRL DOZEEN [31..31]  ================================================ */
                                  /* CFGIO_CTRL_DOZEEN                                                    */
#define CFGIO_CTRL_DOZEEN_0                      0U      /* 0 : CFGIO enabled in Doze modes.                                  */
#define CFGIO_CTRL_DOZEEN_1                      1U      /* 1 : CFGIO disabled in Doze modes.                                 */

/* ========================================================  PIDATA  ======================================================== */
/* =========================================================  SSTS  ========================================================== */
/* ========================================================  SERRFLG  ======================================================== */
/* ========================================================  TMRSTS  ========================================================= */
/* ========================================================  SSTSIEN  ======================================================== */
/* ========================================================  SEFIEN  ========================================================= */
/* =======================================================  TMRSTSIEN  ======================================================= */
/* =======================================================  DMAREQEN  ======================================================== */
/* ========================================================  SCTRL  ========================================================= */
/* ================================================  CFGIO SCTRL SMCFG [0..2]  ================================================= */
                                   /* CFGIO_SCTRL_SMCFG                                                    */
#define CFGIO_SCTRL_SMCFG_0                      0U      /* 0 : Disabled.                                                      */
#define CFGIO_SCTRL_SMCFG_1                      1U      /* 1 : Receive mode. Captures the current Shifter content into
                                                     the SHIFTBUF on expiration of the Timer.                           */
#define CFGIO_SCTRL_SMCFG_10                     2U      /* 10 : Transmit mode. Load SHIFTBUF contents into the Shifter
                                                     on expiration of the Timer.                                        */
#define CFGIO_SCTRL_SMCFG_100                    4U      /* 100 : Match Store mode. Shifter data is compared to SHIFTBUF
                                                     content on expiration of the Timer.                                */
#define CFGIO_SCTRL_SMCFG_101                    5U      /* 101 : Match Continuous mode. Shifter data is continuously compared
                                                     to SHIFTBUF contents.                                              */

/* ===============================================  CFGIO SCTRL SPPOLCFG [7..7]  =============================================== */
                                  /* CFGIO_SCTRL_SPPOLCFG                                                 */
#define CFGIO_SCTRL_SPPOLCFG_0                   0U      /* 0 : Pin is active high                                             */
#define CFGIO_SCTRL_SPPOLCFG_1                   1U      /* 1 : Pin is active low                                              */

/* ==============================================  CFGIO SCTRL SUPSEL [8..10]  ============================================== */
                                /* CFGIO_SCTRL_SUPSEL                                                 */
#define CFGIO_SCTRL_SUPSEL_000                   0U      /* 0 : Select CFGIO_D0                                                  */
#define CFGIO_SCTRL_SUPSEL_001                   1U      /* 1 : Select CFGIO_D1                                                  */
#define CFGIO_SCTRL_SUPSEL_010                   2U      /* 2 : Select CFGIO_D2                                                  */
#define CFGIO_SCTRL_SUPSEL_011                   3U      /* 3 : Select CFGIO_D3                                                  */
#define CFGIO_SCTRL_SUPSEL_100                   4U      /* 0 : Select CFGIO_D4                                                  */
#define CFGIO_SCTRL_SUPSEL_101                   5U      /* 1 : Select CFGIO_D5                                                  */
#define CFGIO_SCTRL_SUPSEL_110                   6U      /* 2 : Select CFGIO_D6                                                  */
#define CFGIO_SCTRL_SUPSEL_111                   7U      /* 3 : Select CFGIO_D7                                                  */

/* ===============================================  CFGIO SCTRL SOPCFG [16..17]  =============================================== */
                                 /* CFGIO_SCTRL_SOPCFG                                                   */
#define CFGIO_SCTRL_SOPCFG_0                     0U      /* 0 : Shifter pin output disabled                                    */
#define CFGIO_SCTRL_SOPCFG_1                     1U      /* 1 : Shifter pin open drain or bidirectional output enable          */
#define CFGIO_SCTRL_SOPCFG_10                    2U      /* 10 : Shifter pin bidirectional output data                         */
#define CFGIO_SCTRL_SOPCFG_11                    3U      /* 11 : Shifter pin output                                            */

