MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  CFGIO SCTRL SCLKLCFG [23..23]  ============================================== */
                                /* CFGIO_SCTRL_SCLKLCFG                                                 */
#define CFGIO_SCTRL_SCLKLCFG_0                   0U      /* 0 : Shift on posedge of Shift clock                                */
#define CFGIO_SCTRL_SCLKLCFG_1                   1U      /* 1 : Shift on negedge of Shift clock                                */

/* ==============================================  CFGIO SCTRL TMRSEL [24..25]  ============================================== */
                                /* CFGIO_SCTRL_TMRSEL                                                 */
#define CFGIO_SCTRL_TMRSEL_00                   0U      /* 0 : Select TIMER0                                                  */
#define CFGIO_SCTRL_TMRSEL_01                   1U      /* 1 : Select TIMER1                                                  */
#define CFGIO_SCTRL_TMRSEL_10                   2U      /* 2 : Select TIMER2                                                  */
#define CFGIO_SCTRL_TMRSEL_11                   3U      /* 3 : Select TIMER3                                                  */

/* =========================================================  SCFG  ========================================================= */
/* ===============================================  CFGIO SCFG SSTAFSEL [0..1]  ================================================ */
                                 /* CFGIO_SCFG_SSTAFSEL                                                  */
#define CFGIO_SCFG_SSTAFSEL_0                    0U      /* 0 : Start bit disabled for transmitter/receiver/match store
                                                     transmitter loads data on enable                                   */
#define CFGIO_SCFG_SSTAFSEL_1                    1U      /* 1 : Start bit disabled for transmitter/receiver/match store
                                                     transmitter loads data on first shift                              */
#define CFGIO_SCFG_SSTAFSEL_10                   2U      /* 10 : Transmitter outputs start bit value 0 before loading data
                                                     on first shift  receiver/match store sets error flag if
                                                     start bit is not 0                                                 */
#define CFGIO_SCFG_SSTAFSEL_11                   3U      /* 11 : Transmitter outputs start bit value 1 before loading data
                                                     on first shift  receiver/match store sets error flag if
                                                     start bit is not 1                                                 */

/* ===============================================  CFGIO SCFG SSTOPFSEL [4..5]  =============================================== */
                                  /* CFGIO_SCFG_SSTOPFSEL                                                 */
#define CFGIO_SCFG_SSTOPFSEL_0                   0U      /* 0 : Stop bit disabled for transmitter/receiver/match store         */
#define CFGIO_SCFG_SSTOPFSEL_1                   1U      /* 1 : Reserved for transmitter/receiver/match store                  */
#define CFGIO_SCFG_SSTOPFSEL_10                  2U      /* 10 : Transmitter outputs stop bit value 0 on store  receiver/match
                                                     store sets error flag if stop bit is not 0                         */
#define CFGIO_SCFG_SSTOPFSEL_11                  3U      /* 11 : Transmitter outputs stop bit value 1 on store  receiver/match
                                                     store sets error flag if stop bit is not 1                         */

/* ================================================  CFGIO SCFG ISRCSEL [8..8]  ================================================ */
                                  /* CFGIO_SCFG_ISRCSEL                                                   */
#define CFGIO_SCFG_ISRCSEL_0                     0U      /* 0 : Pin                                                            */
#define CFGIO_SCFG_ISRCSEL_1                     1U      /* 1 : Shifter N+1 Output                                             */

/* =========================================================  SBUF  ========================================================= */
/* =======================================================  SBUFBITSWA  ======================================================= */
/* =======================================================  SBUFBYTSWA  ======================================================= */
/* ========================================================  SBUFBSWA  ======================================================== */
/* ========================================================  TMRCTRL  ======================================================== */
/* ===============================================  CFGIO TMRCTRL TMRMCFG [0..1]  =============================================== */
                                  /* CFGIO_TMRCTRL_TMRMCFG                                                 */
#define CFGIO_TMRCTRL_TMRMCFG_0                   0U      /* 0 : Timer Disabled.                                                */
#define CFGIO_TMRCTRL_TMRMCFG_1                   1U      /* 1 : Dual 8-bit counters baud/bit mode.                             */
#define CFGIO_TMRCTRL_TMRMCFG_10                  2U      /* 10 : Dual 8-bit counters PWM mode.                                 */
#define CFGIO_TMRCTRL_TMRMCFG_11                  3U      /* 11 : Single 16-bit counter mode.                                   */

/* ==============================================  CFGIO TMRCTRL TMRPPOLCFG [7..7]  =============================================== */
                                   /* CFGIO_TMRCTRL_TMRPPOLCFG                                                */
#define CFGIO_TMRCTRL_TMRPPOLCFG_0                  0U      /* 0 : Pin is active high                                             */
#define CFGIO_TMRCTRL_TMRPPOLCFG_1                  1U      /* 1 : Pin is active low                                              */

