MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ======================================================  SYSOSCCSTS  ======================================================= */
/* ============================================  SCG SYSOSCCSTS SYSOSCEN [0..0]  ============================================= */
                                  /* SCG_SYSOSCCSTS_SYSOSCEN                                                   */
#define SCG_SYSOSCCSTS_SYSOSCEN_0           0U    /* 0 : System OSC is disabled                                                */
#define SCG_SYSOSCCSTS_SYSOSCEN_1           1U    /* 1 : System OSC is enabled                                                 */


/* ===========================================  SCG SYSOSCCSTS SYSOSCMEN [16..16]  =========================================== */
                                  /* SCG_SYSOSCCSTS_SYSOSCMEN                                                  */
#define SCG_SYSOSCCSTS_SYSOSCMEN_0          0U    /* 0 : System OSC Clock Monitor is disabled                                  */
#define SCG_SYSOSCCSTS_SYSOSCMEN_1          1U    /* 1 : System OSC Clock Monitor is enabled                                   */


/* =========================================  SCG SYSOSCCSTS SYSOSCMRSTEN [17..17]  ========================================== */
                                  /* SCG_SYSOSCCSTS_SYSOSCMRSTEN                                               */
#define SCG_SYSOSCCSTS_SYSOSCMRSTEN_0       0U    /* 0 : Clock Monitor generates interrupt when error detected                 */
#define SCG_SYSOSCCSTS_SYSOSCMRSTEN_1       1U    /* 1 : Clock Monitor generates reset when error detected                     */


/* =============================================  SCG SYSOSCCSTS LOCK [23..23]  ============================================== */
                                  /* SCG_SYSOSCCSTS_LOCK                                                       */
#define SCG_SYSOSCCSTS_LOCK_0               0U    /* 0 : This Control Status Register can be written.                          */
#define SCG_SYSOSCCSTS_LOCK_1               1U    /* 1 : This Control Status Register cannot be written.                       */


/* =========================================  SCG SYSOSCCSTS SYSOSCVLDFLG [24..24]  ========================================== */
                                  /* SCG_SYSOSCCSTS_SYSOSCVLDFLG                                               */
#define SCG_SYSOSCCSTS_SYSOSCVLDFLG_0       0U    /* 0 : System OSC is not enabled or clock is not valid                       */
#define SCG_SYSOSCCSTS_SYSOSCVLDFLG_1       1U    /* 1 : System OSC is enabled and output clock is valid                       */


/* ===========================================  SCG SYSOSCCSTS SYSOSCSEL [25..25]  =========================================== */
                                  /* SCG_SYSOSCCSTS_SYSOSCSEL                                                  */
#define SCG_SYSOSCCSTS_SYSOSCSEL_0          0U    /* 0 : System OSC is not the system clock source                             */
#define SCG_SYSOSCCSTS_SYSOSCSEL_1          1U    /* 1 : System OSC is the system clock source                                 */


/* =========================================  SCG SYSOSCCSTS SYSOSCCLKEFLG [26..26]  ========================================= */
                                  /* SCG_SYSOSCCSTS_SYSOSCCLKEFLG                                              */
#define SCG_SYSOSCCSTS_SYSOSCCLKEFLG_0      0U    /* 0 : System OSC Clock Monitor is disabled or has not detected
                                                     an error                                                                  */
#define SCG_SYSOSCCSTS_SYSOSCCLKEFLG_1      1U    /* 1 : System OSC Clock Monitor is enabled and detected an error             */


/* =====================================================  SYSOSCDIVCFG  ====================================================== */
/* ==========================================  SCG SYSOSCDIVCFG SYSOSCDCFG1 [0..2]  ========================================== */
                                  /* SCG_SYSOSCDIVCFG_SYSOSCDCFG1                                              */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_000    0U    /* 000 : Output disabled                                                     */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_001    1U    /* 001 : Divide by 1                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_010    2U    /* 010 : Divide by 2                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_011    3U    /* 011 : Divide by 4                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_100    4U    /* 100 : Divide by 8                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_101    5U    /* 101 : Divide by 16                                                        */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_110    6U    /* 110 : Divide by 32                                                        */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG1_111    7U    /* 111 : Divide by 64                                                        */


/* =========================================  SCG SYSOSCDIVCFG SYSOSCDCFG2 [8..10]  ========================================== */
                                  /* SCG_SYSOSCDIVCFG_SYSOSCDCFG2                                              */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_000    0U    /* 000 : Output disabled                                                     */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_001    1U    /* 001 : Divide by 1                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_010    2U    /* 010 : Divide by 2                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_011    3U    /* 011 : Divide by 4                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_100    4U    /* 100 : Divide by 8                                                         */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_101    5U    /* 101 : Divide by 16                                                        */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_110    6U    /* 110 : Divide by 32                                                        */
#define SCG_SYSOSCDIVCFG_SYSOSCDCFG2_111    7U    /* 111 : Divide by 64                                                        */


/* =======================================================  SYSOSCCFG  ======================================================= */
/* =============================================  SCG SYSOSCCFG ERCLKSEL [2..2]  ============================================= */
                                  /* SCG_SYSOSCCFG_ERCLKSEL                                                    */
#define SCG_SYSOSCCFG_ERCLKSEL_0            0U    /* 0 : External reference clock selected                                     */
#define SCG_SYSOSCCFG_ERCLKSEL_1            1U    /* 1 : Internal crystal oscillator of OSC selected.                          */


/* =============================================  SCG SYSOSCCFG GOSCSEL [3..3]  ============================================== */
                                  /* SCG_SYSOSCCFG_GOSCSEL                                                     */
#define SCG_SYSOSCCFG_GOSCSEL_0             0U    /* 0 : Configure crystal oscillator for low-gain operation                   */
#define SCG_SYSOSCCFG_GOSCSEL_1             1U    /* 1 : Configure crystal oscillator for high-gain operation                  */


