MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ============================================  SCG SYSOSCCFG SYSOSCFSEL [4..5]  ============================================ */
                                  /* SCG_SYSOSCCFG_SYSOSCFSEL                                                  */
#define SCG_SYSOSCCFG_SYSOSCFSEL_01         1U    /* 01 : Low frequency range selected for the crystal oscillator              */
#define SCG_SYSOSCCFG_SYSOSCFSEL_10         2U    /* 10 : Medium frequency range selected for the crytstal oscillator          */
#define SCG_SYSOSCCFG_SYSOSCFSEL_11         3U    /* 11 : High frequency range selected for the crystal oscillator             */


/* ========================================================  LSICSTS  ======================================================== */
/* ===============================================  SCG LSICSTS LSIEN [0..0]  ================================================ */
                                  /* SCG_LSICSTS_LSIEN                                                         */
#define SCG_LSICSTS_LSIEN_0                 0U    /* 0 : Low speed internal oscillator is disabled                                                  */
#define SCG_LSICSTS_LSIEN_1                 1U    /* 1 : Low speed internal oscillator is enabled                                                   */


/* =============================================  SCG LSICSTS LSIEN_STOP [1..1]  ============================================= */
                                  /* SCG_LSICSTS_LSIEN_STOP                                                    */
#define SCG_LSICSTS_LSIEN_STOP_0            0U    /* 0 : Low speed internal oscillator is disabled in supported Stop modes                          */
#define SCG_LSICSTS_LSIEN_STOP_1            1U    /* 1 : Low speed internal oscillator is enabled in supported Stop modes                           */


/* ==============================================  SCG LSICSTS LSIEN_LP [2..2]  ============================================== */
                                  /* SCG_LSICSTS_LSIEN_LP                                                      */
#define SCG_LSICSTS_LSIEN_LP_0              0U    /* 0 : Low speed internal oscillator is disabled in VLP modes                                     */
#define SCG_LSICSTS_LSIEN_LP_1              1U    /* 1 : Low speed internal oscillator is enabled in VLP modes                                      */


/* ===============================================  SCG LSICSTS LOCK [23..23]  =============================================== */
                                  /* SCG_LSICSTS_LOCK                                                          */
#define SCG_LSICSTS_LOCK_0                  0U    /* 0 : Control Status Register can be written.                               */
#define SCG_LSICSTS_LOCK_1                  1U    /* 1 : Control Status Register cannot be written.                            */


/* ============================================  SCG LSICSTS LSIVLDFLG [24..24]  ============================================= */
                                  /* SCG_LSICSTS_LSIVLDFLG                                                     */
#define SCG_LSICSTS_LSIVLDFLG_0             0U    /* 0 : Low speed internal oscillator is not enabled or clock is not valid                         */
#define SCG_LSICSTS_LSIVLDFLG_1             1U    /* 1 : Low speed internal oscillator is enabled and output clock is valid                         */


/* ==============================================  SCG LSICSTS LSISEL [25..25]  ============================================== */
                                  /* SCG_LSICSTS_LSISEL                                                        */
#define SCG_LSICSTS_LSISEL_0                0U    /* 0 : Low speed internal oscillator is not the system clock source                               */
#define SCG_LSICSTS_LSISEL_1                1U    /* 1 : Low speed internal oscillator is the system clock source                                   */


/* =======================================================  LSIDIV  ======================================================= */
/* ===========================================  SCG LSIDIV LSIDIVCFG1 [0..2]  ============================================ */
                                  /* SCG_LSIDIV_LSIDIVCFG1                                                 */
#define  SCG_LSIDIV_LSIDIVCFG1_000       0U    /* 000 : Output disabled                                                     */
#define  SCG_LSIDIV_LSIDIVCFG1_001       1U    /* 001 : Divide by 1                                                         */
#define  SCG_LSIDIV_LSIDIVCFG1_010       2U    /* 010 : Divide by 2                                                         */
#define  SCG_LSIDIV_LSIDIVCFG1_011       3U    /* 011 : Divide by 4                                                         */
#define  SCG_LSIDIV_LSIDIVCFG1_100       4U    /* 100 : Divide by 8                                                         */
#define  SCG_LSIDIV_LSIDIVCFG1_101       5U    /* 101 : Divide by 16                                                        */
#define  SCG_LSIDIV_LSIDIVCFG1_110       6U    /* 110 : Divide by 32                                                        */
#define  SCG_LSIDIV_LSIDIVCFG1_111       7U    /* 111 : Divide by 64                                                        */


/* ===========================================  SCG LSIDIV LSIDIVCFG2 [8..10]  =========================================== */
                                  /* SCG_LSIDIV_LSIDIVCFG2                                                 */
#define  SCG_LSIDIV_LSIDIVCFG2_000       0U    /* 000 : Output disabled                                                     */
#define  SCG_LSIDIV_LSIDIVCFG2_001       1U    /* 001 : Divide by 1                                                         */
#define  SCG_LSIDIV_LSIDIVCFG2_010       2U    /* 010 : Divide by 2                                                         */
#define  SCG_LSIDIV_LSIDIVCFG2_011       3U    /* 011 : Divide by 4                                                         */
#define  SCG_LSIDIV_LSIDIVCFG2_100       4U    /* 100 : Divide by 8                                                         */
#define  SCG_LSIDIV_LSIDIVCFG2_101       5U    /* 101 : Divide by 16                                                        */
#define  SCG_LSIDIV_LSIDIVCFG2_110       6U    /* 110 : Divide by 32                                                        */
#define  SCG_LSIDIV_LSIDIVCFG2_111       7U    /* 111 : Divide by 64                                                        */


/* ========================================================  LSIFSEL  ======================================================== */
/* ==============================================  SCG LSIFSEL LSIFSEL [0..0]  ============================================== */
                                  /* SCG_LSIFSEL_LSIFSEL                                                      */
#define  SCG_LSIFSEL_LSIFSEL_0              0U    /* 0 : Low Speed Internal oscillator low range clock (2 MHz)                                      */
#define  SCG_LSIFSEL_LSIFSEL_1              1U    /* 1 : Low Speed Internal oscillator high range clock (8 MHz )                                    */


/* ========================================================  HSICSTS  ======================================================== */
/* ===============================================  SCG HSICSTS HSIEN [0..0]  ================================================ */
                                  /* SCG_HSICSTS_HSIEN                                                         */
#define SCG_HSICSTS_HSIEN_0                 0U    /* 0 : High speed internal oscillator is disabled                                                  */
#define SCG_HSICSTS_HSIEN_1                 1U    /* 1 : High speed internal oscillator is enabled                                                   */


