MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  SCG HSICSTS HSIREN [3..3]  =============================================== */
                                  /* SCG_HSICSTS_HSIREN                                                        */
#define SCG_HSICSTS_HSIREN_0                0U    /* 0 : High speed internal oscillator Regulator is enabled.                                        */
#define SCG_HSICSTS_HSIREN_1                1U    /* 1 : High speed internal oscillator Regulator is disabled.                                       */


/* ===============================================  SCG HSICSTS LOCK [23..23]  =============================================== */
                                  /* SCG_HSICSTS_LOCK                                                          */
#define SCG_HSICSTS_LOCK_0                  0U    /* 0 : Control Status Register can be written.                               */
#define SCG_HSICSTS_LOCK_1                  1U    /* 1 : Control Status Register cannot be written.                            */


/* ============================================  SCG HSICSTS HSIVLDFLG [24..24]  ============================================= */
                                  /* SCG_HSICSTS_HSIVLDFLG                                                     */
#define SCG_HSICSTS_HSIVLDFLG_0             0U    /* 0 : High speed internal oscillator is not enabled or clock is not valid.                        */
#define SCG_HSICSTS_HSIVLDFLG_1             1U    /* 1 : High speed internal oscillator is enabled and output clock is valid. The clock
                                                     is valid once there is an output clock from the HSI analog.              */


/* ==============================================  SCG HSICSTS HSISEL [25..25]  ============================================== */
                                  /* SCG_HSICSTS_HSISEL                                                        */
#define SCG_HSICSTS_HSISEL_0                0U    /* 0 : High speed internal oscillator is not the system clock source                               */
#define SCG_HSICSTS_HSISEL_1                1U    /* 1 : High speed internal oscillator is the system clock source                                   */


/* =============================================  SCG HSICSTS HSIEFLG [26..26]  ============================================== */
                                  /* SCG_HSICSTS_HSIEFLG                                                       */
#define SCG_HSICSTS_HSIEFLG_0               0U    /* 0 : Error not detected with the High speed internal oscillator trimming.                        */
#define SCG_HSICSTS_HSIEFLG_1               1U    /* 1 : Error detected with the High speed internal oscillator trimming.                            */


/* ========================================================  HSIDIV  ========================================================= */
/* =============================================  SCG HSIDIV HSIDIVCFG1 [0..2]  ============================================== */
                                  /* SCG_HSIDIV_HSIDIVCFG1                                                     */
#define SCG_HSIDIV_HSIDIVCFG1_000           0U    /* 000 : Output disabled                                                     */
#define SCG_HSIDIV_HSIDIVCFG1_001           1U    /* 001 : Divide by 1                                                         */
#define SCG_HSIDIV_HSIDIVCFG1_010           2U    /* 010 : Divide by 2                                                         */
#define SCG_HSIDIV_HSIDIVCFG1_011           3U    /* 011 : Divide by 4                                                         */
#define SCG_HSIDIV_HSIDIVCFG1_100           4U    /* 100 : Divide by 8                                                         */
#define SCG_HSIDIV_HSIDIVCFG1_101           5U    /* 101 : Divide by 16                                                        */
#define SCG_HSIDIV_HSIDIVCFG1_110           6U    /* 110 : Divide by 32                                                        */
#define SCG_HSIDIV_HSIDIVCFG1_111           7U    /* 111 : Divide by 64                                                        */


/* =============================================  SCG HSIDIV HSIDIVCFG2 [8..10]  ============================================= */
                                  /* SCG_HSIDIV_HSIDIVCFG2                                                     */
#define SCG_HSIDIV_HSIDIVCFG2_000           0U    /* 000 : Output disabled                                                     */
#define SCG_HSIDIV_HSIDIVCFG2_001           1U    /* 001 : Divide by 1                                                         */
#define SCG_HSIDIV_HSIDIVCFG2_010           2U    /* 010 : Divide by 2                                                         */
#define SCG_HSIDIV_HSIDIVCFG2_011           3U    /* 011 : Divide by 4                                                         */
#define SCG_HSIDIV_HSIDIVCFG2_100           4U    /* 100 : Divide by 8                                                         */
#define SCG_HSIDIV_HSIDIVCFG2_101           5U    /* 101 : Divide by 16                                                        */
#define SCG_HSIDIV_HSIDIVCFG2_110           6U    /* 110 : Divide by 32                                                        */
#define SCG_HSIDIV_HSIDIVCFG2_111           7U    /* 111 : Divide by 64                                                        */


/* ========================================================  HSIFSEL  ======================================================== */
/* ==============================================  SCG HSIFSEL HSIFSEL [0..1]  =============================================== */
                                  /* SCG_HSIFSEL_HSIFSEL                                                       */
#define SCG_HSIFSEL_HSIFSEL_00              0U    /* 00 : High speed internal oscillator is trimmed to 48 MHz                                        */


/* ======================================================  SYSPLLCSTS  ======================================================= */
/* ============================================  SCG SYSPLLCSTS SYSPLLEN [0..0]  ============================================= */
                                  /* SCG_SYSPLLCSTS_SYSPLLEN                                                   */
#define SCG_SYSPLLCSTS_SYSPLLEN_0           0U    /* 0 : System PLL is disabled                                                */
#define SCG_SYSPLLCSTS_SYSPLLEN_1           1U    /* 1 : System PLL is enabled                                                 */


/* ===========================================  SCG SYSPLLCSTS SYSPLLMEN [16..16]  =========================================== */
                                  /* SCG_SYSPLLCSTS_SYSPLLMEN                                                  */
#define SCG_SYSPLLCSTS_SYSPLLMEN_0          0U    /* 0 : System PLL Clock Monitor is disabled                                  */
#define SCG_SYSPLLCSTS_SYSPLLMEN_1          1U    /* 1 : System PLL Clock Monitor is enabled                                   */


