MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =========================================================  PDU0CLK  ========================================================== */
/* ===============================================  PCM PDU0CLK PDU0EN [30..30]  ================================================ */
                                   /* PCM_PDU0CLK_PDU0EN                                                    */
#define PCM_PDU0CLK_PDU0EN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_PDU0CLK_PDU0EN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM PDU0CLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_PDU0CLK_PSTFLG                                                    */
#define PCM_PDU0CLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PDU0CLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPITMRCLK  ========================================================= */
                                   /* PCM_LPITMRCLK_LPITMRCSSEL                                             */
#define PCM_LPITMRCLK_LPITMRCSSEL_000             0U      /* 000 : Clock is off.                                                */
#define PCM_LPITMRCLK_LPITMRCSSEL_001             1U      /* 001 : Clock option 1                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_010             2U      /* 010 : Clock option 2                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_011             3U      /* 011 : Clock option 3                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_100             4U      /* 100 : Clock option 4                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_101             5U      /* 101 : Clock option 5                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_110             6U      /* 110 : Clock option 6                                               */
#define PCM_LPITMRCLK_LPITMRCSSEL_111             7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPITMRCLK LPITMREN [30..30]  ============================================== */
                                   /* PCM_LPITMRCLK_LPITMREN                                                */
#define PCM_LPITMRCLK_LPITMREN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPITMRCLK_LPITMREN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPITMRCLK PSTFLG [31..31]  =============================================== */
                                   /* PCM_LPITMRCLK_PSTFLG                                                  */
#define PCM_LPITMRCLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPITMRCLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  CFGTMR0CLK  ========================================================= */
/* =============================================  PCM CFGTMR0CLK CFGTMR0CSSEL [24..26]  ============================================= */
                                /* PCM_CFGTMR0CLK_CFGTMR0CSSEL                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_000               0U      /* 000 : Clock is off. An external clock can be enabled for this
                                                     peripheral.                                                        */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_CFGTMR0CLK_CFGTMR0CSSEL_111               7U      /* 111 : Clock option 7                                               */

/* ==============================================  PCM CFGTMR0CLK CFGTMR0EN [30..30]  =============================================== */
                                 /* PCM_CFGTMR0CLK_CFGTMR0EN                                                  */
#define PCM_CFGTMR0CLK_CFGTMR0EN_0                    0U      /* 0 : Clock disabled                                                 */
#define PCM_CFGTMR0CLK_CFGTMR0EN_1                    1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM CFGTMR0CLK PSTFLG [31..31]  =============================================== */
                                 /* PCM_CFGTMR0CLK_PSTFLG                                                   */
#define PCM_CFGTMR0CLK_PSTFLG_0                     0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGTMR0CLK_PSTFLG_1                     1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  CFGTMR1CLK  ========================================================= */
/* =============================================  PCM CFGTMR1CLK CFGTMR1CSSEL [24..26]  ============================================= */
                                 /* PCM_CFGTMR1CLK_CFGTMR1CSSEL                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_000               0U      /* 000 : Clock is off. An external clock can be enabled for this
                                                     peripheral.                                                        */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_001               1U      /* 001 : Clock option 1                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_010               2U      /* 010 : Clock option 2                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_011               3U      /* 011 : Clock option 3                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_100               4U      /* 100 : Clock option 4                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_101               5U      /* 101 : Clock option 5                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_110               6U      /* 110 : Clock option 6                                               */
#define PCM_CFGTMR1CLK_CFGTMR1CSSEL_111               7U      /* 111 : Clock option 7                                               */

