MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  PCM RTCCLK PSTFLG [31..31]  ================================================ */
                                  /* PCM_RTCCLK_PSTFLG                                                     */
#define PCM_RTCCLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_RTCCLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPTMRCLK  ========================================================= */
/* ============================================  PCM LPTMRCLK LPTMRDIVDCFG [0..2]  ============================================ */
                                  /* PCM_LPTMRCLK_LPTMRDIVDCFG                                           */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_000           0U      /* 000 : Divide by 1.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_001           1U      /* 001 : Divide by 2.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_010           2U      /* 010 : Divide by 3.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_011           3U      /* 011 : Divide by 4.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_100           4U      /* 100 : Divide by 5.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_101           5U      /* 101 : Divide by 6.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_110           6U      /* 110 : Divide by 7.                                                 */
#define PCM_LPTMRCLK_LPTMRDIVDCFG_111           7U      /* 111 : Divide by 8.                                                 */

/* ============================================  PCM LPTMRCLK LPTMRDIVNCFG [3..3]  ============================================ */
                                  /* PCM_LPTMRCLK_LPTMRDIVNCFG                                           */
#define PCM_LPTMRCLK_LPTMRDIVNCFG_0             0U      /* 0 : Fractional value is 0.                                         */
#define PCM_LPTMRCLK_LPTMRDIVNCFG_1             1U      /* 1 : Fractional value is 1.                                         */

/* ============================================  PCM LPTMRCLK LPTMRCSSEL [24..26]  ============================================ */
                                   /* PCM_LPTMRCLK_LPTMRCSSEL                                             */
#define PCM_LPTMRCLK_LPTMRCSSEL_000             0U      /* 000 : Clock is off.                                                */
#define PCM_LPTMRCLK_LPTMRCSSEL_001             1U      /* 001 : Clock option 1                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_010             2U      /* 010 : Clock option 2                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_011             3U      /* 011 : Clock option 3                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_100             4U      /* 100 : Clock option 4                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_101             5U      /* 101 : Clock option 5                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_110             6U      /* 110 : Clock option 6                                               */
#define PCM_LPTMRCLK_LPTMRCSSEL_111             7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPTMRCLK LPTMREN [30..30]  ============================================== */
                                  /* PCM_LPTMRCLK_LPTMREN                                                */
#define PCM_LPTMRCLK_LPTMREN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPTMRCLK_LPTMREN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPTMRCLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_LPTMRCLK_PSTFLG                                                  */
#define PCM_LPTMRCLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPTMRCLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  PMACLK  ========================================================== */
/* ================================================  PCM PMACLK PMAEN [30..30]  ================================================= */
                                  /* PCM_PMACLK_PMAEN                                                      */
#define PCM_PMACLK_PMAEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_PMACLK_PMAEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM PMACLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_PMACLK_PSTFLG                                                     */
#define PCM_PMACLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PMACLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  PMBCLK  ========================================================== */
/* ================================================  PCM PMBCLK PMBEN [30..30]  ================================================= */
                                 /* PCM_PMBCLK_PMBEN                                                      */
#define PCM_PMBCLK_PMBEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_PMBCLK_PMBEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM PMBCLK PSTFLG [31..31]  ================================================ */
                                  /* PCM_PMBCLK_PSTFLG                                                     */
#define PCM_PMBCLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PMBCLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  PMCCLK  ========================================================== */
/* ================================================  PCM PMCCLK PMCEN [30..30]  ================================================= */
                                   /* PCM_PMCCLK_PMCEN                                                      */
#define PCM_PMCCLK_PMCEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_PMCCLK_PMCEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

