MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  PCM PMCCLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_PMCCLK_PSTFLG                                                     */
#define PCM_PMCCLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PMCCLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  PMDCLK  ========================================================== */
/* ================================================  PCM PMDCLK PMDEN [30..30]  ================================================= */
                                    /* PCM_PMDCLK_PMDEN                                                      */
#define PCM_PMDCLK_PMDEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_PMDCLK_PMDEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM PMDCLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_PMDCLK_PSTFLG                                                     */
#define PCM_PMDCLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PMDCLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  PMECLK  ========================================================== */
/* ================================================  PCM PMECLK PMEEN [30..30]  ================================================= */
                                   /* PCM_PMECLK_PMEEN                                                      */
#define PCM_PMECLK_PMEEN_0                        0U      /* 0 : Clock disabled                                                 */
#define PCM_PMECLK_PMEEN_1                        1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM PMECLK PSTFLG [31..31]  ================================================ */
                                   /* PCM_PMECLK_PSTFLG                                                     */
#define PCM_PMECLK_PSTFLG_0                       0U      /* 0 : Peripheral is not present.                                     */
#define PCM_PMECLK_PSTFLG_1                       1U      /* 1 : Peripheral is present.                                         */

/* ==========================================================  CFGIOCLK  =========================================================== */
/* ================================================  PCM CFGIOCLK CFGIOCSSEL [24..26]  ================================================ */
                                   /* PCM_CFGIOCLK_CFGIOCSSEL                                                     */
#define PCM_CFGIOCLK_CFGIOCSSEL_000                     0U      /* 000 : Clock is off.                                                */
#define PCM_CFGIOCLK_CFGIOCSSEL_001                     1U      /* 001 : Clock option 1                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_010                     2U      /* 010 : Clock option 2                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_011                     3U      /* 011 : Clock option 3                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_100                     4U      /* 100 : Clock option 4                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_101                     5U      /* 101 : Clock option 5                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_110                     6U      /* 110 : Clock option 6                                               */
#define PCM_CFGIOCLK_CFGIOCSSEL_111                     7U      /* 111 : Clock option 7                                               */

/* =================================================  PCM CFGIOCLK CFGIOEN [30..30]  ================================================== */
                                   /* PCM_CFGIOCLK_CFGIOEN                                                        */
#define PCM_CFGIOCLK_CFGIOEN_0                          0U      /* 0 : Clock disabled                                                 */
#define PCM_CFGIOCLK_CFGIOEN_1                          1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ================================================  PCM CFGIOCLK PSTFLG [31..31]  ================================================= */
                                   /* PCM_CFGIOCLK_PSTFLG                                                      */
#define PCM_CFGIOCLK_PSTFLG_0                        0U      /* 0 : Peripheral is not present.                                     */
#define PCM_CFGIOCLK_PSTFLG_1                        1U      /* 1 : Peripheral is present.                                         */

/* =========================================================  EWDTCLK  ========================================================== */
/* ===============================================  PCM EWDTCLK EWDTEN [30..30]  ================================================ */
                                   /* PCM_EWDTCLK_EWDTEN                                                    */
#define PCM_EWDTCLK_EWDTEN_0                      0U      /* 0 : Clock disabled                                                 */
#define PCM_EWDTCLK_EWDTEN_1                      1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ===============================================  PCM EWDTCLK PSTFLG [31..31]  ================================================ */
                                  /* PCM_EWDTCLK_PSTFLG                                                    */
#define PCM_EWDTCLK_PSTFLG_0                      0U      /* 0 : Peripheral is not present.                                     */
#define PCM_EWDTCLK_PSTFLG_1                      1U      /* 1 : Peripheral is present.                                         */

/* ========================================================  LPI2CCLK  ========================================================= */
/* ============================================  PCM LPI2CCLK LPI2CCSSEL [24..26]  ============================================ */
                                  /* PCM_LPI2CCLK_LPI2CCSSEL                                             */
#define PCM_LPI2CCLK_LPI2CCSSEL_000             0U      /* 000 : Clock is off.                                                */
#define PCM_LPI2CCLK_LPI2CCSSEL_001             1U      /* 001 : Clock option 1                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_010             2U      /* 010 : Clock option 2                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_011             3U      /* 011 : Clock option 3                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_100             4U      /* 100 : Clock option 4                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_101             5U      /* 101 : Clock option 5                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_110             6U      /* 110 : Clock option 6                                               */
#define PCM_LPI2CCLK_LPI2CCSSEL_111             7U      /* 111 : Clock option 7                                               */

/* =============================================  PCM LPI2CCLK LPI2CEN [30..30]  ============================================== */
                                  /* PCM_LPI2CCLK_LPI2CEN                                                */
#define PCM_LPI2CCLK_LPI2CEN_0                  0U      /* 0 : Clock disabled                                                 */
#define PCM_LPI2CCLK_LPI2CEN_1                  1U      /* 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                        */

/* ==============================================  PCM LPI2CCLK PSTFLG [31..31]  =============================================== */
                                  /* PCM_LPI2CCLK_PSTFLG                                                  */
#define PCM_LPI2CCLK_PSTFLG_0                    0U      /* 0 : Peripheral is not present.                                     */
#define PCM_LPI2CCLK_PSTFLG_1                    1U      /* 1 : Peripheral is present.                                         */

