MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  LPI2C MSTS RXFLG [1..1]  ================================================ */
                                  /* LPI2C_MSTS_RXFLG                                                   */
#define LPI2C_MSTS_RXFLG_0                     0U      /* 0 : Receive Data is not ready.                                     */
#define LPI2C_MSTS_RXFLG_1                     1U      /* 1 : Receive data is ready.                                         */

/* ===============================================  LPI2C MSTS ENDFLG [8..8]  ================================================ */
                                   /* LPI2C_MSTS_ENDFLG                                                  */
#define LPI2C_MSTS_ENDFLG_0                    0U      /* 0 : Master has not generated a STOP or Repeated START condition.   */
#define LPI2C_MSTS_ENDFLG_1                    1U      /* 1 : Master has generated a STOP or Repeated START condition.       */

/* ===============================================  LPI2C MSTS STOPFLG [9..9]  =============================================== */
                                   /* LPI2C_MSTS_STOPFLG                                                 */
#define LPI2C_MSTS_STOPFLG_0                   0U      /* 0 : Master has not generated a STOP condition.                     */
#define LPI2C_MSTS_STOPFLG_1                   1U      /* 1 : Master has generated a STOP condition.                         */

/* ==============================================  LPI2C MSTS NACKFLG [10..10]  ============================================== */
                                   /* LPI2C_MSTS_NACKFLG                                                 */
#define LPI2C_MSTS_NACKFLG_0                   0U      /* 0 : Unexpected NACK not detected.                                  */
#define LPI2C_MSTS_NACKFLG_1                   1U      /* 1 : Unexpected NACK was detected.                                  */

/* ==============================================  LPI2C MSTS MALFLG [11..11]  =============================================== */
                                   /* LPI2C_MSTS_MALFLG                                                  */
#define LPI2C_MSTS_MALFLG_0                    0U      /* 0 : Master has not lost arbitration.                               */
#define LPI2C_MSTS_MALFLG_1                    1U      /* 1 : Master has lost arbitration.                                   */

/* ===============================================  LPI2C MSTS FEFLG [12..12]  =============================================== */
                                  /* LPI2C_MSTS_FEFLG                                                   */
#define LPI2C_MSTS_FEFLG_0                     0U      /* 0 : No error.                                                      */
#define LPI2C_MSTS_FEFLG_1                     1U      /* 1 : Master sending or receiving data without START condition.      */

/* ==============================================  LPI2C MSTS PLTFLG [13..13]  =============================================== */
                                   /* LPI2C_MSTS_PLTFLG                                                  */
#define LPI2C_MSTS_PLTFLG_0                    0U      /* 0 : Pin low timeout has not occurred or is disabled.               */
#define LPI2C_MSTS_PLTFLG_1                    1U      /* 1 : Pin low timeout has occurred.                                  */

/* ==============================================  LPI2C MSTS RXMFLG [14..14]  =============================================== */
                                  /* LPI2C_MSTS_RXMFLG                                                  */
#define LPI2C_MSTS_RXMFLG_0                    0U      /* 0 : Have not received matching data.                               */
#define LPI2C_MSTS_RXMFLG_1                    1U      /* 1 : Have received matching data.                                   */

/* ==============================================  LPI2C MSTS MBSYFLG [24..24]  ============================================== */
                                   /* LPI2C_MSTS_MBSYFLG                                                 */
#define LPI2C_MSTS_MBSYFLG_0                   0U      /* 0 : I2C Master is idle.                                            */
#define LPI2C_MSTS_MBSYFLG_1                   1U      /* 1 : I2C Master is busy.                                            */

/* ==============================================  LPI2C MSTS BBSYFLG [25..25]  ============================================== */
                                  /* LPI2C_MSTS_BBSYFLG                                                 */
#define LPI2C_MSTS_BBSYFLG_0                   0U      /* 0 : I2C Bus is idle.                                               */
#define LPI2C_MSTS_BBSYFLG_1                   1U      /* 1 : I2C Bus is busy.                                               */

/* ========================================================  MINTEN  ========================================================= */
                                   /* LPI2C_MINTEN_TXDIEN                                                */
#define LPI2C_MINTEN_TXDIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_TXDIEN_1                  1U      /* 1 : Interrupt enabled                                              */

/* ==============================================  LPI2C MINTEN RXDIEN [1..1]  =============================================== */
                                   /* LPI2C_MINTEN_RXDIEN                                                */
#define LPI2C_MINTEN_RXDIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_RXDIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPI2C MINTEN ENDIEN [8..8]  =============================================== */
                                 /* LPI2C_MINTEN_ENDIEN                                                */
#define LPI2C_MINTEN_ENDIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_ENDIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

