MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  LPI2C MINTEN STOPIEN [9..9]  ============================================== */
                                   /* LPI2C_MINTEN_STOPIEN                                               */
#define LPI2C_MINTEN_STOPIEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_STOPIEN_1                 1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C MINTEN NACKIEN [10..10]  ============================================= */
                                  /* LPI2C_MINTEN_NACKIEN                                               */
#define LPI2C_MINTEN_NACKIEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_NACKIEN_1                 1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C MINTEN MALIEN [11..11]  ============================================== */
                                  /* LPI2C_MINTEN_MALIEN                                                */
#define LPI2C_MINTEN_MALIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_MALIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ==============================================  LPI2C MINTEN FEIEN [12..12]  ============================================== */
                                   /* LPI2C_MINTEN_FEIEN                                                 */
#define LPI2C_MINTEN_FEIEN_0                   0U      /* 0 : Interrupt enabled.                                             */
#define LPI2C_MINTEN_FEIEN_1                   1U      /* 1 : Interrupt disabled.                                            */

/* =============================================  LPI2C MINTEN PLTIEN [13..13]  ============================================== */
                                  /* LPI2C_MINTEN_PLTIEN                                                */
#define LPI2C_MINTEN_PLTIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_PLTIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* =============================================  LPI2C MINTEN RXMIEN [14..14]  ============================================== */
                                  /* LPI2C_MINTEN_RXMIEN                                                */
#define LPI2C_MINTEN_RXMIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define LPI2C_MINTEN_RXMIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ========================================================  MDMAEN  ========================================================= */
/* ==============================================  LPI2C MDMAEN TXDMAEN [0..0]  ============================================== */
                                 /* LPI2C_MDMAEN_TXDMAEN                                               */
#define LPI2C_MDMAEN_TXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPI2C_MDMAEN_TXDMAEN_1                 1U      /* 1 : DMA request enabled                                            */

/* ==============================================  LPI2C MDMAEN RXDMAEN [1..1]  ============================================== */
                                  /* LPI2C_MDMAEN_RXDMAEN                                               */
#define LPI2C_MDMAEN_RXDMAEN_0                 0U      /* 0 : DMA request disabled.                                          */
#define LPI2C_MDMAEN_RXDMAEN_1                 1U      /* 1 : DMA request enabled.                                           */

/* =========================================================  MCFG0  ========================================================= */
/* ===============================================  LPI2C MCFG0 HRIEN [0..0]  ================================================ */
                                   /* LPI2C_MCFG0_HRIEN                                                  */
#define LPI2C_MCFG0_HRIEN_0                    0U      /* 0 : Host request input is disabled.                                */
#define LPI2C_MCFG0_HRIEN_1                    1U      /* 1 : Host request input is enabled.                                 */

/* ===============================================  LPI2C MCFG0 HRPCFG [1..1]  =============================================== */
                                  /* LPI2C_MCFG0_HRPCFG                                                 */
#define LPI2C_MCFG0_HRPCFG_0                   0U      /* 0 : Active low.                                                    */
#define LPI2C_MCFG0_HRPCFG_1                   1U      /* 1 : Active high.                                                   */

/* ===============================================  LPI2C MCFG0 HRISRC [2..2]  =============================================== */
                                  /* LPI2C_MCFG0_HRISRC                                                 */
#define LPI2C_MCFG0_HRISRC_0                   0U      /* 0 : Host request input is pin HREQ.                                */
#define LPI2C_MCFG0_HRISRC_1                   1U      /* 1 : Host request input is input trigger.                           */

/* ================================================  LPI2C MCFG0 CFEN [8..8]  ================================================ */
                                  /* LPI2C_MCFG0_CFEN                                                   */
#define LPI2C_MCFG0_CFEN_0                     0U      /* 0 : Circular FIFO is disabled.                                     */
#define LPI2C_MCFG0_CFEN_1                     1U      /* 1 : Circular FIFO is enabled.                                      */

/* ===============================================  LPI2C MCFG0 RXMEN [9..9]  ================================================ */
                                  /* LPI2C_MCFG0_RXMEN                                                  */
#define LPI2C_MCFG0_RXMEN_0                    0U      /* 0 : Received data is stored in the receive FIFO as normal.         */
#define LPI2C_MCFG0_RXMEN_1                    1U      /* 1 : Received data is discarded unless the RMF is set.              */

/* =========================================================  MCFG1  ========================================================= */
/* ===============================================  LPI2C MCFG1 CLKPS [0..2]  ================================================ */
                                   /* LPI2C_MCFG1_CLKPS                                                  */
#define LPI2C_MCFG1_CLKPS_000                  0U      /* 000 : Divide by 1.                                                 */
#define LPI2C_MCFG1_CLKPS_001                  1U      /* 001 : Divide by 2.                                                 */
#define LPI2C_MCFG1_CLKPS_010                  2U      /* 010 : Divide by 4.                                                 */
#define LPI2C_MCFG1_CLKPS_011                  3U      /* 011 : Divide by 8.                                                 */
#define LPI2C_MCFG1_CLKPS_100                  4U      /* 100 : Divide by 16.                                                */
#define LPI2C_MCFG1_CLKPS_101                  5U      /* 101 : Divide by 32.                                                */
#define LPI2C_MCFG1_CLKPS_110                  6U      /* 110 : Divide by 64.                                                */
#define LPI2C_MCFG1_CLKPS_111                  7U      /* 111 : Divide by 128.                                               */

/* ===============================================  LPI2C MCFG1 ASGEN [8..8]  ================================================ */
                                  /* LPI2C_MCFG1_ASGEN                                                  */
#define LPI2C_MCFG1_ASGEN_0                    0U      /* 0 : No effect.                                                     */
#define LPI2C_MCFG1_ASGEN_1                    1U      /* 1 : STOP condition is automatically generated whenever the transmit
                                                     FIFO is empty and LPI2C master is busy.                            */

