MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  LPI2C MCFG1 INACK [9..9]  ================================================ */
                                  /* LPI2C_MCFG1_INACK                                                  */
#define LPI2C_MCFG1_INACK_0                    0U      /* 0 : LPI2C Master will receive ACK and NACK normally.               */
#define LPI2C_MCFG1_INACK_1                    1U      /* 1 : LPI2C Master will treat a received NACK as if it was an
                                                     ACK.                                                               */

/* ==============================================  LPI2C MCFG1 PINLTOCFG [10..10]  =============================================== */
                                   /* LPI2C_MCFG1_PINLTOCFG                                                  */
#define LPI2C_MCFG1_PINLTOCFG_0                    0U      /* 0 : Pin Low Timeout Flag will set if SCL is low for longer than
                                                     the configured timeout.                                            */
#define LPI2C_MCFG1_PINLTOCFG_1                    1U      /* 1 : Pin Low Timeout Flag will set if either SCL or SDA is low
                                                     for longer than the configured timeout.                            */

/* ==============================================  LPI2C MCFG1 MCCFG [16..18]  =============================================== */
                                   /* LPI2C_MCFG1_MCCFG                                                  */
#define LPI2C_MCFG1_MCCFG_000                  0U      /* 000 : Match disabled.                                              */
#define LPI2C_MCFG1_MCCFG_010                  2U      /* 010 : Match enabled (1st data word equals MATCH0 OR MATCH1).       */
#define LPI2C_MCFG1_MCCFG_011                  3U      /* 011 : Match enabled (any data word equals MATCH0 OR MATCH1).       */
#define LPI2C_MCFG1_MCCFG_100                  4U      /* 100 : Match enabled (1st data word equals MATCH0 AND 2nd data
                                                     word equals MATCH1).                                               */
#define LPI2C_MCFG1_MCCFG_101                  5U      /* 101 : Match enabled (any data word equals MATCH0 AND next data
                                                     word equals MATCH1).                                               */
#define LPI2C_MCFG1_MCCFG_110                  6U      /* 110 : Match enabled (1st data word AND MATCH1 equals MATCH0
                                                     AND MATCH1).                                                       */
#define LPI2C_MCFG1_MCCFG_111                  7U      /* 111 : Match enabled (any data word AND MATCH1 equals MATCH0
                                                     AND MATCH1).                                                       */

/* =============================================  LPI2C MCFG1 PINMCFG [24..26]  ============================================== */
                                   /* LPI2C_MCFG1_PINMCFG                                                */
#define LPI2C_MCFG1_PINMCFG_000                0U      /* 000 : LPI2C configured for 2-pin open drain mode.                  */
#define LPI2C_MCFG1_PINMCFG_001                1U      /* 001 : LPI2C configured for 2-pin output only mode (ultra-fast
                                                     mode).                                                             */
#define LPI2C_MCFG1_PINMCFG_010                2U      /* 010 : LPI2C configured for 2-pin push-pull mode.                   */
#define LPI2C_MCFG1_PINMCFG_011                3U      /* 011 : LPI2C configured for 4-pin push-pull mode.                   */
#define LPI2C_MCFG1_PINMCFG_100                4U      /* 100 : LPI2C configured for 2-pin open drain mode with separate
                                                     LPI2C slave.                                                       */
#define LPI2C_MCFG1_PINMCFG_101                5U      /* 101 : LPI2C configured for 2-pin output only mode (ultra-fast
                                                     mode) with separate LPI2C slave.                                   */
#define LPI2C_MCFG1_PINMCFG_110                6U      /* 110 : LPI2C configured for 2-pin push-pull mode with separate
                                                     LPI2C slave.                                                       */
#define LPI2C_MCFG1_PINMCFG_111                7U      /* 111 : LPI2C configured for 4-pin push-pull mode (inverted outputs).*/

/* =========================================================  MCFG2  ========================================================= */
/* =========================================================  MCFG3  ========================================================= */
/* ========================================================  MDATAM  ========================================================= */
/* =======================================================  MCLKCFG0  ======================================================= */
/* =======================================================  MCLKCFG1  ======================================================= */
/* ========================================================  MFCTRL  ========================================================= */
/* =========================================================  MFSTS  ========================================================= */
/* ========================================================  MTXDATA  ======================================================== */
/* ===============================================  LPI2C MTXDATA CMD [8..10]  =============================================== */
                                 /* LPI2C_MTXDATA_CMD                                                  */
#define LPI2C_MTXDATA_CMD_000                  0U      /* 000 : Transmit DATA[7:0].                                          */
#define LPI2C_MTXDATA_CMD_001                  1U      /* 001 : Receive (DATA[7:0] + 1) bytes.                               */
#define LPI2C_MTXDATA_CMD_010                  2U      /* 010 : Generate STOP condition.                                     */
#define LPI2C_MTXDATA_CMD_011                  3U      /* 011 : Receive and discard (DATA[7:0] + 1) bytes.                   */
#define LPI2C_MTXDATA_CMD_100                  4U      /* 100 : Generate (repeated) START and transmit address in DATA[7:0]. */
#define LPI2C_MTXDATA_CMD_101                  5U      /* 101 : Generate (repeated) START and transmit address in DATA[7:0].
                                                     This transfer expects a NACK to be returned.                       */
#define LPI2C_MTXDATA_CMD_110                  6U      /* 110 : Generate (repeated) START and transmit address in DATA[7:0]
                                                     using high speed mode.                                             */
#define LPI2C_MTXDATA_CMD_111                  7U      /* 111 : Generate (repeated) START and transmit address in DATA[7:0]
                                                     using high speed mode. This transfer expects a NACK to
                                                     be returned.                                                       */

