MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =============================================  LPUART BR MADDREN2 [30..30]  ============================================== */
                                   /* LPUART_BR_MADDREN2                                                */
#define LPUART_BR_MADDREN2_0                  0U      /* 0 : Normal operation.                                              */
#define LPUART_BR_MADDREN2_1                  1U      /* 1 : Enables automatic address matching or data matching mode
                                                     for MATCH[MA2].                                                    */

/* =============================================  LPUART BR MADDREN1 [31..31]  ============================================== */
                                  /* LPUART_BR_MADDREN1                                                */
#define LPUART_BR_MADDREN1_0                  0U      /* 0 : Normal operation.                                              */
#define LPUART_BR_MADDREN1_1                  1U      /* 1 : Enables automatic address matching or data matching mode
                                                     for MATCH[MA1].                                                    */

/* ==========================================================  STS  ========================================================== */
/* =============================================  LPUART STS RXDMFLG2 [14..14]  ============================================= */
                                  /* LPUART_STS_RXDMFLG2                                               */
#define LPUART_STS_RXDMFLG2_0                 0U      /* 0 : Received data is not equal to MA2                              */
#define LPUART_STS_RXDMFLG2_1                 1U      /* 1 : Received data is equal to MA2                                  */

/* =============================================  LPUART STS RXDMFLG1 [15..15]  ============================================= */
                                  /* LPUART_STS_RXDMFLG1                                               */
#define LPUART_STS_RXDMFLG1_0                 0U      /* 0 : Received data is not equal to MA1                              */
#define LPUART_STS_RXDMFLG1_1                 1U      /* 1 : Received data is equal to MA1                                  */

/* ==============================================  LPUART STS PEFLG [16..16]  =============================================== */
                                  /* LPUART_STS_PEFLG                                                  */
#define LPUART_STS_PEFLG_0                    0U      /* 0 : No parity error.                                               */
#define LPUART_STS_PEFLG_1                    1U      /* 1 : Parity error.                                                  */

/* ==============================================  LPUART STS FEFLG [17..17]  =============================================== */
                                  /* LPUART_STS_FEFLG                                                  */
#define LPUART_STS_FEFLG_0                    0U      /* 0 : No framing error detected. This does not guarantee the framing
                                                     is correct.                                                        */
#define LPUART_STS_FEFLG_1                    1U      /* 1 : Framing error.                                                 */

/* ==============================================  LPUART STS NEFLG [18..18]  =============================================== */
                                  /* LPUART_STS_NEFLG                                                  */
#define LPUART_STS_NEFLG_0                    0U      /* 0 : No noise detected.                                             */
#define LPUART_STS_NEFLG_1                    1U      /* 1 : Noise detected in the received character in LPUART_DATA.       */

/* =============================================  LPUART STS OVREFLG [19..19]  ============================================== */
                                   /* LPUART_STS_OVREFLG                                                */
#define LPUART_STS_OVREFLG_0                  0U      /* 0 : No overrun.                                                    */
#define LPUART_STS_OVREFLG_1                  1U      /* 1 : Receive overrun (new LPUART data lost).                        */


/* =============================================  LPUART STS IDLEFLG [20..20]  ============================================== */
                                  /* LPUART_STS_IDLEFLG                                                */
#define LPUART_STS_IDLEFLG_0                  0U      /* 0 : No idle line detected.                                         */
#define LPUART_STS_IDLEFLG_1                  1U      /* 1 : Idle line was detected.                                        */

/* =============================================  LPUART STS RXBFFLG [21..21]  ============================================== */
                                  /* LPUART_STS_RXBFFLG                                                */
#define LPUART_STS_RXBFFLG_0                  0U      /* 0 : Receive data buffer empty.                                     */
#define LPUART_STS_RXBFFLG_1                  1U      /* 1 : Receive data buffer full.                                      */

/* ==============================================  LPUART STS TXCFLG [22..22]  ============================================== */
                                  /* LPUART_STS_TXCFLG                                                 */
#define LPUART_STS_TXCFLG_0                   0U      /* 0 : Transmitter active (sending data  a preamble  or a break).     */
#define LPUART_STS_TXCFLG_1                   1U      /* 1 : Transmitter idle (transmission activity complete).             */

/* =============================================  LPUART STS TXBEFLG [23..23]  ============================================== */
                                  /* LPUART_STS_TXBEFLG                                                */
#define LPUART_STS_TXBEFLG_0                  0U      /* 0 : Transmit data buffer full.                                     */
#define LPUART_STS_TXBEFLG_1                  1U      /* 1 : Transmit data buffer empty.                                    */

/* ============================================  LPUART STS RXDINIFLG [24..24]  ============================================= */
                                 /* LPUART_STS_RXDINIFLG                                              */
#define LPUART_STS_RXDINIFLG_0                0U      /* 0 : LPUART receiver idle waiting for a start bit.                  */
#define LPUART_STS_RXDINIFLG_1                1U      /* 1 : LPUART receiver active (RXD input not idle).                   */

