MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  LPUART CTRL ITSEL [2..2]  =============================================== */
                                 /* LPUART_CTRL_ITSEL                                                 */
#define LPUART_CTRL_ITSEL_0                   0U      /* 0 : Idle character bit count starts after start bit.               */
#define LPUART_CTRL_ITSEL_1                   1U      /* 1 : Idle character bit count starts after stop bit.                */


/* =============================================  LPUART CTRL RXWAKESEL [3..3]  ============================================= */
                                 /* LPUART_CTRL_RXWAKESEL                                             */
#define LPUART_CTRL_RXWAKESEL_0               0U      /* 0 : Configures RWU for idle-line wakeup.                           */
#define LPUART_CTRL_RXWAKESEL_1               1U      /* 1 : Configures RWU with address-mark wakeup.                       */


/* =============================================  LPUART CTRL RXTXCSEL [4..4]  ============================================== */
                                  /* LPUART_CTRL_RXTXCSEL                                              */
#define LPUART_CTRL_RXTXCSEL_0                0U      /* 0 : Receiver and transmitter use 8-bit data characters.            */
#define LPUART_CTRL_RXTXCSEL_1                1U      /* 1 : Receiver and transmitter use 9-bit data characters.            */


/* =============================================  LPUART CTRL RXISRCSEL [5..5]  ============================================= */
                                  /* LPUART_CTRL_RXISRCSEL                                             */
#define LPUART_CTRL_RXISRCSEL_0               0U      /* 0 : Provided LOOPS is set  RSRC is cleared  selects internal
                                                     loop back mode and the LPUART does not use the RXD pin.            */
#define LPUART_CTRL_RXISRCSEL_1               1U      /* 1 : Single-wire LPUART mode where the TXD pin is connected to
                                                     the transmitter output and receiver input.                         */


/* ============================================  LPUART CTRL DOZEMODEEN [6..6]  ============================================= */
                                  /* LPUART_CTRL_DOZEMODEEN                                            */
#define LPUART_CTRL_DOZEMODEEN_0              0U      /* 0 : LPUART is enabled in Doze mode.                                */
#define LPUART_CTRL_DOZEMODEEN_1              1U      /* 1 : LPUART is disabled in Doze mode.                               */


/* ==============================================  LPUART CTRL LSWSEL [7..7]  =============================================== */
                                   /* LPUART_CTRL_LSWSEL                                                */
#define LPUART_CTRL_LSWSEL_0                  0U      /* 0 : Normal operation - RXD and TXD use separate pins.              */
#define LPUART_CTRL_LSWSEL_1                  1U      /* 1 : Loop mode or single-wire mode where transmitter outputs
                                                     are internally connected to receiver input (see RSRC bit).         */


/* =============================================  LPUART CTRL IDLECCFG [8..10]  ============================================= */
                                   /* LPUART_CTRL_IDLECCFG                                              */
#define LPUART_CTRL_IDLECCFG_000              0U      /* 000 : 1 idle character                                             */
#define LPUART_CTRL_IDLECCFG_001              1U      /* 001 : 2 idle characters                                            */
#define LPUART_CTRL_IDLECCFG_010              2U      /* 010 : 4 idle characters                                            */
#define LPUART_CTRL_IDLECCFG_011              3U      /* 011 : 8 idle characters                                            */
#define LPUART_CTRL_IDLECCFG_100              4U      /* 100 : 16 idle characters                                           */
#define LPUART_CTRL_IDLECCFG_101              5U      /* 101 : 32 idle characters                                           */
#define LPUART_CTRL_IDLECCFG_110              6U      /* 110 : 64 idle characters                                           */
#define LPUART_CTRL_IDLECCFG_111              7U      /* 111 : 128 idle characters                                          */


/* ============================================  LPUART CTRL RXTXSELM7 [11..11]  ============================================ */
                                  /* LPUART_CTRL_RXTXSELM7                                             */
#define LPUART_CTRL_RXTXSELM7_0               0U      /* 0 : Receiver and transmitter use 8-bit to 10-bit data characters.  */
#define LPUART_CTRL_RXTXSELM7_1               1U      /* 1 : Receiver and transmitter use 7-bit data characters.            */


/* =============================================  LPUART CTRL FIENM2 [14..14]  ============================================== */
                                  /* LPUART_CTRL_FIENM2                                                */
#define LPUART_CTRL_FIENM2_0                  0U      /* 0 : MA2F interrupt disabled                                        */
#define LPUART_CTRL_FIENM2_1                  1U      /* 1 : MA2F interrupt enabled                                         */


/* =============================================  LPUART CTRL FIENM1 [15..15]  ============================================== */
                                   /* LPUART_CTRL_FIENM1                                                */
#define LPUART_CTRL_FIENM1_0                  0U      /* 0 : MA1F interrupt disabled                                        */
#define LPUART_CTRL_FIENM1_1                  1U      /* 1 : MA1F interrupt enabled                                         */


/* ==============================================  LPUART CTRL TXBK [16..16]  =============================================== */
                                  /* LPUART_CTRL_TXBK                                                  */
#define LPUART_CTRL_TXBK_0                    0U      /* 0 : Normal transmitter operation.                                  */
#define LPUART_CTRL_TXBK_1                    1U      /* 1 : Queue break character(s) to be sent.                           */


/* ============================================  LPUART CTRL RXWUPCTRL [17..17]  ============================================ */
                                /* LPUART_CTRL_RXWUPCTRL                                             */
#define LPUART_CTRL_RXWUPCTRL_0               0U      /* 0 : Normal receiver operation.                                     */
#define LPUART_CTRL_RXWUPCTRL_1               1U      /* 1 : LPUART receiver in standby waiting for wakeup condition.       */


/* ==============================================  LPUART CTRL RXEN [18..18]  =============================================== */
                                 /* LPUART_CTRL_RXEN                                                  */
#define LPUART_CTRL_RXEN_0                    0U      /* 0 : Receiver disabled.                                             */
#define LPUART_CTRL_RXEN_1                    1U      /* 1 : Receiver enabled.                                              */


/* ==============================================  LPUART CTRL TXEN [19..19]  =============================================== */
                                /* LPUART_CTRL_TXEN                                                  */
#define LPUART_CTRL_TXEN_0                    0U      /* 0 : Transmitter disabled.                                          */
#define LPUART_CTRL_TXEN_1                    1U      /* 1 : Transmitter enabled.                                           */


/* =============================================  LPUART CTRL IDLEIEN [20..20]  ============================================= */
                                   /* LPUART_CTRL_IDLEIEN                                               */
#define LPUART_CTRL_IDLEIEN_0                 0U      /* 0 : Hardware interrupts from IDLE disabled; use polling.           */
#define LPUART_CTRL_IDLEIEN_1                 1U      /* 1 : Hardware interrupt requested when IDLE flag is 1.              */


