MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  COMP CTRL1 CNISEL [24..25]  =============================================== */
                                  /* COMP_CTRL1_CNISEL                                                  */
#define COMP_CTRL1_CNISEL_00                   0U      /* 00 : IN0  from the 8-bit DAC output                                */
#define COMP_CTRL1_CNISEL_01                   1U      /* 01 : IN1  from the analog 8-1 mux                                  */


/* ==============================================  COMP CTRL1 CPISEL [27..28]  =============================================== */
                                 /* COMP_CTRL1_CPISEL                                                  */
#define COMP_CTRL1_CPISEL_00                   0U      /* 00 : IN0  from the 8-bit DAC output                                */
#define COMP_CTRL1_CPISEL_01                   1U      /* 01 : IN1  from the analog 8-1 mux                                  */


/* =========================================================  CTRL2  ========================================================= */
/* ==============================================  COMP CTRL2 IDCLKCFG [8..13]  ============================================== */
                                /* COMP_CTRL2_IDCLKCFG                                                */
#define COMP_CTRL2_IDCLKCFG_000000             0U      /* 000000 : The modulus is set to 64 (same with 111111).              */

/* ===============================================  COMP CTRL2 NSCFG [14..15]  =============================================== */
                                 /* COMP_CTRL2_NSCFG                                                   */
#define COMP_CTRL2_NSCFG_00                    0U      /* 00 : The comparison result is sampled as soon as the active
                                                     channel is scanned in one round-robin clock.                       */
#define COMP_CTRL2_NSCFG_01                    1U      /* 01 : The sampling takes place 1 round-robin clock cycle after
                                                     the next cycle of the round-robin clock.                           */
#define COMP_CTRL2_NSCFG_10                    2U      /* 10 : The sampling takes place 2 round-robin clock cycles after
                                                     the next cycle of the round-robin clock.                           */
#define COMP_CTRL2_NSCFG_11                    3U      /* 11 : The sampling takes place 3 round-robin clock cycles after
                                                     the next cycle of the round-robin clock.                           */


/* =============================================  COMP CTRL2 MUXFCHSEL [25..27]  ============================================= */
                                 /* COMP_CTRL2_MUXFCHSEL                                               */
#define COMP_CTRL2_MUXFCHSEL_000               0U      /* 000 : Channel 0 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_001               1U      /* 001 : Channel 1 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_010               2U      /* 010 : Channel 2 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_011               3U      /* 011 : Channel 3 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_100               4U      /* 100 : Channel 4 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_101               5U      /* 101 : Channel 5 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_110               6U      /* 110 : Channel 6 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */
#define COMP_CTRL2_MUXFCHSEL_111               7U      /* 111 : Channel 7 is selected as the fixed reference input for
                                                     the fixed mux port.                                                */


/* =============================================  COMP CTRL2 MUXFPSEL [29..29]  ============================================== */
                                 /* COMP_CTRL2_MUXFPSEL                                                */
#define COMP_CTRL2_MUXFPSEL_0                  0U      /* 0 : The Plus port is fixed. Only the inputs to the Minus port
                                                     are swept in each round.                                           */
#define COMP_CTRL2_MUXFPSEL_1                  1U      /* 1 : The Minus port is fixed. Only the inputs to the Plus port
                                                     are swept in each round.                                           */


/* ===============================================  COMP CTRL2 RRIEN [30..30]  =============================================== */
                               /* COMP_CTRL2_RRIEN                                                   */
#define COMP_CTRL2_RRIEN_0                     0U      /* 0 : The round-robin interrupt is disabled.                         */
#define COMP_CTRL2_RRIEN_1                     1U      /* 1 : The round-robin interrupt is enabled when a comparison result
                                                     changes from the last sample.                                      */


/* ===============================================  COMP CTRL2 RRSEL [31..31]  =============================================== */
                                  /* COMP_CTRL2_RRSEL                                                   */
#define COMP_CTRL2_RRSEL_0                     0U      /* 0 : Round-robin operation is disabled.                             */
#define COMP_CTRL2_RRSEL_1                     1U      /* 1 : Round-robin operation is enabled.                              */




/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

