MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ========================================================  FEATURE  ======================================================== */
/* =============================================  SYSMC FEATURE HSRUNAVA [0..0]  ============================================= */
                                  /* SYSMC_FEATURE_HSRUNAVA                                             */
#define SYSMC_FEATURE_HSRUNAVA_0               0U      /* 0 : The feature is not available.                                  */
#define SYSMC_FEATURE_HSRUNAVA_1               1U      /* 1 : The feature is available.                                      */


/* ==============================================  SYSMC FEATURE LLSAVA [3..3]  ============================================== */
                                   /* SYSMC_FEATURE_LLSAVA                                               */
#define SYSMC_FEATURE_LLSAVA_0                 0U      /* 0 : The feature is not available.                                  */
#define SYSMC_FEATURE_LLSAVA_1                 1U      /* 1 : The feature is available.                                      */


/* =============================================  SYSMC FEATURE LLS2AVA [5..5]  ============================================== */
                                  /* SYSMC_FEATURE_LLS2AVA                                              */
#define SYSMC_FEATURE_LLS2AVA_0                0U      /* 0 : The feature is not available.                                  */
#define SYSMC_FEATURE_LLS2AVA_1                1U      /* 1 : The feature is available.                                      */


/* =============================================  SYSMC FEATURE VLLS0AVA [6..6]  ============================================= */
                                   /* SYSMC_FEATURE_VLLS0AVA                                             */
#define SYSMC_FEATURE_VLLS0AVA_0               0U      /* 0 : The feature is not available.                                  */
#define SYSMC_FEATURE_VLLS0AVA_1               1U      /* 1 : The feature is available.                                      */


/* =========================================================  PMPRO  ========================================================= */
/* ==============================================  SYSMC PMPRO ALLOWLP [5..5]  ============================================== */
                                  /* SYSMC_PMPROALLOWLP                                               */
#define SYSMC_PMPRO_ALLOWLP_0                 0U      /* 0 : VLPR and VLPS are not allowed.                                 */
#define SYSMC_PMPRO_ALLOWLP_1                 1U      /* 1 : VLPR and VLPS are allowed.                                     */


/* ==============================================  SYSMC PMPRO ALLOWHS [7..7]  =============================================== */
                                /* SYSMC_PMPRO_ALLOWHS                                                */
#define SYSMC_PMPRO_ALLOWHS_0                  0U      /* 0 : HSRUN is not allowed                                           */
#define SYSMC_PMPRO_ALLOWHS_1                  1U      /* 1 : HSRUN is allowed                                               */


/* ========================================================  PMCTRL  ========================================================= */
/* =============================================  SYSMC PMCTRL STOPCTRL [0..2]  ============================================== */
                                  /* SYSMC_PMCTRL_STOPCTRL                                              */
#define SYSMC_PMCTRL_STOPCTRL_000              0U      /* 000 : Normal Stop (STOP)                                           */
#define SYSMC_PMCTRL_STOPCTRL_010              2U      /* 010 : Very-Low-Power Stop (VLPS)                                   */
#define SYSMC_PMCTRL_STOPCTRL_110              6U      /* 110 : Reseved                                                      */


/* =============================================  SYSMC PMCTRL VLPSEA [3..3]  ============================================= */
                                  /* SYSMC_PMCTRL_VLPSEA                                             */
#define SYSMC_PMCTRL_VLPSEA_0               0U      /* 0 : The previous stop mode entry was successful.                   */
#define SYSMC_PMCTRL_VLPSEA_1               1U      /* 1 : The previous stop mode entry was aborted.                      */


/* ==============================================  SYSMC PMCTRL RUNCTRL [5..6]  ============================================== */
                                 /* SYSMC_PMCTRL_RUNCTRL                                               */
#define SYSMC_PMCTRL_RUNCTRL_00                0U      /* 00 : Normal Run mode (RUN)                                         */
#define SYSMC_PMCTRL_RUNCTRL_10                2U      /* 10 : Very-Low-Power Run mode (VLPR)                                */
#define SYSMC_PMCTRL_RUNCTRL_11                3U      /* 11 : High Speed Run mode (HSRUN)                                   */


/* =======================================================  STOPOSEL  ======================================================== */
/* ============================================  SYSMC STOPOSEL STOPOSEL [6..7]  ============================================= */
                                   /* SYSMC_STOPOSEL_STOPOSEL                                            */
#define SYSMC_STOPOSEL_STOPOSEL_01             1U      /* 01 : STOP1 - Stop with both system and bus clocks disabled         */
#define SYSMC_STOPOSEL_STOPOSEL_10             2U      /* 10 : STOP2 - Stop with system clock disabled and bus clock enabled */


/* =========================================================  PMSTS  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            RMU                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  VERID  ========================================================= */
/* ===============================================  RMU VERID FEATURE [0..15]  =============================================== */
                              /* RMU_VERID_FEATURE                                                  */
#define RMU_VERID_FEATURE_11                   3U      /* 11 : Standard feature set.                                         */


/* =========================================================  PARA  ========================================================== */
/* ===============================================  RMU PARA LVDRSTSTS [0..0]  =============================================== */
                                 /* RMU_PARA_LVDRSTSTS                                                 */
#define RMU_PARA_LVDRSTSTS_0                   0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_LVDRSTSTS_1                   1U      /* 1 : The feature is available.                                      */


/* ==============================================  RMU PARA CLKLRSTSTS [1..1]  =============================================== */
                                  /* RMU_PARA_CLKLRSTSTS                                                */
#define RMU_PARA_CLKLRSTSTS_0                  0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_CLKLRSTSTS_1                  1U      /* 1 : The feature is available.                                      */


/* ==============================================  RMU PARA LOCKLRSTSTS [2..2]  ============================================== */
                               /* RMU_PARA_LOCKLRSTSTS                                               */
#define RMU_PARA_LOCKLRSTSTS_0                 0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_LOCKLRSTSTS_1                 1U      /* 1 : The feature is available.                                      */


/* ===============================================  RMU PARA WDTRSTSTS [5..5]  =============================================== */
                                  /* RMU_PARA_WDTRSTSTS                                                 */
#define RMU_PARA_WDTRSTSTS_0                   0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_WDTRSTSTS_1                   1U      /* 1 : The feature is available.                                      */


/* ================================================  RMU PARA ERSTSTS [6..6]  ================================================ */
                                 /* RMU_PARA_ERSTSTS                                                   */
#define RMU_PARA_ERSTSTS_0                     0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_ERSTSTS_1                     1U      /* 1 : The feature is available.                                      */


/* ===============================================  RMU PARA PORRSTSTS [7..7]  =============================================== */
                                 /* RMU_PARA_PORRSTSTS                                                 */
#define RMU_PARA_PORRSTSTS_0                   0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_PORRSTSTS_1                   1U      /* 1 : The feature is available.                                      */


/* ==============================================  RMU PARA JTAGRSTSTS [8..8]  =============================================== */
                                  /* RMU_PARA_JTAGRSTSTS                                                */
#define RMU_PARA_JTAGRSTSTS_0                  0U      /* 0 : The feature is not available.                                  */
#define RMU_PARA_JTAGRSTSTS_1                  1U      /* 1 : The feature is available.                                      */


