MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  RMU SRSTFLG PORRCD [7..7]  =============================================== */
                                  /* RMU_SRSTFLG_PORRCD                                                 */
#define RMU_SRSTFLG_PORRCD_0                   0U      /* 0 : Reset not caused by POR                                        */
#define RMU_SRSTFLG_PORRCD_1                   1U      /* 1 : Reset caused by POR                                            */


/* =============================================  RMU SRSTFLG JTAGRSTRCD [8..8]  ============================================= */
                                  /* RMU_SRSTFLG_JTAGRSTRCD                                             */
#define RMU_SRSTFLG_JTAGRSTRCD_0               0U      /* 0 : Reset not caused by JTAG                                       */
#define RMU_SRSTFLG_JTAGRSTRCD_1               1U      /* 1 : Reset caused by JTAG                                           */


/* ==============================================  RMU SRSTFLG CLOCKRCD [9..9]  ============================================== */
                                  /* RMU_SRSTFLG_CLOCKRCD                                               */
#define RMU_SRSTFLG_CLOCKRCD_0                 0U      /* 0 : Reset not caused by core LOCKUP event                          */
#define RMU_SRSTFLG_CLOCKRCD_1                 1U      /* 1 : Reset caused by core LOCKUP event                              */


/* =============================================  RMU SRSTFLG SWRSTRCD [10..10]  ============================================= */
                                   /* RMU_SRSTFLG_SWRSTRCD                                               */
#define RMU_SRSTFLG_SWRSTRCD_0                 0U      /* 0 : Reset not caused by software setting of SYSRESETREQ bit        */
#define RMU_SRSTFLG_SWRSTRCD_1                 1U      /* 1 : Reset caused by software setting of SYSRESETREQ bit            */


/* ============================================  RMU SRSTFLG SRSTREGRCD [11..11]  ============================================ */
                                  /* RMU_SRSTFLG_SRSTREGRCD                                             */
#define RMU_SRSTFLG_SRSTREGRCD_0               0U      /* 0 : Reset was not caused by host debugger system setting of
                                                     the System Reset Request bit                                       */
#define RMU_SRSTFLG_SRSTREGRCD_1               1U      /* 1 : Reset was caused by host debugger system setting of the
                                                     System Reset Request bit                                           */


/* ==========================================  RMU SRSTFLG STOPACKERSTRCD [13..13]  ========================================== */
                                 /* RMU_SRSTFLG_STOPACKERSTRCD                                         */
#define RMU_SRSTFLG_STOPACKERSTRCD_0           0U      /* 0 : Reset not caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                 */
#define RMU_SRSTFLG_STOPACKERSTRCD_1           1U      /* 1 : Reset caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                 */


/* ========================================================  RSTIEN  ========================================================= */
/* =============================================  RMU RSTIEN RSTDTIMCFG [0..1]  ============================================== */
                                  /* RMU_RSTIEN_RSTDTIMCFG                                              */
#define RMU_RSTIEN_RSTDTIMCFG_00               0U      /* 00 : 10 LPO cycles                                                 */
#define RMU_RSTIEN_RSTDTIMCFG_01               1U      /* 01 : 34 LPO cycles                                                 */
#define RMU_RSTIEN_RSTDTIMCFG_10               2U      /* 10 : 130 LPO cycles                                                */
#define RMU_RSTIEN_RSTDTIMCFG_11               3U      /* 11 : 514 LPO cycles                                                */

/* ===============================================  RMU RSTIEN CLKLIEN [2..2]  =============================================== */
                                  /* RMU_RSTIEN_CLKLIEN                                                 */
#define RMU_RSTIEN_CLKLIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_CLKLIEN_1                   1U      /* 1 : Interrupt enabled.                                             */


/* ==============================================  RMU RSTIEN LOCKLIEN [3..3]  =============================================== */
                                 /* RMU_RSTIEN_LOCKLIEN                                                */
#define RMU_RSTIEN_LOCKLIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_LOCKLIEN_1                  1U      /* 1 : Interrupt enabled.                                             */

/* ================================================  RMU RSTIEN WDTIEN [5..5]  ================================================ */
                                  /* RMU_RSTIEN_WDTIEN                                                   */
#define RMU_RSTIEN_WDTIEN_0                     0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_WDTIEN_1                     1U      /* 1 : Interrupt enabled.                                             */


/* ===============================================  RMU RSTIEN EXTPIEN [6..6]  =============================================== */
                                   /* RMU_RSTIEN_EXTPIEN                                                 */
#define RMU_RSTIEN_EXTPIEN_0                   0U      /* 0 : Reset not caused by external reset pin                         */
#define RMU_RSTIEN_EXTPIEN_1                   1U      /* 1 : Reset caused by external reset pin                             */


/* ================================================  RMU RSTIEN GIEN [7..7]  ================================================= */
                                  /* RMU_RSTIEN_GIEN                                                    */
#define RMU_RSTIEN_GIEN_0                      0U      /* 0 : All interrupt sources disabled.                                */
#define RMU_RSTIEN_GIEN_1                      1U      /* 1 : All interrupt sources enabled. Note that the individual
                                                     interrupt-enable bits still need to be set to generate
                                                     interrupts.                                                        */


/* ===============================================  RMU RSTIEN JTAGIEN [8..8]  =============================================== */
                                  /* RMU_RSTIEN_JTAGIEN                                                 */
#define RMU_RSTIEN_JTAGIEN_0                   0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_JTAGIEN_1                   1U      /* 1 : Interrupt enabled.                                             */


