MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==============================================  RMU RSTIEN CLOCKIEN [9..9]  =============================================== */
                                  /* RMU_RSTIEN_CLOCKIEN                                                */
#define RMU_RSTIEN_CLOCKIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_CLOCKIEN_1                  1U      /* 1 : Interrupt enabled.                                             */


/* ===============================================  RMU RSTIEN SWIEN [10..10]  =============================================== */
                                  /* RMU_RSTIEN_SWIEN                                                   */
#define RMU_RSTIEN_SWIEN_0                     0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_SWIEN_1                     1U      /* 1 : Interrupt enabled.                                             */


/* =============================================  RMU RSTIEN SRSTREQEN [11..11]  ============================================= */
                                  /* RMU_RSTIEN_SRSTREQEN                                               */
#define RMU_RSTIEN_SRSTREQEN_0                 0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_SRSTREQEN_1                 1U      /* 1 : Interrupt enabled.                                             */


/* =============================================  RMU RSTIEN SACKEIEN [13..13]  ============================================== */
                                  /* RMU_RSTIEN_SACKEIEN                                                */
#define RMU_RSTIEN_SACKEIEN_0                  0U      /* 0 : Interrupt disabled.                                            */
#define RMU_RSTIEN_SACKEIEN_1                  1U      /* 1 : Interrupt enabled.                                             */




/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  PLLO  ========================================================== */
/* =========================================================  PLLOS  ========================================================= */
/* =========================================================  PLLOC  ========================================================= */
/* =========================================================  PLLOT  ========================================================= */
/* =========================================================  PLLI  ========================================================== */
/* ========================================================  PLLTDS  ========================================================= */
/* =========================================================  PLLID  ========================================================= */



/* =========================================================================================================================== */
/* ================                                          APM32_SCB                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  ACTLR  ========================================================= */
/* =========================================================  CPUID  ========================================================= */
/* =========================================================  ICSR  ========================================================== */
/* ============================================  APM32_SCB ICSR RETTOBASE [11..11]  ============================================ */
                                  /* APM32_SCB_ICSR_RETTOBASE                                             */
#define APM32_SCB_ICSR_RETTOBASE_0               0U      /* 0 : there are preempted active exceptions to execute               */
#define APM32_SCB_ICSR_RETTOBASE_1               1U      /* 1 : there are no active exceptions  or the currently-executing
                                                     exception is the only active exception                             */


/* ===========================================  APM32_SCB ICSR ISRPENDING [22..22]  ============================================ */
                                   /* APM32_SCB_ICSR_ISRPENDING                                            */
#define APM32_SCB_ICSR_ISRPENDING_0              0U      /* 0 : interrupt not pending                                          */
#define APM32_SCB_ICSR_ISRPENDING_1              1U      /* 1 : interrupt pending                                              */


/* ===========================================  APM32_SCB ICSR ISRPREEMPT [23..23]  ============================================ */
                                  /* APM32_SCB_ICSR_ISRPREEMPT                                            */
#define APM32_SCB_ICSR_ISRPREEMPT_0              0U      /* 0 : Will not service                                               */
#define APM32_SCB_ICSR_ISRPREEMPT_1              1U      /* 1 : Will service a pending exception                               */


/* ============================================  APM32_SCB ICSR PENDSTCLR [25..25]  ============================================ */
                                   /* APM32_SCB_ICSR_PENDSTCLR                                             */
#define APM32_SCB_ICSR_PENDSTCLR_0               0U      /* 0 : no effect                                                      */
#define APM32_SCB_ICSR_PENDSTCLR_1               1U      /* 1 : removes the pending state from the SysTick exception           */


/* ============================================  APM32_SCB ICSR PENDSTSET [26..26]  ============================================ */
                                  /* APM32_SCB_ICSR_PENDSTSET                                             */
#define APM32_SCB_ICSR_PENDSTSET_0               0U      /* 0 : write: no effect; read: SysTick exception is not pending       */
#define APM32_SCB_ICSR_PENDSTSET_1               1U      /* 1 : write: changes SysTick exception state to pending; read:
                                                     SysTick exception is pending                                       */


