MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ==========================================  APM32_SCB SHCSR SVCALLPENDED [15..15]  ========================================== */
                                  /* APM32_SCB_SHCSR_SVCALLPENDED                                         */
#define APM32_SCB_SHCSR_SVCALLPENDED_0           0U      /* 0 : exception is not pending                                       */
#define APM32_SCB_SHCSR_SVCALLPENDED_1           1U      /* 1 : exception is pending                                           */


/* ==========================================  APM32_SCB SHCSR MEMFAULTENA [16..16]  =========================================== */
                                   /* APM32_SCB_SHCSR_MEMFAULTENA                                          */
#define APM32_SCB_SHCSR_MEMFAULTENA_0            0U      /* 0 : disable the exception                                          */
#define APM32_SCB_SHCSR_MEMFAULTENA_1            1U      /* 1 : enable the exception                                           */


/* ==========================================  APM32_SCB SHCSR BUSFAULTENA [17..17]  =========================================== */
                                   /* APM32_SCB_SHCSR_BUSFAULTENA                                          */
#define APM32_SCB_SHCSR_BUSFAULTENA_0            0U      /* 0 : disable the exception                                          */
#define APM32_SCB_SHCSR_BUSFAULTENA_1            1U      /* 1 : enable the exception                                           */


/* ==========================================  APM32_SCB SHCSR USGFAULTENA [18..18]  =========================================== */
                                   /* APM32_SCB_SHCSR_USGFAULTENA                                          */
#define APM32_SCB_SHCSR_USGFAULTENA_0            0U      /* 0 : disable the exception                                          */
#define APM32_SCB_SHCSR_USGFAULTENA_1            1U      /* 1 : enable the exception                                           */


/* =========================================================  CFSR  ========================================================== */
/* =============================================  APM32_SCB CFSR IACCVIOL [0..0]  ============================================== */
                                  /* APM32_SCB_CFSR_IACCVIOL                                              */
#define APM32_SCB_CFSR_IACCVIOL_0                0U      /* 0 : no instruction access violation fault                          */
#define APM32_SCB_CFSR_IACCVIOL_1                1U      /* 1 : the processor attempted an instruction fetch from a location
                                                     that does not permit execution                                     */


/* =============================================  APM32_SCB CFSR DACCVIOL [1..1]  ============================================== */
                                  /* APM32_SCB_CFSR_DACCVIOL                                              */
#define APM32_SCB_CFSR_DACCVIOL_0                0U      /* 0 : no data access violation fault                                 */
#define APM32_SCB_CFSR_DACCVIOL_1                1U      /* 1 : the processor attempted a load or store at a location that
                                                     does not permit the operation                                      */


/* =============================================  APM32_SCB CFSR MUNSTKERR [3..3]  ============================================= */
                                  /* APM32_SCB_CFSR_MUNSTKERR                                             */
#define APM32_SCB_CFSR_MUNSTKERR_0               0U      /* 0 : no unstacking fault                                            */
#define APM32_SCB_CFSR_MUNSTKERR_1               1U      /* 1 : unstack for an exception return has caused one or more access
                                                     violations                                                         */


/* ==============================================  APM32_SCB CFSR MSTKERR [4..4]  ============================================== */
                                   /* APM32_SCB_CFSR_MSTKERR                                               */
#define APM32_SCB_CFSR_MSTKERR_0                 0U      /* 0 : no stacking fault                                              */
#define APM32_SCB_CFSR_MSTKERR_1                 1U      /* 1 : stacking for an exception entry has caused one or more access
                                                     violations                                                         */


/* ==============================================  APM32_SCB CFSR MLSPERR [5..5]  ============================================== */
                                 /* APM32_SCB_CFSR_MLSPERR                                               */
#define APM32_SCB_CFSR_MLSPERR_0                 0U      /* 0 : No MemManage fault occurred during floating-point lazy state
                                                     preservation                                                       */
#define APM32_SCB_CFSR_MLSPERR_1                 1U      /* 1 : A MemManage fault occurred during floating-point lazy state
                                                     preservation                                                       */


/* =============================================  APM32_SCB CFSR MMARVALID [7..7]  ============================================= */
                                  /* APM32_SCB_CFSR_MMARVALID                                             */
#define APM32_SCB_CFSR_MMARVALID_0               0U      /* 0 : value in MMAR is not a valid fault address                     */
#define APM32_SCB_CFSR_MMARVALID_1               1U      /* 1 : MMAR holds a valid fault address                               */


/* ==============================================  APM32_SCB CFSR IBUSERR [8..8]  ============================================== */
                                  /* APM32_SCB_CFSR_IBUSERR                                               */
#define APM32_SCB_CFSR_IBUSERR_0                 0U      /* 0 : no instruction bus error                                       */
#define APM32_SCB_CFSR_IBUSERR_1                 1U      /* 1 : instruction bus error                                          */


/* =============================================  APM32_SCB CFSR PRECISERR [9..9]  ============================================= */
                                   /* APM32_SCB_CFSR_PRECISERR                                             */
#define APM32_SCB_CFSR_PRECISERR_0               0U      /* 0 : no precise data bus error                                      */
#define APM32_SCB_CFSR_PRECISERR_1               1U      /* 1 : a data bus error has occurred  and the PC value stacked
                                                     for the exception return points to the instruction that
                                                     caused the fault                                                   */


/* ===========================================  APM32_SCB CFSR IMPRECISERR [10..10]  =========================================== */
                                  /* APM32_SCB_CFSR_IMPRECISERR                                           */
#define APM32_SCB_CFSR_IMPRECISERR_0             0U      /* 0 : no imprecise data bus error                                    */
#define APM32_SCB_CFSR_IMPRECISERR_1             1U      /* 1 : a data bus error has occurred  but the return address in
                                                     the stack frame is not related to the instruction that
                                                     caused the error                                                   */


/* ============================================  APM32_SCB CFSR UNSTKERR [11..11]  ============================================= */
                                  /* APM32_SCB_CFSR_UNSTKERR                                              */
#define APM32_SCB_CFSR_UNSTKERR_0                0U      /* 0 : no unstacking fault                                            */
#define APM32_SCB_CFSR_UNSTKERR_1                1U     /* 1 : unstack for an exception return has caused one or more BusFaults*/


/* =============================================  APM32_SCB CFSR STKERR [12..12]  ============================================== */
                                   /* APM32_SCB_CFSR_STKERR                                                */
#define APM32_SCB_CFSR_STKERR_0                  0U      /* 0 : no stacking fault                                              */
#define APM32_SCB_CFSR_STKERR_1                  1U     /* 1 : stacking for an exception entry has caused one or more BusFaults*/


