MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =============================================  APM32_SCB CFSR LSPERR [13..13]  ============================================== */
                                   /* APM32_SCB_CFSR_LSPERR                                                */
#define APM32_SCB_CFSR_LSPERR_0                  0U  /* 0 : No bus fault occurred during floating-point lazy state preservation*/
#define APM32_SCB_CFSR_LSPERR_1                  1U  /* 1 : A bus fault occurred during floating-point lazy state preservation */


/* ============================================  APM32_SCB CFSR BFARVALID [15..15]  ============================================ */
                                  /* APM32_SCB_CFSR_BFARVALID                                             */
#define APM32_SCB_CFSR_BFARVALID_0               0      /* 0 : value in BFAR is not a valid fault address                      */
#define APM32_SCB_CFSR_BFARVALID_1               1      /* 1 : BFAR holds a valid fault address                                */


/* ===========================================  APM32_SCB CFSR UNDEFINSTR [16..16]  ============================================ */
                                   /* APM32_SCB_CFSR_UNDEFINSTR                                            */
#define APM32_SCB_CFSR_UNDEFINSTR_0               0U     /* 0 : no undefined instruction UsageFault                            */
#define APM32_SCB_CFSR_UNDEFINSTR_1               1U     /* 1 : the processor has attempted to execute an undefined instruction*/


/* ============================================  APM32_SCB CFSR INVSTATE [17..17]  ============================================= */
                                  /* APM32_SCB_CFSR_INVSTATE                                              */
#define APM32_SCB_CFSR_INVSTATE_0                 0U     /* 0 : no invalid state UsageFault                                    */
#define APM32_SCB_CFSR_INVSTATE_1                 1U     /* 1 : the processor has attempted to execute an instruction that
                                                     makes illegal use of the EPSR                                      */


/* ==============================================  APM32_SCB CFSR INVPC [18..18]  ============================================== */
                                  /* APM32_SCB_CFSR_INVPC                                                 */
#define APM32_SCB_CFSR_INVPC_0                    0U     /* 0 : no invalid PC load UsageFault                                  */
#define APM32_SCB_CFSR_INVPC_1                    1U      /* 1 : the processor has attempted an illegal load of EXC_RETURN
                                                     to the PC                                                          */


/* ==============================================  APM32_SCB CFSR NOCP [19..19]  =============================================== */
                                   /* APM32_SCB_CFSR_NOCP                                                  */
#define APM32_SCB_CFSR_NOCP_0                     0U     /* 0 : no UsageFault caused by attempting to access a coprocessor     */
#define APM32_SCB_CFSR_NOCP_1                     1U     /* 1 : the processor has attempted to access a coprocessor            */


/* ============================================  APM32_SCB CFSR UNALIGNED [24..24]  ============================================ */
                                  /* APM32_SCB_CFSR_UNALIGNED                                             */
#define APM32_SCB_CFSR_UNALIGNED_0                0U      /* 0 : no unaligned access fault  or unaligned access trapping
                                                     not enabled                                                        */
#define APM32_SCB_CFSR_UNALIGNED_1                1U     /* 1 : the processor has made an unaligned memory access              */


/* ============================================  APM32_SCB CFSR DIVBYZERO [25..25]  ============================================ */
                                   /* APM32_SCB_CFSR_DIVBYZERO                                             */
#define APM32_SCB_CFSR_DIVBYZERO_0                0U      /* 0 : no divide by zero fault  or divide by zero trapping not
                                                     enabled                                                            */
#define APM32_SCB_CFSR_DIVBYZERO_1                1U      /* 1 : the processor has executed an SDIV or UDIV instruction with
                                                     a divisor of 0                                                     */


/* =========================================================  HFSR  ========================================================== */
/* ==============================================  APM32_SCB HFSR VECTTBL [1..1]  ============================================== */
                                   /* APM32_SCB_HFSR_VECTTBL                                               */
#define APM32_SCB_HFSR_VECTTBL_0                  0U     /* 0 : no BusFault on vector table read                               */
#define APM32_SCB_HFSR_VECTTBL_1                  1U     /* 1 : BusFault on vector table read                                  */


/* =============================================  APM32_SCB HFSR FORCED [30..30]  ============================================== */
                                  /* APM32_SCB_HFSR_FORCED                                                */
#define APM32_SCB_HFSR_FORCED_0                   0U     /* 0 : no forced HardFault                                            */
#define APM32_SCB_HFSR_FORCED_1                   1U     /* 1 : forced HardFault                                               */


/* =========================================================  DFSR  ========================================================== */
/* ==============================================  APM32_SCB DFSR HALTED [0..0]  =============================================== */
                                  /* APM32_SCB_DFSR_HALTED                                                */
#define APM32_SCB_DFSR_HALTED_0                   0U     /* 0 : No active halt request debug event                             */
#define APM32_SCB_DFSR_HALTED_1                   1U     /* 1 : Halt request debug event active                                */


