MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===============================================  APM32_SCB DFSR BKPT [1..1]  ================================================ */
                                  /* APM32_SCB_DFSR_BKPT                                                  */
#define APM32_SCB_DFSR_BKPT_0                     0U     /* 0 : No current breakpoint debug event                              */
#define APM32_SCB_DFSR_BKPT_1                     1U     /* 1 : At least one current breakpoint debug event                    */


/* ==============================================  APM32_SCB DFSR DWTTRAP [2..2]  ============================================== */
                                   /* APM32_SCB_DFSR_DWTTRAP                                               */
#define APM32_SCB_DFSR_DWTTRAP_0                  0U      /* 0 : No current debug events generated by the DWT                  */
#define APM32_SCB_DFSR_DWTTRAP_1                  1U      /* 1 : At least one current debug event generated by the DWT         */


/* ==============================================  APM32_SCB DFSR VCATCH [3..3]  =============================================== */
                                  /* APM32_SCB_DFSR_VCATCH                                                       */
#define APM32_SCB_DFSR_VCATCH_0                   0U      /* 0 : No Vector catch triggered                                     */
#define APM32_SCB_DFSR_VCATCH_1                   1U      /* 1 : Vector catch triggered                                         */


/* =============================================  APM32_SCB DFSR EXTERNAL [4..4]  ============================================== */
                                   /* APM32_SCB_DFSR_EXTERNAL                                              */
#define APM32_SCB_DFSR_EXTERNAL_0                 0U      /* 0 : No EDBGRQ debug event                                          */
#define APM32_SCB_DFSR_EXTERNAL_1                 1U      /* 1 : EDBGRQ debug event                                             */


/* =========================================================  MMFAR  ========================================================= */
/* =========================================================  BFAR  ========================================================== */
/* =========================================================  AFSR  ========================================================== */
/* =========================================================  CPACR  ========================================================= */
/* ==============================================  APM32_SCB CPACR CP10 [20..21]  ============================================== */
                                   /* APM32_SCB_CPACR_CP10                                                 */
#define APM32_SCB_CPACR_CP10_00                   0U    /* 00 : Access denied. Any attempted access generates a NOCP UsageFault*/
#define APM32_SCB_CPACR_CP10_01                   1U      /* 01 : Privileged access only. An unprivileged access generates
                                                     a NOCP fault.                                                      */
#define APM32_SCB_CPACR_CP10_10                   2U      /* 10 : Reserved. The result of any access is UNPREDICTABLE.          */
#define APM32_SCB_CPACR_CP10_11                   3U      /* 11 : Full access.                                                  */
 /* ==============================================  APM32_SCB CPACR CP11 [22..23]  ============================================== */
                                  /* APM32_SCB_CPACR_CP11                                                 */
#define APM32_SCB_CPACR_CP11_00                   0U   /* 00 : Access denied. Any attempted access generates a NOCP UsageFault  */
#define APM32_SCB_CPACR_CP11_01                   1U      /* 01 : Privileged access only. An unprivileged access generates
                                                     a NOCP fault.                                                      */
#define APM32_SCB_CPACR_CP11_10                   2U      /* 10 : Reserved. The result of any access is UNPREDICTABLE.          */
#define APM32_SCB_CPACR_CP11_11                   3U      /* 11 : Full access.                                                  */


/* =========================================================  FPCCR  ========================================================= */
/* ==============================================  APM32_SCB FPCCR LSPACT [0..0]  ============================================== */
                                 /* APM32_SCB_FPCCR_LSPACT                                               */
#define APM32_SCB_FPCCR_LSPACT_0                  0U      /* 0 : Lazy state preservation is not active.                         */
#define APM32_SCB_FPCCR_LSPACT_1                  1U      /* 1 : Lazy state preservation is active. floating-point stack
                                                     frame has been allocated but saving state to it has been
                                                     deferred.                                                                 */


/* ===============================================  APM32_SCB FPCCR USER [1..1]  =============================================== */
                                  /* APM32_SCB_FPCCR_USER                                                        */
#define APM32_SCB_FPCCR_USER_0                    0U      /* 0 : Privilege level was not user when the floating-point stack
                                                     frame was allocated.                                                      */
#define APM32_SCB_FPCCR_USER_1                    1U      /* 1 : Privilege level was user when the floating-point stack frame
                                                     was allocated.                                                            */


/* ==============================================  APM32_SCB FPCCR THREAD [3..3]  ============================================== */
                                  /* APM32_SCB_FPCCR_THREAD                                                      */
#define APM32_SCB_FPCCR_THREAD_0                  0U      /* 0 : Mode was not Thread Mode when the floating-point stack frame
                                                     was allocated.                                                            */
#define APM32_SCB_FPCCR_THREAD_1                  1U      /* 1 : Mode was Thread Mode when the floating-point stack frame
                                                     was allocated.                                                            */


/* ==============================================  APM32_SCB FPCCR HFRDY [4..4]  =============================================== */
                                  /* APM32_SCB_FPCCR_HFRDY                                                       */
#define APM32_SCB_FPCCR_HFRDY_0                   0U      /* 0 : Priority did not permit setting the HardFault handler to
                                                     the pending state when the floating-point stack frame was
                                                     allocated.                                                                */
#define APM32_SCB_FPCCR_HFRDY_1                   1U      /* 1 : Priority permitted setting the HardFault handler to the
                                                     pending state when the floating-point stack frame was allocated.          */


