MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ===========================================  APM32_SysTick CSR CLKSOURCE [2..2]  ============================================ */
                                  /* APM32_SysTick_CSR_CLKSOURCE                                          */
#define APM32_SysTick_CSR_CLKSOURCE_0            0U      /* 0 : external clock                                                 */
#define APM32_SysTick_CSR_CLKSOURCE_1            1U      /* 1 : processor clock                                                */


/* ==========================================================  RVR  ========================================================== */
/* ==========================================================  CVR  ========================================================== */
/* =========================================================  CALIB  ========================================================= */
/* ============================================  APM32_SysTick CALIB SKEW [30..30]  ============================================ */
                                  /* APM32_SysTick_CALIB_SKEW                                             */
#define APM32_SysTick_CALIB_SKEW_0               0U      /* 0 : TENMS value is exact                                           */
#define APM32_SysTick_CALIB_SKEW_1               1U      /* 1 : TENMS value is inexact  or not given                           */


/* ===========================================  APM32_SysTick CALIB NOREF [31..31]  ============================================ */
                                   /* APM32_SysTick_CALIB_NOREF                                            */
#define APM32_SysTick_CALIB_NOREF_0              0U      /* 0 : The reference clock is provided                                */
#define APM32_SysTick_CALIB_NOREF_1              1U      /* 1 : The reference clock is not provided                            */



/* =========================================================================================================================== */
/* ================                                           APM32_NVIC                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  NVICISER0  ======================================================= */
/* =======================================================  NVICISER1  ======================================================= */
/* =======================================================  NVICISER2  ======================================================= */
/* =======================================================  NVICISER3  ======================================================= */
/* =======================================================  NVICISER4  ======================================================= */
/* =======================================================  NVICISER5  ======================================================= */
/* =======================================================  NVICISER6  ======================================================= */
/* =======================================================  NVICISER7  ======================================================= */
/* =======================================================  NVICICER0  ======================================================= */
/* =======================================================  NVICICER1  ======================================================= */
/* =======================================================  NVICICER2  ======================================================= */
/* =======================================================  NVICICER3  ======================================================= */
/* =======================================================  NVICICER4  ======================================================= */
/* =======================================================  NVICICER5  ======================================================= */
/* =======================================================  NVICICER6  ======================================================= */
/* =======================================================  NVICICER7  ======================================================= */
/* =======================================================  NVICISPR0  ======================================================= */
/* =======================================================  NVICISPR1  ======================================================= */
/* =======================================================  NVICISPR2  ======================================================= */
/* =======================================================  NVICISPR3  ======================================================= */
/* =======================================================  NVICISPR4  ======================================================= */
/* =======================================================  NVICISPR5  ======================================================= */
/* =======================================================  NVICISPR6  ======================================================= */
/* =======================================================  NVICISPR7  ======================================================= */
/* =======================================================  NVICICPR0  ======================================================= */
/* =======================================================  NVICICPR1  ======================================================= */
/* =======================================================  NVICICPR2  ======================================================= */
/* =======================================================  NVICICPR3  ======================================================= */
/* =======================================================  NVICICPR4  ======================================================= */
/* =======================================================  NVICICPR5  ======================================================= */
/* =======================================================  NVICICPR6  ======================================================= */
/* =======================================================  NVICICPR7  ======================================================= */
/* =======================================================  NVICIABR0  ======================================================= */
/* =======================================================  NVICIABR1  ======================================================= */
/* =======================================================  NVICIABR2  ======================================================= */
/* =======================================================  NVICIABR3  ======================================================= */
/* =======================================================  NVICIABR4  ======================================================= */
/* =======================================================  NVICIABR5  ======================================================= */
/* =======================================================  NVICIABR6  ======================================================= */
/* =======================================================  NVICIABR7  ======================================================= */
/* ========================================================  NVICIP0  ======================================================== */
/* ========================================================  NVICIP1  ======================================================== */
/* ========================================================  NVICIP2  ======================================================== */
/* ========================================================  NVICIP3  ======================================================== */
/* ========================================================  NVICIP4  ======================================================== */
/* ========================================================  NVICIP5  ======================================================== */
/* ========================================================  NVICIP6  ======================================================== */
/* ========================================================  NVICIP7  ======================================================== */
/* ========================================================  NVICIP8  ======================================================== */
/* ========================================================  NVICIP9  ======================================================== */
/* =======================================================  NVICIP10  ======================================================== */
/* =======================================================  NVICIP11  ======================================================== */
/* =======================================================  NVICIP12  ======================================================== */
/* =======================================================  NVICIP13  ======================================================== */
/* =======================================================  NVICIP14  ======================================================== */
/* =======================================================  NVICIP15  ======================================================== */
/* =======================================================  NVICIP16  ======================================================== */
/* =======================================================  NVICIP17  ======================================================== */
/* =======================================================  NVICIP18  ======================================================== */
/* =======================================================  NVICIP19  ======================================================== */
/* =======================================================  NVICIP20  ======================================================== */
/* =======================================================  NVICIP21  ======================================================== */
/* =======================================================  NVICIP22  ======================================================== */
/* =======================================================  NVICIP23  ======================================================== */
/* =======================================================  NVICIP24  ======================================================== */
/* =======================================================  NVICIP25  ======================================================== */
/* =======================================================  NVICIP26  ======================================================== */
/* =======================================================  NVICIP27  ======================================================== */
/* =======================================================  NVICIP28  ======================================================== */
/* =======================================================  NVICIP29  ======================================================== */
/* =======================================================  NVICIP30  ======================================================== */
/* =======================================================  NVICIP31  ======================================================== */
/* =======================================================  NVICIP32  ======================================================== */
/* =======================================================  NVICIP33  ======================================================== */
/* =======================================================  NVICIP34  ======================================================== */
/* =======================================================  NVICIP35  ======================================================== */
/* =======================================================  NVICIP36  ======================================================== */
/* =======================================================  NVICIP37  ======================================================== */
/* =======================================================  NVICIP38  ======================================================== */
/* =======================================================  NVICIP39  ======================================================== */
/* =======================================================  NVICIP40  ======================================================== */
/* =======================================================  NVICIP41  ======================================================== */
/* =======================================================  NVICIP42  ======================================================== */
/* =======================================================  NVICIP43  ======================================================== */
/* =======================================================  NVICIP44  ======================================================== */
/* =======================================================  NVICIP45  ======================================================== */
/* =======================================================  NVICIP46  ======================================================== */
/* =======================================================  NVICIP47  ======================================================== */
/* =======================================================  NVICIP48  ======================================================== */
/* =======================================================  NVICIP49  ======================================================== */
/* =======================================================  NVICIP50  ======================================================== */
/* =======================================================  NVICIP51  ======================================================== */
/* =======================================================  NVICIP52  ======================================================== */
/* =======================================================  NVICIP53  ======================================================== */
/* =======================================================  NVICIP54  ======================================================== */
/* =======================================================  NVICIP55  ======================================================== */
/* =======================================================  NVICIP56  ======================================================== */
/* =======================================================  NVICIP57  ======================================================== */
/* =======================================================  NVICIP58  ======================================================== */
/* =======================================================  NVICIP59  ======================================================== */
/* =======================================================  NVICIP60  ======================================================== */
/* =======================================================  NVICIP61  ======================================================== */
/* =======================================================  NVICIP62  ======================================================== */
/* =======================================================  NVICIP63  ======================================================== */
/* =======================================================  NVICIP64  ======================================================== */
/* =======================================================  NVICIP65  ======================================================== */
/* =======================================================  NVICIP66  ======================================================== */
/* =======================================================  NVICIP67  ======================================================== */
/* =======================================================  NVICIP68  ======================================================== */
/* =======================================================  NVICIP69  ======================================================== */
/* =======================================================  NVICIP70  ======================================================== */
/* =======================================================  NVICIP71  ======================================================== */
/* =======================================================  NVICIP72  ======================================================== */
/* =======================================================  NVICIP73  ======================================================== */
/* =======================================================  NVICIP74  ======================================================== */
/* =======================================================  NVICIP75  ======================================================== */
/* =======================================================  NVICIP76  ======================================================== */
/* =======================================================  NVICIP77  ======================================================== */
/* =======================================================  NVICIP78  ======================================================== */
/* =======================================================  NVICIP79  ======================================================== */
/* =======================================================  NVICIP80  ======================================================== */
/* =======================================================  NVICIP81  ======================================================== */
/* =======================================================  NVICIP82  ======================================================== */
/* =======================================================  NVICIP83  ======================================================== */
/* =======================================================  NVICIP84  ======================================================== */
/* =======================================================  NVICIP85  ======================================================== */
/* =======================================================  NVICIP86  ======================================================== */
/* =======================================================  NVICIP87  ======================================================== */
/* =======================================================  NVICIP88  ======================================================== */
/* =======================================================  NVICIP89  ======================================================== */
/* =======================================================  NVICIP90  ======================================================== */
/* =======================================================  NVICIP91  ======================================================== */
/* =======================================================  NVICIP92  ======================================================== */
/* =======================================================  NVICIP93  ======================================================== */
/* =======================================================  NVICIP94  ======================================================== */
/* =======================================================  NVICIP95  ======================================================== */
/* =======================================================  NVICIP96  ======================================================== */
/* =======================================================  NVICIP97  ======================================================== */
/* =======================================================  NVICIP98  ======================================================== */
/* =======================================================  NVICIP99  ======================================================== */
/* =======================================================  NVICIP100  ======================================================= */
/* =======================================================  NVICIP101  ======================================================= */
/* =======================================================  NVICIP102  ======================================================= */
/* =======================================================  NVICIP103  ======================================================= */
/* =======================================================  NVICIP104  ======================================================= */
/* =======================================================  NVICIP105  ======================================================= */
/* =======================================================  NVICIP106  ======================================================= */
/* =======================================================  NVICIP107  ======================================================= */
/* =======================================================  NVICIP108  ======================================================= */
/* =======================================================  NVICIP109  ======================================================= */
/* =======================================================  NVICIP110  ======================================================= */
/* =======================================================  NVICIP111  ======================================================= */
/* =======================================================  NVICIP112  ======================================================= */
/* =======================================================  NVICIP113  ======================================================= */
/* =======================================================  NVICIP114  ======================================================= */
/* =======================================================  NVICIP115  ======================================================= */
/* =======================================================  NVICIP116  ======================================================= */
/* =======================================================  NVICIP117  ======================================================= */
/* =======================================================  NVICIP118  ======================================================= */
/* =======================================================  NVICIP119  ======================================================= */
/* =======================================================  NVICIP120  ======================================================= */
/* =======================================================  NVICIP121  ======================================================= */
/* =======================================================  NVICIP122  ======================================================= */
/* =======================================================  NVICIP123  ======================================================= */
/* =======================================================  NVICIP124  ======================================================= */
/* =======================================================  NVICIP125  ======================================================= */
