MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* =======================================================  NVICIP126  ======================================================= */
/* =======================================================  NVICIP127  ======================================================= */
/* =======================================================  NVICIP128  ======================================================= */
/* =======================================================  NVICIP129  ======================================================= */
/* =======================================================  NVICIP130  ======================================================= */
/* =======================================================  NVICIP131  ======================================================= */
/* =======================================================  NVICIP132  ======================================================= */
/* =======================================================  NVICIP133  ======================================================= */
/* =======================================================  NVICIP134  ======================================================= */
/* =======================================================  NVICIP135  ======================================================= */
/* =======================================================  NVICIP136  ======================================================= */
/* =======================================================  NVICIP137  ======================================================= */
/* =======================================================  NVICIP138  ======================================================= */
/* =======================================================  NVICIP139  ======================================================= */
/* =======================================================  NVICIP140  ======================================================= */
/* =======================================================  NVICIP141  ======================================================= */
/* =======================================================  NVICIP142  ======================================================= */
/* =======================================================  NVICIP143  ======================================================= */
/* =======================================================  NVICIP144  ======================================================= */
/* =======================================================  NVICIP145  ======================================================= */
/* =======================================================  NVICIP146  ======================================================= */
/* =======================================================  NVICIP147  ======================================================= */
/* =======================================================  NVICIP148  ======================================================= */
/* =======================================================  NVICIP149  ======================================================= */
/* =======================================================  NVICIP150  ======================================================= */
/* =======================================================  NVICIP151  ======================================================= */
/* =======================================================  NVICIP152  ======================================================= */
/* =======================================================  NVICIP153  ======================================================= */
/* =======================================================  NVICIP154  ======================================================= */
/* =======================================================  NVICIP155  ======================================================= */
/* =======================================================  NVICIP156  ======================================================= */
/* =======================================================  NVICIP157  ======================================================= */
/* =======================================================  NVICIP158  ======================================================= */
/* =======================================================  NVICIP159  ======================================================= */
/* =======================================================  NVICIP160  ======================================================= */
/* =======================================================  NVICIP161  ======================================================= */
/* =======================================================  NVICIP162  ======================================================= */
/* =======================================================  NVICIP163  ======================================================= */
/* =======================================================  NVICIP164  ======================================================= */
/* =======================================================  NVICIP165  ======================================================= */
/* =======================================================  NVICIP166  ======================================================= */
/* =======================================================  NVICIP167  ======================================================= */
/* =======================================================  NVICIP168  ======================================================= */
/* =======================================================  NVICIP169  ======================================================= */
/* =======================================================  NVICIP170  ======================================================= */
/* =======================================================  NVICIP171  ======================================================= */
/* =======================================================  NVICIP172  ======================================================= */
/* =======================================================  NVICIP173  ======================================================= */
/* =======================================================  NVICIP174  ======================================================= */
/* =======================================================  NVICIP175  ======================================================= */
/* =======================================================  NVICIP176  ======================================================= */
/* =======================================================  NVICIP177  ======================================================= */
/* =======================================================  NVICIP178  ======================================================= */
/* =======================================================  NVICIP179  ======================================================= */
/* =======================================================  NVICIP180  ======================================================= */
/* =======================================================  NVICIP181  ======================================================= */
/* =======================================================  NVICIP182  ======================================================= */
/* =======================================================  NVICIP183  ======================================================= */
/* =======================================================  NVICIP184  ======================================================= */
/* =======================================================  NVICIP185  ======================================================= */
/* =======================================================  NVICIP186  ======================================================= */
/* =======================================================  NVICIP187  ======================================================= */
/* =======================================================  NVICIP188  ======================================================= */
/* =======================================================  NVICIP189  ======================================================= */
/* =======================================================  NVICIP190  ======================================================= */
/* =======================================================  NVICIP191  ======================================================= */
/* =======================================================  NVICIP192  ======================================================= */
/* =======================================================  NVICIP193  ======================================================= */
/* =======================================================  NVICIP194  ======================================================= */
/* =======================================================  NVICIP195  ======================================================= */
/* =======================================================  NVICIP196  ======================================================= */
/* =======================================================  NVICIP197  ======================================================= */
/* =======================================================  NVICIP198  ======================================================= */
/* =======================================================  NVICIP199  ======================================================= */
/* =======================================================  NVICIP200  ======================================================= */
/* =======================================================  NVICIP201  ======================================================= */
/* =======================================================  NVICIP202  ======================================================= */
/* =======================================================  NVICIP203  ======================================================= */
/* =======================================================  NVICIP204  ======================================================= */
/* =======================================================  NVICIP205  ======================================================= */
/* =======================================================  NVICIP206  ======================================================= */
/* =======================================================  NVICIP207  ======================================================= */
/* =======================================================  NVICIP208  ======================================================= */
/* =======================================================  NVICIP209  ======================================================= */
/* =======================================================  NVICIP210  ======================================================= */
/* =======================================================  NVICIP211  ======================================================= */
/* =======================================================  NVICIP212  ======================================================= */
/* =======================================================  NVICIP213  ======================================================= */
/* =======================================================  NVICIP214  ======================================================= */
/* =======================================================  NVICIP215  ======================================================= */
/* =======================================================  NVICIP216  ======================================================= */
/* =======================================================  NVICIP217  ======================================================= */
/* =======================================================  NVICIP218  ======================================================= */
/* =======================================================  NVICIP219  ======================================================= */
/* =======================================================  NVICIP220  ======================================================= */
/* =======================================================  NVICIP221  ======================================================= */
/* =======================================================  NVICIP222  ======================================================= */
/* =======================================================  NVICIP223  ======================================================= */
/* =======================================================  NVICIP224  ======================================================= */
/* =======================================================  NVICIP225  ======================================================= */
/* =======================================================  NVICIP226  ======================================================= */
/* =======================================================  NVICIP227  ======================================================= */
/* =======================================================  NVICIP228  ======================================================= */
/* =======================================================  NVICIP229  ======================================================= */
/* =======================================================  NVICIP230  ======================================================= */
/* =======================================================  NVICIP231  ======================================================= */
/* =======================================================  NVICIP232  ======================================================= */
/* =======================================================  NVICIP233  ======================================================= */
/* =======================================================  NVICIP234  ======================================================= */
/* =======================================================  NVICIP235  ======================================================= */
/* =======================================================  NVICIP236  ======================================================= */
/* =======================================================  NVICIP237  ======================================================= */
/* =======================================================  NVICIP238  ======================================================= */
/* =======================================================  NVICIP239  ======================================================= */
/* =======================================================  NVICSTIR  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            MC                                             ================ */
/* =========================================================================================================================== */

/* ========================================================  SINCSTS  ======================================================== */
/* ===============================================  MC SINCSTS SINCFLG [0..7]  =============================================== */
                                  /* MC_SINCSTS_SINCFLG                                                 */
#define MC_SINCSTS_SINCFLG_0                    0U      /* 0 : A bus slave connection to AXBS input port n is absent          */
#define MC_SINCSTS_SINCFLG_1                    1U      /* 1 : A bus slave connection to AXBS input port n is present         */


/* ========================================================  MINCSTS  ======================================================== */
/* ===============================================  MC MINCSTS MINCFLG [0..7]  =============================================== */
                                  /* MC_MINCSTS_MINCFLG                                                 */
#define MC_MINCSTS_MINCFLG_0                    0U      /* 0 : A bus master connection to AXBS input port n is absent         */
#define MC_MINCSTS_MINCFLG_1                    1U      /* 1 : A bus master connection to AXBS input port n is present        */


/* ========================================================  CPCTRL  ========================================================= */
/* ================================================  MC CPCTRL HMSTS [0..1]  ================================================= */
                                 /* MC_CPCTRL_HMSTS                                                    */
#define MC_CPCTRL_HMSTS_00                     0U      /* 00 : Waiting for request                                           */
#define MC_CPCTRL_HMSTS_01                     1U      /* 01 : Waiting for platform idle                                     */
#define MC_CPCTRL_HMSTS_11                     3U      /* 11 : Platform stalled                                              */
#define MC_CPCTRL_HMSTS_10                     2U      /* 10 : Unused state                                                  */


/* ==============================================  MC CPCTRL RXHREQFLG [2..2]  =============================================== */
                                  /* MC_CPCTRL_RXHREQFLG                                                */
#define MC_CPCTRL_RXHREQFLG_0                  0U      /* 0 : AXBS is not receiving halt request                             */
#define MC_CPCTRL_RXHREQFLG_1                  1U      /* 1 : AXBS is receiving halt request                                 */

/* =================================================  MC CPCTRL HSTS [3..3]  ================================================= */
                                  /* MC_CPCTRL_HSTS                                                     */
#define MC_CPCTRL_HSTS_0                       0U      /* 0 : AXBS is not currently halted                                   */
#define MC_CPCTRL_HSTS_1                       1U      /* 1 : AXBS is currently halted                                       */


/* ==============================================  MC CPCTRL FMCPGISTS [4..4]  =============================================== */
                                  /* MC_CPCTRL_FMCPGISTS                                                */
#define MC_CPCTRL_FMCPGISTS_0                  0U      /* 0 : FMC program flash is not idle                                  */
#define MC_CPCTRL_FMCPGISTS_1                  1U      /* 1 : FMC program flash is currently idle                            */


/* ===============================================  MC CPCTRL ACISTS [6..6]  =============================================== */
                                  /* MC_CPCTRL_ACISTS                                                 */
#define MC_CPCTRL_ACISTS_0                   0U      /* 0 : PBRIDGE is not idle                                            */
#define MC_CPCTRL_ACISTS_1                   1U      /* 1 : PBRIDGE is currently idle                                      */


/* ================================================  MC CPCTRL CASEL [9..9]  ================================================= */
                                  /* MC_CPCTRL_CASEL                                                    */
#define MC_CPCTRL_CASEL_0                      0U      /* 0 : Fixed-priority arbitration                                     */
#define MC_CPCTRL_CASEL_1                      1U      /* 1 : Round-robin arbitration                                        */


/* ==============================================  MC CPCTRL SHAPCFG [24..25]  =============================================== */
                                 /* MC_CPCTRL_SHAPCFG                                                  */
#define MC_CPCTRL_SHAPCFG_00                   0U      /* 00 : Round robin                                                   */
#define MC_CPCTRL_SHAPCFG_01                   1U      /* 01 : Special round robin (favors SRAM backdoor accesses over
                                                     the processor)                                                     */
#define MC_CPCTRL_SHAPCFG_10                   2U      /* 10 : Fixed priority. Processor has highest  backdoor has lowest    */
#define MC_CPCTRL_SHAPCFG_11                   3U      /* 11 : Fixed priority. Backdoor has highest  processor has lowest    */


/* ==============================================  MC CPCTRL SLAPCFG [28..29]  =============================================== */
                                  /* MC_CPCTRL_SLAPCFG                                                  */
#define MC_CPCTRL_SLAPCFG_00                   0U      /* 00 : Round robin                                                   */
#define MC_CPCTRL_SLAPCFG_01                   1U      /* 01 : Special round robin (favors SRAM backdoor accesses over
                                                     the processor)                                                     */
#define MC_CPCTRL_SLAPCFG_10                   2U      /* 10 : Fixed priority. Processor has highest  backdoor has lowest    */
#define MC_CPCTRL_SLAPCFG_11                   3U      /* 11 : Fixed priority. Backdoor has highest  processor has lowest    */


/* ======================================================  FPU_INTCSTS  ====================================================== */
/* ===========================================  MC FPU_INTCSTS INVALIDIFLG [8..8]  =========================================== */
                                  /* MC_FPU_INTCSTS_INVALIDIFLG                                         */
#define MC_FPU_INTCSTS_INVALIDIFLG_0           0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_INVALIDIFLG_1           1U      /* 1 : Interrupt occurred                                             */


/* ============================================  MC FPU_INTCSTS ZEROIFLG [9..9]  ============================================= */
                                 /* MC_FPU_INTCSTS_ZEROIFLG                                            */
#define MC_FPU_INTCSTS_ZEROIFLG_0              0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_ZEROIFLG_1              1U      /* 1 : Interrupt occurred                                             */


