MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ============================================  MC FPU_INTCSTS OVRIFLG [10..10]  ============================================ */
                                  /* MC_FPU_INTCSTS_OVRIFLG                                             */
#define MC_FPU_INTCSTS_OVRIFLG_0                0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_OVRIFLG_1                1U      /* 1 : Interrupt occurred                                             */


/* ============================================  MC FPU_INTCSTS UDRIFLG [11..11]  ============================================ */
                                 /* MC_FPU_INTCSTS_UDRIFLG                                             */
#define MC_FPU_INTCSTS_UDRIFLG_0                0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_UDRIFLG_1                1U      /* 1 : Interrupt occurred                                             */


/* ==========================================  MC FPU_INTCSTS INEXACTIFLG [12..12]  ========================================== */
                                  /* MC_FPU_INTCSTS_INEXACTIFLG                                         */
#define MC_FPU_INTCSTS_INEXACTIFLG_0            0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_INEXACTIFLG_1            1U      /* 1 : Interrupt occurred                                             */


/* ============================================  MC FPU_INTCSTS INDIFLG [15..15]  ============================================ */
                                 /* MC_FPU_INTCSTS_INDIFLG                                             */
#define MC_FPU_INTCSTS_INDIFLG_0                0U      /* 0 : No interrupt                                                   */
#define MC_FPU_INTCSTS_INDIFLG_1                1U      /* 1 : Interrupt occurred                                             */


/* ===========================================  MC FPU_INTCSTS INVALIDEN [24..24]  =========================================== */
                                  /* MC_FPU_INTCSTS_INVALIDEN                                           */
#define MC_FPU_INTCSTS_INVALIDEN_0              0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_INVALIDEN_1              1U      /* 1 : Enable interrupt                                               */


/* ============================================  MC FPU_INTCSTS ZEROEN [25..25]  ============================================= */
                                  /* MC_FPU_INTCSTS_ZEROEN                                              */
#define MC_FPU_INTCSTS_ZEROEN_0                 0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_ZEROEN_1                 1U      /* 1 : Enable interrupt                                               */


/* ============================================  MC FPU_INTCSTS OVRIEN [26..26]  ============================================= */
                                  /* MC_FPU_INTCSTS_OVRIEN                                              */
#define MC_FPU_INTCSTS_OVRIEN_0                 0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_OVRIEN_1                 1U      /* 1 : Enable interrupt                                               */


/* ============================================  MC FPU_INTCSTS UDRIEN [27..27]  ============================================= */
                                /* MC_FPU_INTCSTS_UDRIEN                                              */
#define MC_FPU_INTCSTS_UDRIEN_0                 0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_UDRIEN_1                 1U      /* 1 : Enable interrupt                                               */


/* ==========================================  MC FPU_INTCSTS INEXACTIEN [28..28]  =========================================== */
                                   /* MC_FPU_INTCSTS_INEXACTIEN                                          */
#define MC_FPU_INTCSTS_INEXACTIEN_0             0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_INEXACTIEN_1             1U      /* 1 : Enable interrupt                                               */


/* ============================================  MC FPU_INTCSTS INDIEN [31..31]  ============================================= */
                                  /* MC_FPU_INTCSTS_INDIEN                                              */
#define MC_FPU_INTCSTS_INDIEN_0                0U      /* 0 : Disable interrupt                                              */
#define MC_FPU_INTCSTS_INDIEN_1                1U      /* 1 : Enable interrupt                                               */


/* ==========================================================  PID  ========================================================== */
/* ========================================================  COCTRL  ========================================================= */
/* ================================================  MC COCTRL COREQ [0..0]  ================================================= */
                                  /* MC_COCTRL_COREQ                                                    */
#define MC_COCTRL_COREQ_0                      0U      /* 0 : Request is cleared.                                            */
#define MC_COCTRL_COREQ_1                      1U      /* 1 : Request Compute Operation.                                     */


/* ================================================  MC COCTRL COACK [1..1]  ================================================= */
                                   /* MC_COCTRL_COACK                                                    */
#define MC_COCTRL_COACK_0                      0U      /* 0 : Compute operation entry has not completed or compute operation
                                                     exit has completed.                                                */
#define MC_COCTRL_COACK_1                      1U      /* 1 : Compute operation entry has completed or compute operation
                                                     exit has not completed.                                            */


/* ================================================  MC COCTRL COWBI [2..2]  ================================================= */
                                  /* MC_COCTRL_COWBI                                                    */
#define MC_COCTRL_COWBI_0                      0U      /* 0 : No effect.                                                     */
#define MC_COCTRL_COWBI_1                      1U      /* 1 : When set  the CPOREQ is cleared on any interrupt or exception
                                                     vector fetch.                                                      */


/* ========================================================  LMDES0  ========================================================= */
/* ================================================  MC LMDES0 TSEL [13..15]  ================================================ */
                                  /* MC_LMDES0_TSEL                                                     */
#define MC_LMDES0_TSEL_000                     0U      /* 000 : SRAM_L                                                       */
#define MC_LMDES0_TSEL_001                     1U      /* 001 : SRAM_U                                                       */


/* ================================================  MC LMDES0 LOCK [16..16]  ================================================ */
                                  /* MC_LMDES0_LOCK                                                     */
#define MC_LMDES0_LOCK_0                       0U      /* 0 : Writes to the LMDRn[7:0] are allowed.                          */
#define MC_LMDES0_LOCK_1                       1U      /* 1 : Writes to the LMDRn[7:0] are ignored.                          */


/* ===============================================  MC LMDES0 DPWSEL [17..19]  =============================================== */
                                  /* MC_LMDES0_DPWSEL                                                   */
#define MC_LMDES0_DPWSEL_010                   2U      /* 010 : LMEMn 32-bits wide                                           */
#define MC_LMDES0_DPWSEL_011                   3U      /* 011 : LMEMn 64-bits wide                                           */


/* ===============================================  MC LMDES0 CWCFG [20..23]  ================================================ */
                                  /* MC_LMDES0_CWCFG                                                    */
#define MC_LMDES0_CWCFG_0000                   0U      /* 0000 : No Cache                                                    */
#define MC_LMDES0_CWCFG_0010                   2U      /* 0010 : 2-Way Set Associative                                       */
#define MC_LMDES0_CWCFG_0100                   4U      /* 0100 : 4-Way Set Associative                                       */


/* ================================================  MC LMDES0 SIZE [24..27]  ================================================ */
                                  /* MC_LMDES0_SIZE                                                     */
#define MC_LMDES0_SIZE_0000                     0U      /* 0000 : no LMEMn (0 KB)                                             */
#define MC_LMDES0_SIZE_0001                     1U      /* 0001 : 1 KB LMEMn                                                  */
#define MC_LMDES0_SIZE_0010                     2U      /* 0010 : 2 KB LMEMn                                                  */
#define MC_LMDES0_SIZE_0011                     3U      /* 0011 : 4 KB LMEMn                                                  */
#define MC_LMDES0_SIZE_0100                     4U      /* 0100 : 8 KB LMEMn                                                  */
#define MC_LMDES0_SIZE_0101                     5U      /* 0101 : 16 KB LMEMn                                                 */
#define MC_LMDES0_SIZE_0110                     6U      /* 0110 : 32 KB LMEMn                                                 */
#define MC_LMDES0_SIZE_0111                     7U      /* 0111 : 64 KB LMEMn                                                 */
#define MC_LMDES0_SIZE_1000                     8U      /* 1000 : 128 KB LMEMn                                                */
#define MC_LMDES0_SIZE_1001                     9U      /* 1001 : 256 KB LMEMn                                                */
#define MC_LMDES0_SIZE_1010                     10U     /* 1010 : 512 KB LMEMn                                                */
#define MC_LMDES0_SIZE_1011                     11U     /* 1011 : 1024 KB LMEMn                                               */
#define MC_LMDES0_SIZE_1100                     12U     /* 1100 : 2048 KB LMEMn                                               */
#define MC_LMDES0_SIZE_1101                     13U     /* 1101 : 4096 KB LMEMn                                               */
#define MC_LMDES0_SIZE_1110                     14U     /* 1110 : 8192 KB LMEMn                                               */
#define MC_LMDES0_SIZE_1111                     15U     /* 1111 : 16384 KB LMEMn                                              */


/* ===============================================  MC LMDES0 SIZEH [28..28]  ================================================ */
                                  /* MC_LMDES0_SIZEH                                                    */
#define MC_LMDES0_SIZEH_0                      0U      /* 0 : LMEMn is a power-of-2 capacity.                                */
#define MC_LMDES0_SIZEH_1                      1U      /* 1 : LMEMn is not a power-of-2  with a capacity is 0.75 * LMSZ.     */


/* ===============================================  MC LMDES0 VALID [31..31]  ================================================ */
                                   /* MC_LMDES0_VALID                                                    */
#define MC_LMDES0_VALID_0                      0U      /* 0 : LMEMn is not present.                                          */
#define MC_LMDES0_VALID_1                      1U      /* 1 : LMEMn is present.                                              */


/* ========================================================  LMDES1  ========================================================= */
/* ================================================  MC LMDES1 TSEL [13..15]  ================================================ */
                                  /* MC_LMDES1_TSEL                                                     */
#define MC_LMDES1_TSEL_000                     0U      /* 000 : SRAM_L                                                       */
#define MC_LMDES1_TSEL_001                     1U      /* 001 : SRAM_U                                                       */


