MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F446RG/mcu.h
/* ================================================  MC LMDES1 LOCK [16..16]  ================================================ */
                                  /* MC_LMDES1_LOCK                                                     */
#define MC_LMDES1_LOCK_0                       0U      /* 0 : Writes to the LMDRn[7:0] are allowed.                          */
#define MC_LMDES1_LOCK_1                       1U      /* 1 : Writes to the LMDRn[7:0] are ignored.                          */


/* ===============================================  MC LMDES1 DPWSEL [17..19]  =============================================== */
                                 /* MC_LMDES1_DPWSEL                                                   */
#define MC_LMDES1_DPWSEL_010                  2U      /* 010 : LMEMn 32-bits wide                                           */
#define MC_LMDES1_DPWSEL_011                  3U      /* 011 : LMEMn 64-bits wide                                           */


/* ===============================================  MC LMDES1 CWCFG [20..23]  ================================================ */
                                   /* MC_LMDES1_CWCFG                                                    */
#define MC_LMDES1_CWCFG_0000                   0U      /* 0000 : No Cache                                                    */
#define MC_LMDES1_CWCFG_0010                   2U      /* 0010 : 2-Way Set Associative                                       */
#define MC_LMDES1_CWCFG_0100                   4U      /* 0100 : 4-Way Set Associative                                       */


/* ================================================  MC LMDES1 SIZE [24..27]  ================================================ */
                                   /* MC_LMDES1_SIZE                                                     */
#define MC_LMDES1_SIZE_0000                     0U      /* 0000 : no LMEMn (0 KB)                                             */
#define MC_LMDES1_SIZE_0001                     1U      /* 0001 : 1 KB LMEMn                                                  */
#define MC_LMDES1_SIZE_0010                     2U      /* 0010 : 2 KB LMEMn                                                  */
#define MC_LMDES1_SIZE_0011                     3U      /* 0011 : 4 KB LMEMn                                                  */
#define MC_LMDES1_SIZE_0100                     4U      /* 0100 : 8 KB LMEMn                                                  */
#define MC_LMDES1_SIZE_0101                     5U      /* 0101 : 16 KB LMEMn                                                 */
#define MC_LMDES1_SIZE_0110                     6U      /* 0110 : 32 KB LMEMn                                                 */
#define MC_LMDES1_SIZE_0111                     7U      /* 0111 : 64 KB LMEMn                                                 */
#define MC_LMDES1_SIZE_1000                     8U      /* 1000 : 128 KB LMEMn                                                */
#define MC_LMDES1_SIZE_1001                     9U      /* 1001 : 256 KB LMEMn                                                */
#define MC_LMDES1_SIZE_1010                     10U     /* 1010 : 512 KB LMEMn                                                */
#define MC_LMDES1_SIZE_1011                     11U     /* 1011 : 1024 KB LMEMn                                               */
#define MC_LMDES1_SIZE_1100                     12U     /* 1100 : 2048 KB LMEMn                                               */
#define MC_LMDES1_SIZE_1101                     13U     /* 1101 : 4096 KB LMEMn                                               */
#define MC_LMDES1_SIZE_1110                     14U     /* 1110 : 8192 KB LMEMn                                               */
#define MC_LMDES1_SIZE_1111                     15U     /* 1111 : 16384 KB LMEMn                                              */


/* ===============================================  MC LMDES1 SIZEH [28..28]  ================================================ */
                                   /* MC_LMDES1_SIZEH                                                    */
#define MC_LMDES1_SIZEH_0                      0U      /* 0 : LMEMn is a power-of-2 capacity.                                */
#define MC_LMDES1_SIZEH_1                      1U      /* 1 : LMEMn is not a power-of-2  with a capacity is 0.75 * LMSZ.     */


/* ===============================================  MC LMDES1 VALID [31..31]  ================================================ */
                                  /* MC_LMDES1_VALID                                                    */
#define MC_LMDES1_VALID_0                      0U      /* 0 : LMEMn is not present.                                          */
#define MC_LMDES1_VALID_1                      1U      /* 1 : LMEMn is present.                                              */


/* ========================================================  LMDES2  ========================================================= */
/* ================================================  MC LMDES2 TSEL [13..15]  ================================================ */
                                  /* MC_LMDES2_TSEL                                                     */
#define MC_LMDES2_TSEL_010                     2U      /* 010 : PC Cache                                                     */


/* ================================================  MC LMDES2 LOCK [16..16]  ================================================ */
                                  /* MC_LMDES2_LOCK                                                     */
#define MC_LMDES2_LOCK_0                       0U      /* 0 : Writes to the LMDRn[7:0] are allowed.                          */
#define MC_LMDES2_LOCK_1                       1U      /* 1 : Writes to the LMDRn[7:0] are ignored.                          */


/* ===============================================  MC LMDES2 DPWSEL [17..19]  =============================================== */
                                   /* MC_LMDES2_DPWSEL                                                   */
#define MC_LMDES2_DPWSEL_010                   2U      /* 010 : LMEMn 32-bits wide                                           */
#define MC_LMDES2_DPWSEL_011                   3U      /* 011 : LMEMn 64-bits wide                                           */


/* ===============================================  MC LMDES2 CWCFG [20..23]  ================================================ */
                                   /* MC_LMDES2_CWCFG                                                    */
#define MC_LMDES2_CWCFG_0000                   0U      /* 0000 : No Cache                                                    */
#define MC_LMDES2_CWCFG_0010                   2U      /* 0010 : 2-Way Set Associative                                       */
#define MC_LMDES2_CWCFG_0100                   4U      /* 0100 : 4-Way Set Associative                                       */


/* ================================================  MC LMDES2 SIZE [24..27]  ================================================ */
                                   /* MC_LMDES2_SIZE                                                     */
#define MC_LMDES2_SIZE_0100                    4U      /* 0100 : 4 KB LMEMn                                                  */


/* ===============================================  MC LMDES2 SIZEH [28..28]  ================================================ */
                                  /* MC_LMDES2_SIZEH                                                    */
#define MC_LMDES2_SIZEH_0                      0U      /* 0 : LMEMn is a power-of-2 capacity.                                */
#define MC_LMDES2_SIZEH_1                      1U      /* 1 : LMEMn is not a power-of-2  with a capacity is 0.75 * LMSZ.     */


